[{"id": 1, "title": "Harry Potter and the Half-Blood Prince", "blurb": "It is the middle of the summer, but there is an unseasonal mist pressing against the windowpanes. Harry Potter is waiting nervously in his bedroom at the Dursleys' house in Privet Drive for a visit from Professor Dumbledore himself. One of the last times he saw the Headmaster was in a fierce one-to-one duel with Lord Voldemort, and Harry can't quite believe that Professor \nIt is the middle of the summer, but there is an unseasonal mist pressing against the windowpanes. Harry Potter is waiting nervously in his bedroom at the Dursleys' house in Privet Drive for a visit from Professor Dumbledore himself. One of the last times he saw the Headmaster was in a fierce one-to-one duel with Lord Voldemort, and Harry can't quite believe that Professor Dumbledore will actually appear at the Dursleys' of all places. Why is the Professor coming to visit him now? What is it that cannot wait until Harry returns to Hogwarts in a few weeks' time? Harry's sixth year at Hogwarts has already got off to an unusual start, as the worlds of Muggle and magic start to intertwine...\n...more", "genre": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Childrens", "Adventure", "Audiobook", "Childrens", "Middle Grade", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.58", "pages": "652"}, {"id": 3, "title": "Harry Potter and the Sorcerer's Stone", "blurb": "Harry Potter has no idea how famous he is. That's because he's being raised by his miserable aunt and uncle who are terrified Harry will learn that he's really a wizard, just as his parents were. But everything changes when Harry is summoned to attend an infamous school for wizards, and he begins to discover some clues about his illustrious birthright. From the surprising way he is greeted by a lovable giant, to the unique curriculum and colorful faculty at his unusual school, Harry finds himself drawn deep inside a mystical world he never knew existed and closer to his own noble destiny.", "genre": ["Fantasy", "Fiction", "Young Adult", "Magic", "Childrens", "Middle Grade", "Classics"], "author": "J.K. Rowling", "rating": "4.47", "pages": "309"}, {"id": 5, "title": "Harry Potter and the Prisoner of Azkaban", "blurb": "Harry Potter, along with his best friends, Ron and Hermione, is about to start his third year at Hogwarts School of Witchcraft and Wizardry. Harry can't wait to get back to school after the summer holidays. (Who wouldn't if they lived with the horrible Dursleys?) But when Harry gets to Hogwarts, the atmosphere is tense. There's an escaped mass murderer on the loose, and th\nHarry Potter, along with his best friends, Ron and Hermione, is about to start his third year at Hogwarts School of Witchcraft and Wizardry. Harry can't wait to get back to school after the summer holidays. (Who wouldn't if they lived with the horrible Dursleys?) But when Harry gets to Hogwarts, the atmosphere is tense. There's an escaped mass murderer on the loose, and the sinister prison guards of Azkaban have been called in to guard the school...\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Magic", "Childrens", "Childrens", "Middle Grade", "Adventure", "Audiobook", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.58", "pages": "435"}, {"id": 6, "title": "Harry Potter and the Goblet of Fire", "blurb": "It is the summer holidays and soon Harry Potter will be starting his fourth year at Hogwarts School of Witchcraft and Wizardry. Harry is counting the days: there are new spells to be learnt, more Quidditch to be played, and Hogwarts castle to continue exploring. But Harry needs to be careful - there are unexpected dangers lurking...", "genre": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Childrens", "Childrens", "Middle Grade", "Adventure", "Audiobook", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.57", "pages": "734"}, {"id": 7, "title": "The Harry Potter Collection", "blurb": "Six years of magic, adventure, and mystery make this paperback collection the perfect gift for Harry Potter fans of all ages.Follow Harry from his first days at Hogwarts School for Witchcraft and Wizardry, through his many adventures with Hermione and Ron, to his confrontations with rival Draco Malfoy and the dreaded Professor Snape. From a dangerous descent into the Chamb\nSix years of magic, adventure, and mystery make this paperback collection the perfect gift for Harry Potter fans of all ages.Follow Harry from his first days at Hogwarts School for Witchcraft and Wizardry, through his many adventures with Hermione and Ron, to his confrontations with rival Draco Malfoy and the dreaded Professor Snape. From a dangerous descent into the Chamber of Secrets to the Triwizard Tournament to the return of He-Who-Must-Not-Be-Named, each adventure is more riveting and exhilarating than its predecessor, and now all six books are available together for the first time in a\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Magic", "Childrens", "Adventure", "Classics", "Science Fiction Fantasy", "Novels", "Paranormal", "Wizards"], "author": "J.K. Rowling", "rating": "4.72", "pages": null}, {"id": 8, "title": "Harry Potter Boxed Set, Books 1-5 (Harry Potter, #1-5)", "blurb": "Box Set containing Harry Potter and the Sorcerer's Stone, Harry Potter and the Chamber Of Secrets, Harry Potter and the Prisoner of Azkaban, Harry Potter and the Goblet Of Fire, and Harry Potter and the Order of the Phoenix!\nBox Set containing Harry Potter and the Sorcerer's Stone, Harry Potter and the Chamber Of Secrets, Harry Potter and the Prisoner of Azkaban, Harry Potter and the Goblet Of Fire, and Harry Potter and the Order of the Phoenix!\n...more", "genre": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Adventure", "Fantasy", "Supernatural", "Mystery", "Childrens", "Childrens", "Middle Grade", "Fantasy", "Paranormal"], "author": "J.K. Rowling", "rating": "4.75", "pages": "2690"}, {"id": 9, "title": "Unauthorized Harry Potter Book Seven News: \"Half-Blood Prince\" Analysis and Speculation", "blurb": "Through the magic of print-on-demand technology, this nimble guide to the work of best-selling author J. K. Rowling provides the latest news about the author and her works, updated whenever there are significant developments. Unlike a conventional book, for which editions are printed in quantity every couple of years, this living book goes through frequent mini-editio\nThrough the magic of print-on-demand technology, this nimble guide to the work of best-selling author J. K. Rowling provides the latest news about the author and her works, updated whenever there are significant developments. Unlike a conventional book, for which editions are printed in quantity every couple of years, this living book goes through frequent mini-editions and is printed fresh whenever customers place an order. Purchasers are entitled to free PDF updates! An entirely new section of analysis with more than 75 new pages will be added shortly after the release of Harry Potter and the Half-Blood Prince on July 16, 2005.\n...more", "genre": [], "author": "W. Frederick Zimmerman", "rating": "3.81", "pages": "152"}, {"id": 10, "title": "Harry Potter Collection", "blurb": "Six years of magic, adventure, and mystery make this luxurious boxed set the perfect gift for Harry Potter fans of all ages. Follow Harry from his first days at Hogwarts School for Witchcraft and Wizardry, through his many adventures with Hermione and Ron, to his confrontations with rival Draco Malfoy and the dreaded Professor Snape. From the thrilling search for the Sorce\nSix years of magic, adventure, and mystery make this luxurious boxed set the perfect gift for Harry Potter fans of all ages. Follow Harry from his first days at Hogwarts School for Witchcraft and Wizardry, through his many adventures with Hermione and Ron, to his confrontations with rival Draco Malfoy and the dreaded Professor Snape. From the thrilling search for the Sorcerer's Stone to the Triwizard Tournament to the return of He-Who-Must-Not-Be-Named, each adventure is more riveting and exhilarating than its predecessor, and now all six books are available together for the first time in an elegant hardcover boxed set.\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Magic", "Childrens", "Adventure", "Classics", "Science Fiction Fantasy", "Novels", "Paranormal", "Wizards"], "author": "J.K. Rowling", "rating": "4.72", "pages": "3342"}, {"id": 32, "title": "The Lord of the Rings", "blurb": "Classics in the genre, J.R.R. Tolkien's definitive three-book epic, the Lord of the Rings (encompassing The Fellowship of the Ring, The Two Towers, and The Return of the King), and its charming precursor, The Hobbit. That many (if not most) fantasy works are in some way derivative of Tolkien is understood, but the influence of the Lord of the Rings is so universal that eve\nClassics in the genre, J.R.R. Tolkien's definitive three-book epic, the Lord of the Rings (encompassing The Fellowship of the Ring, The Two Towers, and The Return of the King), and its charming precursor, The Hobbit. That many (if not most) fantasy works are in some way derivative of Tolkien is understood, but the influence of the Lord of the Rings is so universal that everybody from George Lucas to Led Zeppelin has appropriated it for one purpose or another. Not just revolutionary because it was groundbreaking, the Lord of the Rings is timeless because it's the product of a truly top-shelf mind. Tolkien was a distinguished linguist and Oxford scholar of dead languages, with strong ideas about the importance of myth and story and a deep appreciation of nature. His epic, 10 years in the making, recounts the Great War of the Ring and the closing of Middle-Earth's Third Age, a time when magic begins to fade from the world and men rise to dominance. Tolkien carefully details this transition with tremendous skill and love, creating in the Lord of the Rings a universal and all-embracing tale, a justly celebrated classic. --Paul Hughes\n...more", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Literature", "Novels", "Young Adult"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1137"}, {"id": 35, "title": "The Lord of the Rings", "blurb": "Celebrated Tolkien illustrator Alan Lee, a conceptual designer for the blockbuster films based on The Lord of the Rings, contributes 50 beautiful full-page, full-color paintings to this elegant three-volume edition.One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted b\nCelebrated Tolkien illustrator Alan Lee, a conceptual designer for the blockbuster films based on The Lord of the Rings, contributes 50 beautiful full-page, full-color paintings to this elegant three-volume edition.One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell, by chance, into the hands of the hobbit, Bilbo Baggins. From his fastness in the Dark Tower of Mordor, Sauron's power spread far and wide. He gathered all the Great Rings to him, but ever he searched far and wide for the One Ring that would complete his dominion. On his eleventy-first birthday Bilbo disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest -- to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom. The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard, Merry, Pippin, and Sam, Gimli the Dwarf, Legolas the Elf, Boromir of Gondor, and a tall, mysterious stranger called Strider. Saga of a group heroes who set forth to save their world from evil. A brotherhood of hobbits, elves, dwarves, and people is formed to combat evil forces. Tolkien drew on his extensive knowledge of folklore and the classics to create the worlds and creatures described in the trilogy, which includes The Fellowship of the Ring, The Two Towers, and The Return of the King.\n...more", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Literature", "Novels", "Young Adult"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1216"}, {"id": 27, "title": "Neither Here nor There: Travels in Europe", "blurb": "Bill Bryson's first travel book, The Lost Continent, was unanimously acclaimed as one of the funniest books in years. In Neither Here nor There he brings his unique brand of humour to bear on Europe as he shoulders his backpack, keeps a tight hold on his wallet, and journeys from Hammerfest, the northernmost town on the continent, to Istanbul on the cusp of Asia. Fluent in, oh, at least one language, he retraces his travels as a student twenty years before.Whether braving the homicidal motorist of Paris, being robbed by gypsies in Florence, attempting not to order tripe and eyeballs in a German restaurant, window-shopping in the sex shops of the Reeperbahn or disputing his hotel bill in Copenhagen, Bryson takes in the sights, dissects the culture and illuminates each place and person with his hilariously caustic observations. He even goes to Liechtenstein.", "genre": ["Travel", "Nonfiction", "Humor", "Memoir", "Biography", "Audiobook", "Travelogue"], "author": "Bill Bryson", "rating": "3.85", "pages": "254"}, {"id": 29, "title": "The Mother Tongue: English and How It Got That Way", "blurb": "Only Bill Bryson could make a book about the English language so entertaining. With his boundless enthusiasm and restless eye for the absurd, this is his astonishing tour of English.From its mongrel origins to its status as the world's most-spoken tongue; its apparent simplicity to its deceptive complexity; its vibrant swearing to its uncertain spelling and pronunciation; Bryson covers all this as well as the many curious eccentricities that make it as maddening to learn as it is flexible to use.Bill Bryson's classic Mother Tongue is a highly readable and hilarious tale of how English came to be the world's language.", "genre": ["Nonfiction", "History", "Language", "Linguistics", "Humor", "Audiobook", "Writing"], "author": "Bill Bryson", "rating": "3.91", "pages": "270"}, {"id": 31, "title": "The Lord of the Rings", "blurb": "The Fellowship of the Ring, part one of J.R.R. Tolkien’s epic masterpiece, first reached these shores on October 21, 1954, arriving, as C. S. Lewis proclaimed, “like lightning from a clear sky.” Fifty years and nearly one hundred million American readers later comes a beautiful new one-volume collector’s edition befitting the stature of this crown jewel of our list. With a text fully corrected under the supervision of Christopher Tolkien to meet the author’s exacting wishes, two large-format fold-out maps, a ribbon placemarker, gilded page edges, a color insert depicting Tolkien's own paintings of the Book of Mazarbul and exceptionally elegant and sturdy overall packaging housed within an attractive slipcase, this edition is the finest we’ve ever produced.", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Epic Fantasy", "High Fantasy"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1184"}, {"id": 39, "title": "The Lord of the Rings", "blurb": "Widely regarded as a broadcasting classic, the 1981 BBC Radio dramatisation of The Lord of the Rings stars Ian Holm, Michael Hordern, Robert Stephens, John Le Mesurier and Peter Woodthorpe. This box set contains all three parts of the epic tale - The Fellowship of the Ring, The Two Towers and The Return of the King. Sauron, the Dark Lord, has gathered to him the Rings of P\nWidely regarded as a broadcasting classic, the 1981 BBC Radio dramatisation of The Lord of the Rings stars Ian Holm, Michael Hordern, Robert Stephens, John Le Mesurier and Peter Woodthorpe. This box set contains all three parts of the epic tale - The Fellowship of the Ring, The Two Towers and The Return of the King. Sauron, the Dark Lord, has gathered to him the Rings of Power - the means by which he will be able to rule the world. All he lacks in his plan for domination is the Ruling Ring, which has fallen into the hands of the hobbit, Frodo Baggins... Brian Sibley, one of the original dramatists, has written new opening and closing narration for the character of Frodo, played by Ian Holm. This collection also includes a bonus CD featuring Stephen Oliver's complete musical score, and a demo version of 'Bilbo's Last Song'.13 CDs. 13 hrs 15 mins.\n...more", "genre": ["Fantasy", "Fiction", "Audiobook", "Classics", "Adventure", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Science Fiction Fantasy", "Adult", "Science Fiction"], "author": "Brian Sibley", "rating": "4.75", "pages": null}, {"id": 2, "title": "Harry Potter and the Order of the Phoenix", "blurb": "Harry Potter is about to start his fifth year at Hogwarts School of Witchcraft and Wizardry. Unlike most schoolboys, Harry never enjoys his summer holidays, but this summer is even worse than usual. The Dursleys, of course, are making his life a misery, but even his best friends, Ron and Hermione, seem to be neglecting him.Harry has had enough. He is beginning to think he \nHarry Potter is about to start his fifth year at Hogwarts School of Witchcraft and Wizardry. Unlike most schoolboys, Harry never enjoys his summer holidays, but this summer is even worse than usual. The Dursleys, of course, are making his life a misery, but even his best friends, Ron and Hermione, seem to be neglecting him.Harry has had enough. He is beginning to think he must do something, anything, to change his situation, when the summer holidays come to an end in a very dramatic fashion. What Harry is about to discover in his new year at Hogwarts will turn his world upside down...\n...more", "genre": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Childrens", "Adventure", "Audiobook", "Childrens", "Middle Grade", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.50", "pages": "912"}, {"id": 18, "title": "The Ultimate Hitchhiker's Guide", "blurb": "The Hitchhiker's Guide to the GalaxySeconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time and space.The Restaurant at the End of the UniverseFacing annihilation at the hands of warmongers is a curious time to crave tea. It could only happen to the cosmically displaced Arthur Dent and his comrades as they hurtle across the galaxy in a desperate search for a place to eat.Life, the Universe and EverythingThe unhappy inhabitants of planet Krikkit are sick of looking at the night sky- so they plan to destroy it. The universe, that is. Now only five individuals can avert Armageddon: mild-mannered Arthur Dent and his stalwart crew.So Long, and Thanks for All the FishBack on Earth, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription conspires to thrust him back to reality. So to speak.Mostly HarmlessJust when Arthur Dent makes the terrible mistake of starting to enjoy life, all hell breaks loose. Can he save the Earth from total obliteration? Can he save the Guide from a hostile alien takeover? Can he save his daughter from herself?Also includes the short story Young Zaphod Plays It Safe.", "genre": ["Science Fiction", "Fiction", "Humor", "Fantasy", "Classics", "Comedy", "Science Fiction Fantasy"], "author": "Douglas Adams", "rating": "4.38", "pages": "815"}, {"id": 33, "title": "The Lord of the Rings", "blurb": "One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind themIn ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, i\nOne Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind themIn ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins.From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings to him, but always he searched for the One Ring that would complete his dominion.When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom.The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider.\n...more", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Literature", "Novels", "Young Adult"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1216"}, {"id": 49, "title": "Bucaneer", "blurb": "A tale of the Caribbean when privateers tapped into Spain's Mother Lode of gold and silver they were ripping from the New World. Buccaneers boarded these treasure ships and transferred the contents into their own vessels. High excitement when a bunch of pig roasters turned into robbers of the sea. High romance and brutal sea battles await the reader of this fiction drawn f\nA tale of the Caribbean when privateers tapped into Spain's Mother Lode of gold and silver they were ripping from the New World. Buccaneers boarded these treasure ships and transferred the contents into their own vessels. High excitement when a bunch of pig roasters turned into robbers of the sea. High romance and brutal sea battles await the reader of this fiction drawn from history.\n...more", "genre": [], "author": "Luther Butler", "rating": "3.57", "pages": "208"}, {"id": 4, "title": "Harry Potter and the Chamber of Secrets", "blurb": "The Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.And strike it does. For in Harry's second year at Ho\nThe Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.And strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor, Gilderoy Lockhart, a spirit named Moaning Myrtle who haunts the girls' bathroom, and the unwanted attentions of Ron Weasley's younger sister, Ginny. But each of these seem minor annoyances when the real trouble begins, and someone, or something, starts turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects: Harry Potter himself?\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Magic", "Childrens", "Childrens", "Middle Grade", "Audiobook", "Adventure", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.43", "pages": "352"}, {"id": 12, "title": "The Ultimate Hitchhiker's Guide: Five Complete Novels and One Story", "blurb": "At last in paperback in one complete volume, here are the five novels from Douglas Adams's Hitchhiker series. The Hitchhiker's Guide to the GalaxySeconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time an\nAt last in paperback in one complete volume, here are the five novels from Douglas Adams's Hitchhiker series. The Hitchhiker's Guide to the GalaxySeconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time and space.The Restaurant at the End of the UniverseFacing annihilation at the hands of warmongers is a curious time to crave tea. It could only happen to the cosmically displaced Arthur Dent and his comrades as they hurtle across the galaxy in a desperate search for a place to eat.Life, the Universe and EverythingThe unhappy inhabitants of planet Krikkit are sick of looking at the night sky- so they plan to destroy it. The universe, that is. Now only five individuals can avert Armageddon: mild-mannered Arthur Dent and his stalwart crew.So Long, and Thanks for All the FishBack on Earth, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription conspires to thrust him back to reality. So to speak.Mostly HarmlessJust when Arthur Dent makes the terrible mistake of starting to enjoy life, all hell breaks loose. Can he save the Earth from total obliteration? Can he save the Guide from a hostile alien takeover? Can he save his daughter from herself?Also includes the short story Young Zaphod Plays It Safe.\n...more", "genre": ["Science Fiction", "Fiction", "Humor", "Fantasy", "Classics", "Humor", "Comedy", "Science Fiction Fantasy", "Adventure", "Novels", "Space"], "author": "Douglas Adams", "rating": "4.38", "pages": "815"}, {"id": 17, "title": "The Hitchhiker's Guide to the Galaxy: Quandary Phase", "blurb": "Many are familiar with Douglas Adams's classic Hitchhiker's Guide to the Galaxy series, but few know that these books started out as a multi-part series performed on BBC radio. This installment, part four, is a robust radio dramatization of So Long and Thanks for All the Fish. The Earth has miraculously reappeared and Arthur Dent is in love with the otherworldly Fenchurch,\nMany are familiar with Douglas Adams's classic Hitchhiker's Guide to the Galaxy series, but few know that these books started out as a multi-part series performed on BBC radio. This installment, part four, is a robust radio dramatization of So Long and Thanks for All the Fish. The Earth has miraculously reappeared and Arthur Dent is in love with the otherworldly Fenchurch, but Ford Prefect has an idea that might burst Arthur’s happy little bubble. What is really going on with Arthur’s dream girl, where have all the dolphins gone, and what was their departing message to mankind?\n...more", "genre": ["Science Fiction", "Audiobook", "Humor", "Fiction", "Humor", "Comedy", "Science Fiction Fantasy", "Fantasy", "Classics", "Space", "Adult"], "author": "Douglas Adams", "rating": "4.33", "pages": null}, {"id": 36, "title": "The Lord of the Rings: Weapons and Warfare", "blurb": "Lavishly illustrated with 1,000 photos, paintings, maps, sculptures and sketches, most appearing here for the first time, Weapons and Warfare is an indispensable chronicle of The Lord of the Rings' many creatures, warriors, armies and battlegrounds. From the graceful and proficient Elves to the horrendous war machines of the Dark Lord, each culture's approach to warfare is explained - how they fought, why they were fighting, what armor they wore and what weapons they used against their enemies. Now you can get as close to a marauding Orc as you could ever wish, without suffering the consequences!Treating the filmmakers' notes, designs and props as a true archive, Weapons and Warfare describes in detail every major conflict depicted in the film trilogy - from The Last Alliance of Elves and Men to the climactic Battle of the Pelennor Fields - each accompanied by a battle diagram from the films' chief designers.Armed with a wealth of fascinating facts and unique imagery, and with an exclusive foreword by Christopher Lee and an introduction by the Academy Award winner Richard Taylor, Weapons and Warfare promises to be the most striking companion to The Lord of the Rings movie trilogy published to date.", "genre": ["Fantasy", "Art", "Fiction", "Reference", "Media Tie In", "Film", "Classics"], "author": "Chris   Smith", "rating": "4.59", "pages": "218"}, {"id": 45, "title": "Agile Web Development with Rails: A Pragmatic Guide", "blurb": "Rails is a full-stack, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use ActiveRecord to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the Action Pack framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's DRY Principle by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work ontime for a change). Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.", "genre": ["Programming", "Nonfiction", "Technology", "Technical", "Reference", "Computers", "Software"], "author": "Dave Thomas", "rating": "3.84", "pages": "558"}, {"id": 15, "title": "The Hitchhiker's Guide to Lean: Lessons from the Road", "blurb": "Embarking on a lean journey is similar to hitchhiking -- there are many roads on which to wander and no single one is right for all. This book reveals the most critical lessons learned over the authors' combined 30-plus years of exploring lean highways and shares stories based on real-world applications. The authors focus on areas where most lean efforts fail to illustrate steps to take to reenergize, accelerate and sustain a lean transformation. The book's ten chapters cover lean principles and thinking, lean leadership moves, the roadmap for lean transformation, common pitfalls of lean journeys, building an operating system, lean accounting, lean material management, lean in service organizations, and how individuals can apply lean to improve themselves. The book concludes with interviews of lean practitioners on the front lines of change at Chrysler, Ross Controls, DTE Energy. RSR Corporation, and Nemak.", "genre": ["Business"], "author": "Jamie Flinchbaugh", "rating": "3.75", "pages": "196"}, {"id": 16, "title": "The Hitchhiker's Guide to the Galaxy", "blurb": "Don't leave Earth without this hilarious international bestseller about the end of the world and the happy-go-lucky days that follow. Join the gruesome two-some of Arthur Dent and his friend, Ford Prefect, in their now-famous intergalactic journey through time and space.", "genre": ["Science Fiction", "Fiction", "Humor", "Classics", "Fantasy", "Comedy", "Science Fiction Fantasy"], "author": "Douglas Adams", "rating": "4.23", "pages": "6"}, {"id": 38, "title": "The Lord of the Rings Box Set", "blurb": "A three-volume boxed set edition of J. R. R. Tolkien's epic The Lord of the Rings, featuring film act on the cover. The set includes The Fellowship of the Ring, The Two Towers, and The Return of the King.In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth still it remained lost to him. After many ages it fell, by chance, into the hands of the hobbit, Bilbo Baggins.From his fastness in the Dark Tower of Mordor, Sauron's power spread far and wide. He gathered all the Great Rings to him, but ever he searched far and wide for the One Ring that would complete his dominion.On his eleventy-first birthday, Bilbo disappeared bequeathing to his young cousin, Frodo, the Ruling Ring, and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord and destroy the Ring by casting it into the Cracks of Doom.The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the wizard, Merry, Pippin and Sam, Gimli the Dwarf, Legolas the Elf, Boromir of Gondor, and a tall, mysterious stranger called Strider.Saga of a group heroes who set forth to save their world from evil. A brotherhood of 'hobbits,' elves, dwarves, and people is formed to combat evil forces. Tolkien drew on his extensive knowledge of folklore and the classics to create the worlds and creatures described in the trilogy, which includes The Fellowship of the Ring, The Two Towers, and The Return of the King.", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Epic Fantasy", "High Fantasy"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1223"}, {"id": 67, "title": "The Known World", "blurb": "One of the most acclaimed novels in recent memory, The Known World is a daring and ambitious work by Pulitzer Prize winner Edward P. Jones.The Known World tells the story of Henry Townsend, a black farmer and former slave who falls under the tutelage of William Robbins, the most powerful man in Manchester County, Virginia. Making certain he never circumvents the law, Towns\nOne of the most acclaimed novels in recent memory, The Known World is a daring and ambitious work by Pulitzer Prize winner Edward P. Jones.The Known World tells the story of Henry Townsend, a black farmer and former slave who falls under the tutelage of William Robbins, the most powerful man in Manchester County, Virginia. Making certain he never circumvents the law, Townsend runs his affairs with unusual discipline. But when death takes him unexpectedly, his widow, Caldonia, can't uphold the estate's order, and chaos ensues. Jones has woven a footnote of history into an epic that takes an unflinching look at slavery in all its moral complexities.\n...more", "genre": ["Historical", "Historical Fiction", "Fiction", "Cultural", "African American", "Historical", "Literature", "Novels", "Literary Fiction", "Book Club", "Race", "Literature", "American"], "author": "Edward P. Jones", "rating": "3.82", "pages": "388"}, {"id": 81, "title": "Giving Good Weight", "blurb": "You people come into the market—the Greenmarket, in the open air under the down pouring sun—and you slit the tomatoes with your fingernails. With your thumbs, you excavate the cheese. You choose your stringbeans one at a time. You pulp the nectarines and rape the sweet corn. You are something wonderful, you are—people of the city—and we, who are almost without exception s\nYou people come into the market—the Greenmarket, in the open air under the down pouring sun—and you slit the tomatoes with your fingernails. With your thumbs, you excavate the cheese. You choose your stringbeans one at a time. You pulp the nectarines and rape the sweet corn. You are something wonderful, you are—people of the city—and we, who are almost without exception strangers here, are as absorbed with you as you seem to be with the numbers on our hanging scales. So opens the title piece in this collection of John McPhee's classic essays, grouped here with four others, including Brigade de Cuisine, a profile of an artistic and extraordinary chef; The Keel of Lake Dickey, in which a journey down the whitewater of a wild river ends in the shadow of a huge projected dam; a report on plans for the construction of nuclear power plants that would float in the ocean; and a pinball shoot-out between two prizewinning journalists.\n...more", "genre": ["Nonfiction", "Writing", "Essays", "Language", "Writing", "Writing", "Journalism", "Food and Drink", "History", "Food and Drink", "Food", "Short Stories"], "author": "John McPhee", "rating": "4.25", "pages": "288"}, {"id": 104, "title": "Dune", "blurb": "Here is the novel that will be forever considered a triumph of the imagination. Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, who would become the mysterious man known as Muad'Dib. He would avenge the traitorous plot against his noble family—and would bring to fruition humankind's most ancient and unattainable dream. A stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.", "genre": ["Science Fiction", "Fiction", "Fantasy", "Classics", "Science Fiction Fantasy", "Audiobook", "Space Opera"], "author": "Frank Herbert", "rating": "4.25", "pages": "528"}, {"id": 113, "title": "Dune", "blurb": "Here is the novel that will be forever considered Frank Herbert's triumph of the imagination.Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the “spice” melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for....When House Atreides is betrayed, the destruction of Paul’s family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad’Dib, he will bring to fruition humankind’s most ancient and unattainable dream. A stunning blend of adventure and mysticism, environmentalism and politics, Dune won the first Nebula Award, shared the Hugo Award, and formed the basis of what is undoubtedly the grandest epic in science fiction.", "genre": ["Science Fiction", "Fiction", "Fantasy", "Classics", "Science Fiction Fantasy", "Audiobook", "Space Opera"], "author": "Frank Herbert", "rating": "4.25", "pages": "Audio"}, {"id": 141, "title": "Ruby Cookbook", "blurb": "Do you want to push Ruby to its limits? The Ruby Cookbook is the most comprehensive problem-solving guide to today's hottest programming language. It gives you hundreds of solutions to real-world problems, with clear explanations and thousands of lines of code you can use in your own projects.From data structures and algorithms, to integration with cutting-edge technologies, the Ruby Cookbook has something for every programmer. Beginners and advanced Rubyists alike will learn how to program with:Strings and numbersArrays and hashesClasses, modules, and namespacesReflection and metaprogrammingXML and HTML processingRuby on Rails (including Ajax integration)DatabasesGraphicsInternet services like email, SSH, and BitTorrentWeb servicesMultitaskingGraphical and terminal interfacesIf you need to write a web application, this book shows you how to get started with Rails. If you're a system administrator who needs to rename thousands of files, you'll see how to use Ruby for this and other everyday tasks. You'll learn how to read and write Excel spreadsheets, classify text with Bayesian filters, and create PDF files. We've even included a few silly tricks that were too cool to leave out, like how to blink the lights on your keyboard.The Ruby Cookbook is the most useful book yet written about Ruby. When you need to solve a problem, don't reinvent the wheel: look it up in the Cookbook.", "genre": ["Programming", "Computers", "Coding", "Software", "Technology", "Nonfiction", "Reference"], "author": "Lucas Carlson", "rating": "3.87", "pages": "910"}, {"id": 145, "title": "Ruby Cookbook", "blurb": "", "genre": [], "author": "Colin Steele", "rating": "4.60", "pages": "Paperback"}, {"id": 182, "title": "Literature Circle Guide: A Wrinkle in Time", "blurb": "This one-of-a-kind guide to running literature circles, based on Madeline L’Engle’s A Wrinkle in Time, shows teachers how to organize small discussion groups that work! Includes stimulating questions and writing prompts that motivate students to think and respond thoughtfully. As students dive into lively discussions, they learn to identify themes, analyze vocabulary, recognize the author’s craft, and respond meaningfully to the text—all of which meet state and national language arts standards. For use with Grades 4-8.", "genre": [], "author": "Tara MacCarthy", "rating": "3.60", "pages": "32"}, {"id": 199, "title": "Pasta, Poppy Fields and Pearls", "blurb": "Four mature women from different parts of the world have chosen Tuscany as their retirement haven, expecting a quiet and tranquil existence. Little did they realize the adventures that awaited them. As their lively friendship develops, the best and the worst of each woman's past experiences and memories begin to emerge and just when you think you know what's next, a comple\nFour mature women from different parts of the world have chosen Tuscany as their retirement haven, expecting a quiet and tranquil existence. Little did they realize the adventures that awaited them. As their lively friendship develops, the best and the worst of each woman's past experiences and memories begin to emerge and just when you think you know what's next, a completely unexpected twist in the story will keep you turning the pages way past your bedtime. You'll laugh and you'll cry with Carmela, Janet, Cecilia and Paula Jean. You'll walk through the streets of Florence with them and you'll swear you can smell the aroma of Italian cappuccinos. You'll partake of their struggles and celebrate their joys and when you reach the final page, you'll feel as if they could easily be your next door neighbors, your best friends. This is a real life book, based on real life women, who embrace each day with gusto, live their senior life to the maximum and invite you to do the same.\n...more", "genre": [], "author": "Sophia Bar-Lev", "rating": "3.50", "pages": "184"}, {"id": 232, "title": "I am Charlotte Simmons", "blurb": "Dupont University--the Olympian halls of learning housing the cream of America's youth, the roseate Gothic spires and manicured lawns suffused with tradition... Or so it appears to beautiful, brilliant Charlotte Simmons, a sheltered freshman from North Carolina. But Charlotte soon learns, to her mounting dismay, that for the uppercrust coeds of Dupont, sex, Cool, and kegs \nDupont University--the Olympian halls of learning housing the cream of America's youth, the roseate Gothic spires and manicured lawns suffused with tradition... Or so it appears to beautiful, brilliant Charlotte Simmons, a sheltered freshman from North Carolina. But Charlotte soon learns, to her mounting dismay, that for the uppercrust coeds of Dupont, sex, Cool, and kegs trump academic achievement every time.As Charlotte encounters Dupont's privileged elite--her roommate, Beverly, a Groton-educated Brahmin in lusty pursuit of lacrosse players; Jojo Johanssen, the only white starting player on Dupont's godlike basketball team, whose position is threatened by a hotshot black freshman from the projects; the Young Turk of Saint Ray fraternity, Hoyt Thorpe, whose heady sense of entitlement and social domination is clinched by his accidental brawl with a bodyguard for the governor of California; and Adam Geller, one of the Millennial Mutants who run the university's independent newspaper and who consider themselves the last bastion of intellectual endeavor on the sex-crazed, jock-obsessed campus--she gains a new, revelatory sense of her own power, that of her difference and of her very innocence, but little does she realize that she will act as a catalyst in all of their lives.\n...more", "genre": ["Fiction", "Contemporary", "Novels", "Academic", "College", "Literary Fiction", "Young Adult", "Coming Of Age", "Literature", "Literature", "American", "Audiobook", "Young Adult"], "author": "Tom Wolfe", "rating": "3.44", "pages": null}, {"id": 250, "title": "Tropic of Capricorn", "blurb": "Banned in America for almost thirty years because of its explicit sexual content, this companion volume to Miller's Tropic of Cancer chronicles his life in 1920s New York City. Famous for its frank portrayal of life in Brooklyn's ethnic neighborhoods, and Miller's outrageous sexual exploits, Tropic of Capricorn is now considered a cornerstone of modern literature. \nBanned in America for almost thirty years because of its explicit sexual content, this companion volume to Miller's Tropic of Cancer chronicles his life in 1920s New York City. Famous for its frank portrayal of life in Brooklyn's ethnic neighborhoods, and Miller's outrageous sexual exploits, Tropic of Capricorn is now considered a cornerstone of modern literature. \n...more", "genre": ["Fiction", "Classics", "Literature", "Novels", "Literature", "American", "Adult Fiction", "Erotica", "The United States Of America", "Literary Fiction", "Sexuality", "Literature", "Banned Books"], "author": "Henry Miller", "rating": "3.81", "pages": "348"}, {"id": 257, "title": "Haunted Places in America: A Guide to Spooked and Spooky Public Places in the United States", "blurb": "We're all familiar with the American spirit. But what about America's spirits? Here is an entertaining and informative guide to haunted places throughout the fifty states.\nWe're all familiar with the American spirit. But what about America's spirits? Here is an entertaining and informative guide to haunted places throughout the fifty states.\n...more", "genre": ["Horror", "Ghost Stories"], "author": "Charles A. Coulombe", "rating": "3.52", "pages": "288"}, {"id": 274, "title": "The Portrait of a Lady", "blurb": "Newly arrived in Europe, Isabel is an independent woman searching for her destiny. Two eligible suitors approach her and are refused. She then becomes utterly captivated by the languid charms of Gilbert Osmond, who thinks only of her money. Through him, she faces a tragic choice.", "genre": ["Classics", "Fiction", "Literature", "Literature", "19th Century", "Novels", "Historical", "Historical Fiction", "Romance", "Literature", "American", "Classics", "Classic Literature", "Historical", "Victorian"], "author": "Henry James", "rating": "3.78", "pages": null}, {"id": 277, "title": "Writing", "blurb": "Written in the splendid bareness of her late style, these pages are Marguerite Duras's theory of literature: comparing a dying fly to the work of style; remembering the trance and incurable disarray of writing; recreating the last moments of a British pilot shot during World War II and buried next to her house; or else letting out a magisterial, so what? To question six de\nWritten in the splendid bareness of her late style, these pages are Marguerite Duras's theory of literature: comparing a dying fly to the work of style; remembering the trance and incurable disarray of writing; recreating the last moments of a British pilot shot during World War II and buried next to her house; or else letting out a magisterial, so what? To question six decades of storytelling, all the essays together operate as a deceitful, yet indispensable confession.\n...more", "genre": ["Nonfiction", "Language", "Writing", "Cultural", "France", "Writing", "Essays", "Literature", "Short Stories", "Biography", "European Literature", "French Literature", "Womens", "Academic", "School"], "author": "Marguerite Duras", "rating": "3.70", "pages": "91"}, {"id": 281, "title": "Destroy, She Said", "blurb": "In this classic novel by the best-selling author of The Lover, erotic intrigue masks a chillingly deceptive form of madness. Elisabeth Alione is convalescing in a hotel in rural France when she meets two men and another woman. The sophisticated dalliance among the four serves to obscure an underlying violence, which, when the curtain of civilization is drawn aside, reveals\nIn this classic novel by the best-selling author of The Lover, erotic intrigue masks a chillingly deceptive form of madness. Elisabeth Alione is convalescing in a hotel in rural France when she meets two men and another woman. The sophisticated dalliance among the four serves to obscure an underlying violence, which, when the curtain of civilization is drawn aside, reveals in her fellow guests a very contemporary, perhaps even new, form of insanity. Like many of Duras's novels, Destroy, She Said owes much to cinema, displaying a skillful interplay of dialogue and description. There are recurring moods and motifs from the Duras repertoire: eroticism, lassitude, stifled desire, a beautiful woman, a mysterious forest, a desolate provincial hotel. Included in this volume is an in-depth interview with Marguerite Duras by Jacques Rivette and Jean Narboni.\n...more", "genre": ["Fiction", "Cultural", "France", "Classics", "Plays", "Novels", "Literature", "Literature", "20th Century", "European Literature", "French Literature", "Female Authors", "Womens"], "author": "Marguerite Duras", "rating": "3.61", "pages": "133"}, {"id": 282, "title": "L'Amour", "blurb": "L'amour est enfant de bohème... La poésie et la musique lui vont comme un gant : Nouveau, Marbeuf, Labbé, Ronsard, Verlaine, Aragon. Chopin, Franck, Mahler, Schubert, Brahms, Mozart. Ou comment parler d'amour.\nL'amour est enfant de bohème... La poésie et la musique lui vont comme un gant : Nouveau, Marbeuf, Labbé, Ronsard, Verlaine, Aragon. Chopin, Franck, Mahler, Schubert, Brahms, Mozart. Ou comment parler d'amour.\n...more", "genre": ["Fiction", "Cultural", "France", "European Literature", "French Literature", "Classics", "Literature", "Novels", "Womens", "Contemporary", "Literary Fiction", "Novella"], "author": "Marguerite Duras", "rating": "3.26", "pages": "217"}, {"id": 315, "title": "Camp Cooking: 100 Years The National Museum of Forest Service History", "blurb": "The National Museum of Forest Service History presents a charming cookbook that celebrates decades of camp cooking by countless Forest Service agents in the field.", "genre": ["Food and Drink", "Cooking", "Food and Drink", "Cookbooks"], "author": "National Museum of Forest Service History", "rating": "4.36", "pages": "192"}, {"id": 332, "title": "The Wedding Clause", "blurb": "A GAME OF CHANCEMolly Conwell's life has been quite unremarkable-until she learns the startling details of her late employer Lady Woodhart's will: The sum of 30,000 pounds will be divided equally between the deceased's grandson, Viscount Hart Woodhart, and Molly if they wed. If one or the other fails to appear, then the present party receives the entire fortune. Molly ha\nA GAME OF CHANCEMolly Conwell's life has been quite unremarkable-until she learns the startling details of her late employer Lady Woodhart's will: The sum of 30,000 pounds will be divided equally between the deceased's grandson, Viscount Hart Woodhart, and Molly if they wed. If one or the other fails to appear, then the present party receives the entire fortune. Molly has no intention to wed Hart, but if she inherits the money she could help her brother regain his proper place in Society. Besides, she's convinced that her prospective groom, who has always accused her of being a fortune hunter, will not present himself. As Molly embarks on a daring charade, she discovers a fierce opponent in Hart -and an even fiercer desire for this dangerously handsome man who may prove impossible to resist...\n...more", "genre": ["Romance", "Romance", "Historical Romance", "Historical", "Regency", "Historical", "Historical", "Historical Fiction", "Romance", "Clean Romance"], "author": "Debbie Raleigh", "rating": "3.59", "pages": "256"}, {"id": 338, "title": "Jitterbug Perfume", "blurb": "Jitterbug Perfume is an epic.Which is to say, it begins in the forests of ancient Bohemia and doesn’t conclude until nine o’clock tonight (Paris time).It is a saga, as well. A saga must have a hero, and the hero of this one is a janitor with a missing bottle.The bottle is blue, very, very old, and embossed with the image of a goat-horned god. If the liquid in the bottle actually is the secret essence of the universe, as some folks seem to think, it had better be discovered soon because it is leaking and there is only a drop or two left.", "genre": ["Fiction", "Fantasy", "Humor", "Magical Realism", "Literature", "Novels", "Contemporary"], "author": "Tom Robbins", "rating": "4.22", "pages": "352"}, {"id": 441, "title": "The New York Trilogy", "blurb": "The remarkable, acclaimed series of interconnected detective novels – from the author of 4 3 2 1: A NovelThe New York Review of Books has called Paul Auster’s work “one of the most distinctive niches in contemporary literature.” Moving at the breathless pace of a thriller, this uniquely stylized triology of detective novels begins with City of Glass, in which Quinn, a myst\nThe remarkable, acclaimed series of interconnected detective novels – from the author of 4 3 2 1: A NovelThe New York Review of Books has called Paul Auster’s work “one of the most distinctive niches in contemporary literature.” Moving at the breathless pace of a thriller, this uniquely stylized triology of detective novels begins with City of Glass, in which Quinn, a mystery writer, receives an ominous phone call in the middle of the night. He’s drawn into the streets of New York, onto an elusive case that’s more puzzling and more deeply-layered than anything he might have written himself. In Ghosts, Blue, a mentee of Brown, is hired by White to spy on Black from a window on Orange Street. Once Blue starts stalking Black, he finds his subject on a similar mission, as well. In The Locked Room, Fanshawe has disappeared, leaving behind his wife and baby and nothing but a cache of novels, plays, and poems.This Penguin Classics Deluxe Edition includes an introduction from author and professor Luc Sante, as well as a pulp novel-inspired cover from Art Spiegelman, Pulitzer Prize-winning graphic artist of Maus and In the Shadow of No Towers.\n...more", "genre": ["Fiction", "Mystery", "Literature", "American", "Novels", "Literature", "Contemporary", "New York", "The United States Of America", "Classics", "Mystery", "Crime"], "author": "Paul Auster", "rating": "3.88", "pages": "308"}, {"id": 472, "title": "Why Write?", "blurb": "autobiographical essays", "genre": ["Nonfiction", "Writing", "Essays", "Language", "Writing", "Autobiography", "Memoir"], "author": "Paul Auster", "rating": "3.78", "pages": "58"}, {"id": 513, "title": "Sliding for Home", "blurb": "", "genre": [], "author": "Frank Moher", "rating": "1.00", "pages": "118"}, {"id": 515, "title": "Programming Ruby: The Pragmatic Programmers' Guide", "blurb": "Ruby is an increasingly popular, fully object-oriented dynamic programming language, hailed by many practitioners as the finest and most useful language available today. When Ruby first burst onto the scene in the Western world, the Pragmatic Programmers were there with the definitive reference manual, Programming Ruby: The Pragmatic Programmer's Guide.Now in its second ed\nRuby is an increasingly popular, fully object-oriented dynamic programming language, hailed by many practitioners as the finest and most useful language available today. When Ruby first burst onto the scene in the Western world, the Pragmatic Programmers were there with the definitive reference manual, Programming Ruby: The Pragmatic Programmer's Guide.Now in its second edition, author Dave Thomas has expanded the famous Pickaxe book with over 200 pages of new content, covering all the improved language features of Ruby 1.8 and standard library modules. The Pickaxe contains four major sections:An acclaimed tutorial on using Ruby.The definitive reference to the language.Complete documentation on all built-in classes, modules, and methodsComplete descriptions of all 98 standard libraries.If you enjoyed the First Edition, you'll appreciate the expanded content, including enhanced coverage of installation, packaging, documenting Ruby source code, threading and synchronization, and enhancing Ruby's capabilities using C-language extensions. Programming for the World Wide Web is easy in Ruby, with new chapters on XML/RPC, SOAP, distributed Ruby, templating systems, and other web services. There's even a new chapter on unit testing.This is the definitive reference manual for Ruby, including a description of all the standard library modules, a complete reference to all built-in classes and modules (including more than 250 significant changes since the First Edition). Coverage of other features has grown tremendously, including details on how to harness the sophisticated capabilities of irb, so you can dynamically examine and experiment with your running code. Ruby is a wonderfully powerful and useful language, and whenever I'm working with it this book is at my side --Martin Fowler, Chief Scientist, ThoughtWorks\n...more", "genre": ["Computer Science", "Programming", "Science", "Technology", "Reference", "Computer Science", "Computers", "Nonfiction", "Computer Science", "Technical", "Science", "Computer Science", "Computer Science", "Software", "Computer Science", "Coding", "Science", "Engineering"], "author": "Dave Thomas", "rating": "4.03", "pages": "828"}, {"id": 568, "title": "The CSS Anthology", "blurb": "Note: A new edition of this book has been released. Please look for The CSS Anthology, 2nd Edition (ISBN: 097584198X) A practical guide on CSS (Cascading Style Sheets) for professionals and novices, that can be used both as a tutorial and read cover-to-cover or as a handy and practical reference book to common problems, solutions and effects. The Question and Answer form\nNote: A new edition of this book has been released. Please look for The CSS Anthology, 2nd Edition (ISBN: 097584198X) A practical guide on CSS (Cascading Style Sheets) for professionals and novices, that can be used both as a tutorial and read cover-to-cover or as a handy and practical reference book to common problems, solutions and effects. The Question and Answer format makes it easy for readers to solve their problems and learn more about common pitfalls and workarounds. CSS has been growing steadily in its adoption as a technology. CSS gives the developer complete control over how an HTML page looks without using cumbersome HTML tags- truly separating content from presentation. Many major organizations have been adopting CSS technology e.g. www.wired.com.\n...more", "genre": ["Computer Science", "Programming", "Design", "Website Design", "Internet", "Web", "Reference", "Science", "Technology", "Design", "Science", "Computer Science", "Nonfiction", "Computer Science", "Technical"], "author": "Rachel Andrew", "rating": "3.90", "pages": "376"}, {"id": 606, "title": "The Vice Guide to Sex and Drugs and Rock and Roll", "blurb": "What started out as a few Montreal drug addicts scamming welfare make-work programs back in 1994 has become a global empire of hedonism known simply as VICE. From a 16-page newspaper about punk bands and violence to stores, a clothing line, VICE Films, VICE TV, VICE Records, viceland.com, etc., VICE has become much more than a way for three guys to get laid. It's become a lifestyle, a degrading and disgusting lifestyle of sex and drugs and rock and roll and death. This book is a collection of the irreverent, hilarious and downright scary gonzo journalism that brought three losers from the crack houses of Le Plateau to the deluxe apartments of Manhattan.", "genre": ["Nonfiction", "Humor", "Pop Culture", "Comedy", "Music", "Reference", "History"], "author": "Suroosh Alvi", "rating": "4.06", "pages": "362"}, {"id": 619, "title": "Vice", "blurb": "From the incomparable Jane Feather, author of national bestsellers Vanity, Violet, and Valentine, comes this enthralling new romance of daring deception and forbidden passion.Juliana drew the line at becoming a harlot. She had already begun the week as a bride...and ended it as a murderess. She was sure no one would believe that she'd hit her elderly groom with a bed warmer and knocked him quite dead by accident. So she did the only thing she could - she ran. Yet now she was in no position to turn down a shocking proposition from the dangerously handsome Duke of Redmayne: that she become one man's wife and another man's mistress - his mistress. Could she play such a role? Could she live up to such a bargain? And once she had tasted the pleasures of Redmayne's bed, would she ever want anything else.", "genre": ["Romance", "Historical Romance", "Historical", "Regency", "Georgian", "Fiction"], "author": "Jane Feather", "rating": "3.52", "pages": "419"}, {"id": 623, "title": "The Automatic Millionaire Workbook: A Personalized Plan to Live and Finish Rich. . . Automatically", "blurb": "With this essential companion to the automatic #1 national bestseller, you can put pencil to paper and make your seven-figure dreams come true!The Automatic Millionaire rocketed to instant bestseller status because in its pages America's best-loved money coach, David Bach, delivered a uniquely foolproof, hassle-free plan for achieving financial security even if you have ze\nWith this essential companion to the automatic #1 national bestseller, you can put pencil to paper and make your seven-figure dreams come true!The Automatic Millionaire rocketed to instant bestseller status because in its pages America's best-loved money coach, David Bach, delivered a uniquely foolproof, hassle-free plan for achieving financial security even if you have zero willpower. Now The Automatic Millionaire Workbook lets you tailor that strategy to your own financial life in a line-by-line personal plan. The workbook features:THE WORKBOOK FEATURES:- The five questions that determine with 90 percent certainty if you will be an Automatic Millionaire- Charts and checklists for paying down debt while you save- A clear path for any renter to become a home owner- Worksheets to set savings goals and meet them, no matter how much you make- A game plan for paying off mortgages early- The one crucial step that guarantees your financial plan will succeed- Details on where to invest, what phone calls to make, and exactly what to say when automating your financial futureAlong the way, you will be inspired by stories of ordinary Americans from all walks of life who are becaming Automatic Millionaires. The Automatic Millionaire Workbook makes it easier than ever for you to put your financial life on autopilot and finish rich--without a budget.\nYou've dreamed it, now write it and do it. The rest is automatic! \n\n...more", "genre": ["Economics", "Finance", "Currency", "Money", "Nonfiction", "Finance", "Personal Finance", "Self Help"], "author": "David Bach", "rating": "3.77", "pages": "200"}, {"id": 624, "title": "The Automatic Millionaire Homeowner", "blurb": "David Bach's simple system for building wealth through homeownership will help you finish rich in any market.\nDavid Bach's simple system for building wealth through homeownership will help you finish rich in any market.\n...more", "genre": ["Economics", "Finance", "Nonfiction", "Finance", "Personal Finance", "Currency", "Money", "Business", "Self Help", "Audiobook", "Economics", "Menage", "M M M", "Reference"], "author": "David Bach", "rating": "3.81", "pages": null}, {"id": 635, "title": "Motorcycle Journeys Through the Southwest", "blurb": "Discover the best touring roads the Southwest has to offer in this entertaining and informative guide. Berke describes 66 separate rides, each about one day in length. Each trip has been designed to include both great roads and great scenery, plus the best campgrounds, parks, scenic landmarks and restaurants to be found. Lists information on points of interest with prices,\nDiscover the best touring roads the Southwest has to offer in this entertaining and informative guide. Berke describes 66 separate rides, each about one day in length. Each trip has been designed to include both great roads and great scenery, plus the best campgrounds, parks, scenic landmarks and restaurants to be found. Lists information on points of interest with prices, hours of operation and other helpful tips. \n...more", "genre": [], "author": "Martin C. Berke", "rating": "3.75", "pages": "432"}, {"id": 643, "title": "Motorcycle Basics Techbook", "blurb": "All common engine, chassis and electrical systems fully explained and illustrated. Topics covered include engine cycles and layouts, carburettors and fuel injection, ignition systems, clutches, gearbox, engine lubrication and cooling, wheels, tires, braking systems, suspension, steering, handling, design and electrical systems.", "genre": ["Reference", "Sports", "Motorcycling"], "author": "John Harold Haynes", "rating": "4.00", "pages": "222"}, {"id": 656, "title": "War and Peace", "blurb": "In Russia's struggle with Napoleon, Tolstoy saw a tragedy that involved all mankind. Greater than a historical chronicle, War and Peace is an affirmation of life itself, `a complete picture', as a contemporary reviewer put it, `of everything in which people find their happiness and greatness, their grief and humiliation'. Tolstoy gave his personal approval to this translat\nIn Russia's struggle with Napoleon, Tolstoy saw a tragedy that involved all mankind. Greater than a historical chronicle, War and Peace is an affirmation of life itself, `a complete picture', as a contemporary reviewer put it, `of everything in which people find their happiness and greatness, their grief and humiliation'. Tolstoy gave his personal approval to this translation, published here in a new single volume edition, which includes an introduction by Henry Gifford, and Tolstoy's important essay `Some Words about War and Peace'.\n...more", "genre": ["Classics", "Fiction", "Historical", "Historical Fiction", "Cultural", "Russia", "Literature", "Russian Literature", "Literature", "War", "Novels", "Historical", "Literature", "19th Century"], "author": "Leo Tolstoy", "rating": "4.15", "pages": "1392"}, {"id": 689, "title": "Natural Disasters [with Online Learning Center Access Code]", "blurb": "This book focuses on natural disasters: how the normal processes of the Earth concentrate their energies and deal heavy blows to humans and their structures. Natural Disasters is concerned with how the natural world operates and, in so doing, kills and maims humans and destroys their works.Throughout the book, certain themes are maintained:* energy sources underlying dis\nThis book focuses on natural disasters: how the normal processes of the Earth concentrate their energies and deal heavy blows to humans and their structures. Natural Disasters is concerned with how the natural world operates and, in so doing, kills and maims humans and destroys their works.Throughout the book, certain themes are maintained:* energy sources underlying disasters* plate tectonics and climate change* Earth processes operating in rock, water, and atmosphere* significance of geologic time* complexities of multiple variables operating simultaneously* detailed and readable case histories.The text aims to explain important principles about the Earth and then develop further understanding through numerous case histories. The book includes recent happenings such as the Western United States wildfires during the summer 2000 and the Los Alamos prescribed burn, also occurring in 2000.\n...more", "genre": ["Nonfiction", "Reference", "Textbooks", "Science"], "author": "Patrick L. Abbott", "rating": "3.63", "pages": "416"}, {"id": 713, "title": "Swiss Design 2004", "blurb": "Presented here by the Swiss Federal Office of Culture are the 20 winners of this year's national design competition and their prize-winning works, along with illustrations and a descriptive essay by the jury. Swiss Design 2004: Innovation focuses on innovative aspects of single works by these young designers within a framework of individual interviews. These interviews exp\nPresented here by the Swiss Federal Office of Culture are the 20 winners of this year's national design competition and their prize-winning works, along with illustrations and a descriptive essay by the jury. Swiss Design 2004: Innovation focuses on innovative aspects of single works by these young designers within a framework of individual interviews. These interviews explore the sometimes complex subject of innovation through specific questions from the points of view of Industrial Design, Jewellery, Graphics/Typography, and Design Theory.  Essays by Paul Elliman, Renate Menzi, Joachim Huber and Sibylle Omlin.  Paperback, 7.75 x 11 in./216 pgs / 80 color.\n...more", "genre": [], "author": "Bundesamt fur Kultur", "rating": "0.00", "pages": "216"}, {"id": 735, "title": "The First Stage Guitar Chord Chart: Learn How to Play the Most Commonly Played Guitar Chords!", "blurb": "This guitar chord chart is for the beginner who wants a simple and direct method to learn how to play chords on the guitar. There is no note reading or complicated theory to deal with. There are study notes and clearly illustrated fingering diagrams to help you on your way to playing chords to your favorite songs and some great exercises to get you going on your own songs.\nThis guitar chord chart is for the beginner who wants a simple and direct method to learn how to play chords on the guitar. There is no note reading or complicated theory to deal with. There are study notes and clearly illustrated fingering diagrams to help you on your way to playing chords to your favorite songs and some great exercises to get you going on your own songs. This guitar chord chart is clear and very easy to understand. Finally!, a learn to play guitar chord chart that offers you so much more! Includes 7 full chart pages of the most commonly played guitar chords! Now you can learn the most commonly played guitar chords! The ideal guitar learning chord chart for anyone who would like to quickly learn to play guitar! Includes lots of practice chord combinations! Learn to play guitar to rock 'n roll, country, blues, popular songs, etc., on an electric guitar, acoustic guitar, and 12 string guitar. Clear, simple, and very easy to understand illustrations.\n...more", "genre": [], "author": "Chris Lopez", "rating": "3.19", "pages": "8"}, {"id": 756, "title": "Captain Henry Morgan", "blurb": "", "genre": [], "author": "Oriental Institute", "rating": "5.00", "pages": "First"}, {"id": 763, "title": "Cien años de soledad", "blurb": "El libro se compone de 20 capítulos no titulados, en los cuales se narra una historia con una estructura cíclica temporal, ya que los acontecimientos del pueblo y de la familia Buendía, así como los nombres de los personajes se repiten una y otra vez, fusionando la fantasía con la realidad. En los tres primeros capítulos se narra el éxodo de un grupo de familias y el estab\nEl libro se compone de 20 capítulos no titulados, en los cuales se narra una historia con una estructura cíclica temporal, ya que los acontecimientos del pueblo y de la familia Buendía, así como los nombres de los personajes se repiten una y otra vez, fusionando la fantasía con la realidad. En los tres primeros capítulos se narra el éxodo de un grupo de familias y el establecimiento del pueblo de Macondo, desde el capítulo 4 hasta el 16 se trata el desarrollo económico, político y social del pueblo y los últimos cuatro capítulos narran su decadencia.\n...more", "genre": ["Fiction", "Classics", "Magical Realism", "Literature", "Fantasy", "Novels", "Historical", "Historical Fiction", "European Literature", "Spanish Literature", "Literary Fiction", "Cultural", "Latin American"], "author": "Gabriel García Márquez", "rating": "4.10", "pages": "496"}, {"id": 831, "title": "Snow Crash", "blurb": "Schon mit der ersten Zeile des bahnbrechenden Cyberpunk-Romans Snow Crash katapultiert Neal Stephenson den Leser in eine nicht allzu ferne Zukunft. In dieser Welt kontrolliert die Mafia den Pizzaservice, die USA bestehen aus einer Kette gleichartig organisierter Stadtstaaten und das Internet -- im Buch verkörpert durch das Metaverse -- sieht aus wie es uns der Medienrummel vom letzten Jahr glauben machen will. Das ist die Welt des Protagonisten Hiro -- Hacker, Samurai-Schwertkämpfer und Fahrer beim Pizzaservice. Als sich sein bester Freund mit einer neuen Designerdroge, Snow Crash genannt, ins Jenseits befördert und seine gleichermaßen schöne wie kluge Exfreundin Hiro um Hilfe bittet, was macht unser Protagonist? Er eilt zur Rettung herbei. Snow Crash, halsbrecherischer Roman des 21. Jahrhunderts, verarbeitet so ziemlich alles vom sumerischen Mythos bis hin zur Vision einer postmodernen Zivilisation am Rande des Zusammenbruchs. Schneller als das Fernsehen und weitaus unterhaltsamer zeichnet Snow Crash das Portrait einer Zukunft, die bizarr genug ist, um plausibel zu sein. Empfohlenes Buch für die Sektion Science-Fiction und Fantasy Dieses spannende Cyberpunk-Abenteuer sicherte Neal Stephenson seinen Platz in der Science-Fiction-Szene und schon allein die ersten 30 Seiten sind Ihr Geld wert. Das Buch beschwört eine zukünftige Welt herauf, in der das Internet virtuell ist und Avatare -- virtuelle Identitäten -- die Eintrittskarte zum Metaverse bilden. Aber eine Sache, die Snow Crash genannt wird, lichtet die Reihen der wichtigen Persönlichkeiten des Metaverse und eine Infokalypse droht. Hier kommt der Protagonist Hiro ins Spiel, Pizzaauslieferer, Ausnahme-Schwertkämpfer und Superhacker. Hiro und Teenie-Girl/Super-Skatepunk Y.T. sind wahrscheinlich die einzigen, die noch alles retten können, aber nur wenn sie nicht vorher von der Mafia oder von einem mit eigener Atombombe bewaffneten Psychopathen umgebracht werden.", "genre": ["Science Fiction", "Fiction", "Cyberpunk", "Fantasy", "Science Fiction Fantasy", "Dystopia", "Novels"], "author": "Neal Stephenson", "rating": "4.03", "pages": "534"}, {"id": 832, "title": "Snow Crash: The Official Strategy Guide", "blurb": "Based upon the book Snow Crash by Neal Stephenson, a futuristic world online makes up the Metaverse where avatars and daemons exist. The goal is to protect the Metaverse from Snow Crash, a virus/disease that will ultimately destroy the online world. Learn how to customize your defense with this Official Strategy Guide.", "genre": [], "author": "Melissa Tyler", "rating": "5.00", "pages": null}, {"id": 845, "title": "Wire", "blurb": "Wire objects have worked their way into virtually every human activity. Since the eighteenth century, such occupations as housekeeping, cooking, gardening, fishing, and hunting were unthinkable without them. Shopkeepers fashioned wire into display racks, and children played with wire toys. Many pieces, such as fruit bowls, platters, and baskets of all kinds served both practical and decorative functions. With its vintage photographs, pages from early catalogs, old advertisements, and more than 300 evocative full-color photographs, Wire reveals why there is such a strong revival of interest in these pieces and demonstrates how they can be integrated into our homes today.", "genre": [], "author": "Daniel Rozensztroch", "rating": "4.00", "pages": "148"}, {"id": 867, "title": "Secrets of the Alchemist Dar (A Treasure's Trove)", "blurb": "Secrets of the Alchemist Dar, the sequel to the New York Times bestselling A Treasure's Trove, is a fantasy story about Dark and Good Fairies, spells and eclipses, and Michael Stadther's signature characters: Zac the handsome woodcarver, Ana his beautiful half-elf half human wife, and their trusty doth, Pook. The story is also about the evil Alchemist Dar who wants his Dar\nSecrets of the Alchemist Dar, the sequel to the New York Times bestselling A Treasure's Trove, is a fantasy story about Dark and Good Fairies, spells and eclipses, and Michael Stadther's signature characters: Zac the handsome woodcarver, Ana his beautiful half-elf half human wife, and their trusty doth, Pook. The story is also about the evil Alchemist Dar who wants his Dark Fairies to live forever; to do this he must steal the Good Fairies' Rings of Fairy Life. Using the mysterious Book of Dark Spells, Dar kills the Good Fairies and captures the rings. The mystery begins with clues concealed in the pages of this book that will give anyone anywhere in the world who can read English a chance to solve the clues and obtain one of the one hundred real diamond rings valued together at more than US $2 million. Armchair adventurers will discover the treasure-hunting experience of a lifetime, andfamilies will enjoy hours of reading together.\n...more", "genre": ["Nonfiction"], "author": "Michael Stadther", "rating": "3.78", "pages": "144"}, {"id": 899, "title": "Of Mice and Men", "blurb": "NEW LONGMAN LITERATURE titles provide an excellent selection of popular modern fiction and are suitable for 14-18 year olds of all abilities. Notes and questions are provided at the beginning of each section to help guide the student's understanding of key themes and language. A programme of study provides practice in skills required at GCSE.“Guys like us, that work on ranches, are the loneliest guys in the world. They got no family. They don’t belong no place ...With us it ain’t like that.We got a future ... because I got you to look after me and you got me to look after you.”George and Lennie are migrant American labourers –the one alert and protective and the other strong, stupid and potentially dangerous. This is the powerful story of their relationship and their dreams of finding a more stable and less lonely way of life. This edition contains notes to help students' understanding.--back cover", "genre": ["Classics", "Fiction", "School", "Historical Fiction", "Literature", "Read For School", "Novels"], "author": "John Steinbeck", "rating": "3.88", "pages": "160"}, {"id": 917, "title": "And a Hard Rain Fell", "blurb": "I didn't set out to write a book. It was 1982, fourteen years after I had last set foot in Vietnam, and thirteen years after I returned to The World. I had a family and a career. I'd never written more than an occasional letter to the editor in my life. My twisted insides had spawned ulcers. The nightmares were more frequent. I needed to get Vietnam out into the open, but \nI didn't set out to write a book. It was 1982, fourteen years after I had last set foot in Vietnam, and thirteen years after I returned to The World. I had a family and a career. I'd never written more than an occasional letter to the editor in my life. My twisted insides had spawned ulcers. The nightmares were more frequent. I needed to get Vietnam out into the open, but I couldn't talk about it. Not after all those years. Thus begins John Ketwig's powerful memoir of the Vietnam War. Now, over 15 years after its initial publication, Sourcebooks is proud to bring ...and a hard rain fell back into print in a newly updated edition, with a new introduction by the author and eight pages of never-before-published photographs. From the country roads of upstate New York to the jungles of Vietnam, and finally to the Vietnam Veterans Memorial in Washington, D.C., ...and a hard rain fell is a gripping and visceral account of one young man's struggle to make sense of his place in a world gone mad.\n...more", "genre": ["History", "Nonfiction", "War", "War", "Military Fiction", "Autobiography", "Memoir", "Military", "Military History", "Biography", "Biography Memoir", "Cultural", "Asia", "North American Hi...", "American History"], "author": "John Ketwig", "rating": "4.13", "pages": "368"}, {"id": 933, "title": "Memoirs of a Geisha", "blurb": "This story is a rare and utterly engaging experience. It tells the extraordinary story of a geisha - summoning up a quarter century from 1929 to the post-war years of Japan's dramatic history, and opening a window into a half-hidden world of eroticism and enchantment, exploitation and degradation. A young peasant girl is sold as servant and apprentice to a renowned geisha house. She tells her story many years later from the Waldorf Astoria in New York. Her memoirs conjure up the perfection and the ugliness of life behind rice-paper screens, where young girls learn the arts of geisha - dancing and singing, how to wind the kimono, how to walk and pour tea, and how to beguile the land's most powerful men.", "genre": ["Fiction", "Historical Fiction", "Romance", "Historical", "Classics", "Japan", "Adult"], "author": "Arthur Golden", "rating": "4.14", "pages": "434"}, {"id": 966, "title": "Angeles & Demonios", "blurb": "Brown's Angels & Demons is now available in a Spanish-language audiobook. Unabridged. 18 CDs.", "genre": ["Fiction", "Mystery", "Thriller", "Mystery Thriller", "Suspense", "Adventure", "Crime"], "author": "Dan Brown", "rating": "3.93", "pages": "18"}, {"id": 983, "title": "Deception Point", "blurb": "When a NASA satellite discovers an astonishingly rare object buried deep in the Arctic ice, the floundering space agency proclaims a much-needed victory - a victory with profound implications for NASA policy and the impending Presidentail election. To verify the authenticity of the find, the White House calls upon the skills of intelligence analyst Rachel Sexton. Accompanied by a team of experts, including the charismatic scholar Michael Tolland, Rachel travels to the Arctic and uncovers the unthinkable: evidence of scientific trickery - a bold deception that threatens to plunge the world into controversy. But before she can warn the president, Rachel and Michael are ambushed by a team of assassins. Fleeing for their lives across a desolate and lethal landscape, their only hope for survival is to discover who is behind this masterful plot. The truth, they will learn, is the most shocking deception of all.(back cover)", "genre": ["Fiction", "Thriller", "Mystery", "Suspense", "Mystery Thriller", "Adventure", "Science Fiction"], "author": "Dan Brown", "rating": "3.74", "pages": "736"}, {"id": 1014, "title": "Pragmatic Version Control: Using Subversion", "blurb": "This book covers the theory behind version control and how it can help developers become more efficient, work better as a team, and keep on top of software complexity. Version control, done well, is your undo button for the project: nothing is final, and mistakes are easily rolled back.This book describes Subversion 1.3, the latest and hottest open source version control system, using a recipe-based approach that will get you up and running quickly and correctly. Learn how to use Subversion the right way-the pragmatic way.With this book, you can:Keep all project assets safe--not just source code--and never run the risk of losing a great idea Know how to undo bad decisions--even directories and symlinks are versioned Learn how to share code safely, and work in parallel for maximum efficiency Install Subversion and organize, administer and backup your repository Share code over a network with Apache, svnserve, or ssh Create and manage releases, code branches, merges and bug fixes Manage 3rd party code safely Use all the latest Subversion 1.3 features including locking and path-based security, and much more!Now there's no excuse not to use professional-grade version control.", "genre": ["Programming", "Reference", "Software", "Technology", "Technical", "Computer Science", "Coding"], "author": "Mike   Mason", "rating": "3.59", "pages": "256"}, {"id": 1032, "title": "Trump: The Art of the Deal", "blurb": "Trump reveals the business secrets that have made him America’s foremost deal maker! “I like thinking big. I always have. To me it’s very simple: If you’re going to be thinking anyway, you might as well think big.”—Donald J. Trump  Here is Trump in action—how he runs his business and how he runs his life—as he meets the people he needs to meet, chats with family and friend\nTrump reveals the business secrets that have made him America’s foremost deal maker! “I like thinking big. I always have. To me it’s very simple: If you’re going to be thinking anyway, you might as well think big.”—Donald J. Trump  Here is Trump in action—how he runs his business and how he runs his life—as he meets the people he needs to meet, chats with family and friends, clashes with enemies, and changes the face of the New York City skyline. But even a maverick plays by rules, and Trump has formulated eleven guidelines for success. He isolates the common elements in his greatest deals; he shatters myths; he names names, spells out the zeros, and fully reveals the deal-maker’s art. And throughout, Trump talks—really talks—about how he does it. Trump: The Art of the Deal is an unguarded look at the mind of a brilliant entrepreneur and an unprecedented education in the practice of deal-making. It’s the most streetwise business book there is—and the ultimate read for anyone interested in achieving money and success, and knowing the man behind the spotlight.  \n...more", "genre": ["Business", "Biography", "Nonfiction", "Politics", "Self Help", "Economics", "Finance", "Biography", "Autobiography", "Leadership", "Economics", "Autobiography", "Memoir"], "author": "Donald J. Trump", "rating": "3.67", "pages": "384"}, {"id": 1034, "title": "Trump University Real Estate 101: Building Wealth with Real Estate Investments", "blurb": "Trump University books are practical, straightforward primers on the basics of doing business the Trump way-successfully. Each book is written by a leading expert in the field and includes an inspiring Foreword by Trump himself. Key ideas throughout are illustrated by real-life examples from Trump and other senior executives in the Trump organization. Perfect for anyone wh\nTrump University books are practical, straightforward primers on the basics of doing business the Trump way-successfully. Each book is written by a leading expert in the field and includes an inspiring Foreword by Trump himself. Key ideas throughout are illustrated by real-life examples from Trump and other senior executives in the Trump organization. Perfect for anyone who wants to get ahead in business without the MBA, these streetwise books provide real-world business advice based on the one thing readers can't get in any business school-experience.  In Trump University Real Estate 101, you'll learn how to:  * Develop the entrepreneurial skills to succeed in real estate investing * Make money in any market at any time * Convert properties for new uses and make more money * Create instant equity in any property * Determine how financing will affect the cash flow and value of your property * Use options and assignments to buy and sell properties you don't own * Assess the value of similar properties by comparing and analyzing multiple features * And much more!\n...more", "genre": ["Business"], "author": "Gary W. Eldred", "rating": "3.60", "pages": "290"}, {"id": 1038, "title": "Trump: Surviving at the Top", "blurb": "In 1987 Donald Trump's The Art of the Deal took the country by storm; selling more than 825,000 copies in hardcover alone. Now Trump is back, in a book with a distinctly personal edge, taking the reader behind the scenes on the business deals that have kept his name continually in the headlines. Here too for the first time is Trump's account of the decline and fall of his celebrated marriage to Ivana. 16 pages of photographs.", "genre": ["Business", "Biography", "Self Help", "Autobiography", "Nonfiction"], "author": "Donald J. Trump", "rating": "3.51", "pages": "229"}, {"id": 1058, "title": "The Richest Man In Babylon", "blurb": "Beloved by millions, this timeless classic holds the key to all you desire and everything you wish to accomplish. This is the book that reveals the secret to personal wealth. The Success Secrets of the Ancients—An Assured Road to Happiness and Prosperity Countless readers have been helped by the famous “Babylonian parables,” hailed as the greatest of all inspirational works on the subject of thrift, financial planning, and personal wealth. In language as simple as that found in the Bible, these fascinating and informative stories set you on a sure path to prosperity and its accompanying joys. Acclaimed as a modern-day classic, this celebrated bestseller offers an understanding of—and a solution to—your personal financial problems that will guide you through a lifetime. This is the book that holds the secrets to keeping your money—and making more. The Richest Man in BabylonRead it and recommend it to loved ones—and get on the road to riches.MORE THAN TWO MILLION BOOKS SOLD", "genre": ["Finance", "Business", "Nonfiction", "Self Help", "Money", "Personal Finance", "Personal Development"], "author": "George S. Clason", "rating": "4.26", "pages": "First"}, {"id": 1145, "title": "A Weekend with Warren Buffett: And Other Shareholder Meeting Adventures", "blurb": "Once a year, the managers of public companies have to fling open the doors and let the owners in -- whether they want to or not. A Weekend with Warren Buffett and Other Shareholder Meeting Adventures is a humorous, informative business-related travelogue that looks at how companies in the United States, the United Kingdom and Australia treat their investors during the brie\nOnce a year, the managers of public companies have to fling open the doors and let the owners in -- whether they want to or not. A Weekend with Warren Buffett and Other Shareholder Meeting Adventures is a humorous, informative business-related travelogue that looks at how companies in the United States, the United Kingdom and Australia treat their investors during the brief period when the welcome mat is out. It's an Average Joe Investor's search for shareholder democracy and an occasional free lunch. Companies featured include Berkshire Hathaway, Citigroup, Dow Jones, Dupont, eBay, Gannett, Google, Hawaiian Electric, Hershey, MGM Grand, Microsoft, Otter Tail, Playboy, Starbucks, Tootsie Roll, Wal-Mart and Walt Disney, among others.\n...more", "genre": ["Nonfiction", "Business"], "author": "Randy Cepuch", "rating": "3.58", "pages": "250"}, {"id": 1153, "title": "The Midas Touch: The Strategies That Have Made Warren Buffett America's Pre-Eminent Investor", "blurb": "The investment formula of Warren Buffett--the only member of Forbes 400's billionaire group to earn his money solely from investments. From the author of The Money Masters.\nThe investment formula of Warren Buffett--the only member of Forbes 400's billionaire group to earn his money solely from investments. From the author of The Money Masters.\n...more", "genre": ["Economics", "Finance", "Business"], "author": "John Train", "rating": "3.59", "pages": "207"}, {"id": 48, "title": "The Bucaneers", "blurb": "Wharton's final novel (completed by Marion Mainwaring after the author's death in 1937) revolves around American and British society in the 1870s. Told in large part through the eyes of American debutantes, the story portrays innocent, wide-eyed, almost ethereal girls who turn into socially conscious women with financial worries--unrecognizable even to themselves. The begi\nWharton's final novel (completed by Marion Mainwaring after the author's death in 1937) revolves around American and British society in the 1870s. Told in large part through the eyes of American debutantes, the story portrays innocent, wide-eyed, almost ethereal girls who turn into socially conscious women with financial worries--unrecognizable even to themselves. The beginning sections quickly catch the listener's attention, with lush descriptions of rooms, clothes, and the heights of feminine beauty. We enter a world of intrigue: secrets, characters with past relationships that could prove fatal, and competition taken to its limits. Its literary value notwithstanding, this book might appeal to soap opera and romance fans. For more attentive listeners, it quickly becomes disconcerting as more and more characters with awkward British-sounding names are added. It's increasingly difficult to recall who's who without backing up the tape. Most libraries can pass on this one.-- Rochelle Ratner, formerly Poetry Editor, Soho Weekly News, New York\n...more", "genre": ["Classics", "Fiction", "Historical", "Historical Fiction", "Romance", "Historical", "Literature", "Literature", "American", "Classics", "Classic Literature", "Novels", "Literature", "19th Century"], "author": "Edith Wharton", "rating": "3.90", "pages": null}]