[{"id": 20001, "title": "Interfictions: An Anthology of Interstitial Writing", "blurb": "Nineteen writers dig into the imaginative spaces between conventional genres—realistic and fantastical, scholarly and poetic, personal and political—and bring up gems of new fiction: interstitial fiction.This is the literary mode of the new century, a reflection of the complex, ambiguous, and challenging world that we live in. These nineteen stories, by some of the most in\nNineteen writers dig into the imaginative spaces between conventional genres—realistic and fantastical, scholarly and poetic, personal and political—and bring up gems of new fiction: interstitial fiction.This is the literary mode of the new century, a reflection of the complex, ambiguous, and challenging world that we live in. These nineteen stories, by some of the most interesting and innovative writers working today, will change your mind about what stories can and should do as they explore the imaginative space between conventional genres. The editors garnered stories from new and established authors in the United States, Canada, Australia, and the United Kingdom, and also fiction translated from Spanish, Hungarian, and French. The collection features stories from Christopher Barzak, Colin Greenland, Holly Phillips, Rachel Pollack, Vandana Singh, Anna Tambour, Catherynne Valente, Leslie What, and others.\n...more", "genre": ["Short Stories", "Fantasy", "Fiction", "Anthologies", "Speculative Fiction", "Science Fiction", "Magical Realism", "Science Fiction Fantasy", "Short Stories", "Short Story Collection", "Weird Fiction", "New Weird"], "author": "Delia Sherman", "rating": "3.76", "pages": "291"}, {"id": 20002, "title": "The Fall of the Kings", "blurb": "This stunning follow-up to Ellen Kushner's cult-classic novel, Swordspoint, is set in the same world of labyrinthine intrigue, where sharp swords and even sharper wits rule. Against a rich tapestry of artists and aristocrats, students, strumpets, and spies, a gentleman and a scholar will find themselves playing out an ancient drama destined to explode their society's smu\nThis stunning follow-up to Ellen Kushner's cult-classic novel, Swordspoint, is set in the same world of labyrinthine intrigue, where sharp swords and even sharper wits rule. Against a rich tapestry of artists and aristocrats, students, strumpets, and spies, a gentleman and a scholar will find themselves playing out an ancient drama destined to explode their society's smug view of itself--and reveal that sometimes the best price of uncovering history is being forced to repeat it.... The Fall of the Kings Generations ago the last king fell, taking with him the final truths about a race of wizards who ruled at his side. But the blood of the kings runs deep in the land and its people, waiting for the coming together of two unusual men. Theron Campion, a young nobleman of royal lineage, is heir to an ancient house and a modern scandal. Tormented by his twin duties to his family and his own bright spirit, he seeks solace in the University. There he meets Basil St. Cloud, a brilliant and charismatic teacher ruled by a passion for knowledge--and a passion for the ancient kings. Of course, everyone now knows that the wizards were charlatans and the kings their dupes and puppets. Only Basil is not convinced--nor is he convinced that the city has seen its last king... From the Trade Paperback edition\n...more", "genre": ["Fantasy", "Fiction", "Romance", "M M Romance", "LGBT", "Queer", "LGBT", "Gay", "LGBT", "Science Fiction Fantasy", "Fantasy", "Fantasy Of Manners", "Romance", "Fantasy Of Manners", "Mannerpunk"], "author": "Ellen Kushner", "rating": "3.66", "pages": "510"}, {"id": 20009, "title": "Growing Up Untouchable in India: A Dalit Autobiography", "blurb": "There is much in Vasant Moon's extraordinary story of his vasti, his childhood neighbourhood in India, that would probably be true of any urban ghetto anywhere in the world. But there is much that is peculiarly and vividly Indian. In this first autobiography of a so-called Untouchable, we learn about the inescapable hierarchy imposed by caste, based on ancient principles of heriditary pollution. We see the unmatched importance of the heroic Dr. B. R. Ambedkar for India's awakened and newly ambitious Dalits. We feel, viscerally, Nagpur's heat and the joy brought by the monsoon. Vasant Moon's Vasti, the first Dalit autobiography to be published in English, is a moving and eloquent testament to a uniquely Indian life as well as to the universal human spirit.", "genre": ["India", "Politics", "Memoir", "History", "Biography", "Biography Memoir", "Nonfiction"], "author": "Vasant Moon", "rating": "3.83", "pages": "224"}, {"id": 20017, "title": "The Bill Slider Omnibus", "blurb": "ORCHESTRATED DEATHMiddle-class, middle-aged and, according to his partner, menopausal, Detective Inspector Bill Slider is never going to make it to the Yard. Passed over for promotion again, the last thing he needs in his life, or on his patch, is an unidentifiable, naked female corpse.A priceless Stradivarius and a giant tin of olive oil are the only clues in an investigation that takes the steely-eyed, furry-headed detective all the way from the exotic backstreets of Shepherd's Bush to far-flung Birmingham.DEATH WATCHWhen a noted womaniser dies in mysterious circumstances in a sleazy motel and the whole of his murky past comes to light, DI Bill Slider begins to question more than whether the game is worth the candle. Right is right, and indivisible. As soon as he's solved the motel mystery, and found out what the Neary boys and Gorgeous George are up to, Slider's going to have to start putting his own house in orders ...NECROCHIPDetective Superintendent 'George' Dickson's replacement by DS 'Mad Ivan' Barrington - a new broom determined to sweep clean - is all par for the course for DI Bill Slider, as he faces the unhygienic fact of a dismembered corpse in a catering establishment.But there are still niggling questions to distract him: why didn't Barrington like Dickson? What is the mystery of the stake-out they once did together? And why is Slider's home life in almost perpetual stride?", "genre": ["Mystery"], "author": "Cynthia Harrod-Eagles", "rating": "4.24", "pages": "848"}, {"id": 20018, "title": "Dear Departed", "blurb": "Chattie Cornfeld was murdered while jogging in the park. She ran her own small marketing company and lived comfortably, perhaps too comfortably for her income. At first it looked as though she was the latest victim of the Park Killer, but it doesn't take Slider and Atherton long to establish that someone was trying to pass the killing off as part of a pattern—only the pattern doesn't fit, this one was personal. Chattie was popular with all who crossed her path, and it was difficult to imagine she had gained any enemies. Turning to the two most popular motives for murder—money and passion—Slider and his team's investigation turn up some puzzling anomalies in her life, not least the number of men who counted themselves as her lover and the tangled relationships of her family. But none of the suspects can be made to fit what evidence they have, unless of course they've been mis-reading the evidence.", "genre": ["Mystery", "Crime", "Fiction", "Mystery Thriller", "Historical Fiction"], "author": "Cynthia Harrod-Eagles", "rating": "3.98", "pages": "352"}, {"id": 20019, "title": "Killing Time", "blurb": "Detective Inspector Bill Slider is back at his post at London's Shepherd's Bush police station--accompanied by a persistent headache, resulting from a recent case that also left his steadfast colleague Atherton hospitalized. And the throbbing pain is compounded by his ex-wife's efforts to seek a reconciliation that doesn't happen to sit well with Joanna, his lover. But his\nDetective Inspector Bill Slider is back at his post at London's Shepherd's Bush police station--accompanied by a persistent headache, resulting from a recent case that also left his steadfast colleague Atherton hospitalized. And the throbbing pain is compounded by his ex-wife's efforts to seek a reconciliation that doesn't happen to sit well with Joanna, his lover. But his domestic problems are swiftly put on hold when duty calls.After receiving a series of threatening correspondence, a gender-bending, erotic male dancer had pleaded with Slider for help. But the wily policeman doesn't respond until it's too late--and the dancer has been murdered. Probing the victim's sordid career, Slider plunges into a world of seedy nightclubs to interrogate table-dancers, prostitutes, pimps, and cabinet ministers with some very peculiar peccadilloes. When the vicious attack of a popular constable links itself to the dancer's murder, Slider delves even deeper to find the connection between the two incidents. As the pressure mounts, he must work his trusted gray matter to the quick if he wants to prevent a savage murderer from killing again.\n...more", "genre": ["Mystery", "Fiction", "Mystery", "Crime", "European Literature", "British Literature", "Suspense", "Thriller", "Mystery Thriller", "Mystery", "Detective"], "author": "Cynthia Harrod-Eagles", "rating": "4.03", "pages": "280"}, {"id": 20020, "title": "Death Watch", "blurb": "Publishers Weekly hailed the first book in this series, Orchestrated Death, with a starred review at publication, giving special praise to the book's sophisticated ending and strong players. Now, in Death Watch, London policeman Bill Slider returns in a case of arson--and murder.", "genre": ["Mystery", "Crime", "Fiction", "British Literature", "Mystery Thriller"], "author": "Cynthia Harrod-Eagles", "rating": "3.88", "pages": "280"}, {"id": 20021, "title": "The Tangled Thread", "blurb": "1788 - The French Revolution; beginning of Industrial RevolutionIn France, as the revolution begins, Henri, the bastard offshoot of the Morland family, strives to protect his family. He binds his daughter Heloise in loveless marriage to a Revolutionary, and allies himself with the vigorous Danton. But in the bloodbath of the Terror and the fall of Danton, Henri goes to the guillotine and Heloise flees to England where she is welcomed warmly by the Morland family. In Yorkshire Jemima's troublesome brood cause her anxiety - especially her youngest, Lucy, who disguises herself as a boy and runs away to sea - but at last she sees three of her children marry and the hope of an heir to Morland Place.", "genre": ["Historical Fiction", "Historical", "Fiction", "Romance", "Historical Romance", "France"], "author": "Cynthia Harrod-Eagles", "rating": "4.33", "pages": "474"}, {"id": 20022, "title": "The Flood-Tide", "blurb": "1772 - George III; the American War of IndependenceEngland is peaceful under George III, and Morland Place flourishes under the careful tending of Jemima and her loyal husband Allen. Their seven children often bring them heartache, but they are sustained by their love for each other and their absorbing interest in improving the estate lands. But beyond England's shores thi\n1772 - George III; the American War of IndependenceEngland is peaceful under George III, and Morland Place flourishes under the careful tending of Jemima and her loyal husband Allen. Their seven children often bring them heartache, but they are sustained by their love for each other and their absorbing interest in improving the estate lands. But beyond England's shores things are not so calm. Morland cousins find themselves embroiled in the American war for independence, and the family's bastard offshoot, Henri, disports himself in the salons of Paris while outside revolution creeps closer.\n...more", "genre": ["Historical", "Historical Fiction", "Historical", "Fiction", "Romance", "Historical Romance", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.25", "pages": "428"}, {"id": 20023, "title": "The White Road", "blurb": "August 1914The whole country is thrilled by the declaration of war. The British Expeditionary Force goes off to France to defend gallant little Belgium, and thousands more young men rush to volunteer, hoping to see action before the war ends at Christmas. At home everyone competes to be doing the most for the war effort. The Morlands have their share of volunteers, and no-\nAugust 1914The whole country is thrilled by the declaration of war. The British Expeditionary Force goes off to France to defend gallant little Belgium, and thousands more young men rush to volunteer, hoping to see action before the war ends at Christmas. At home everyone competes to be doing the most for the war effort. The Morlands have their share of volunteers, and no-one can say they aren't at the very heart of things. But when Christmas comes the war is far from over, and nine in ten of the men who marched, singing, down the white road to Mons have fallen.\n...more", "genre": ["Historical", "Historical Fiction", "Historical", "Fiction", "War", "World War I", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.31", "pages": "480"}, {"id": 20024, "title": "The Maiden", "blurb": "1720: political intrigue besets the kingdom as the Stuarts try to claim the throne occupied by the Hanoverians and the Morlands have to use all their wiles to keep their fortunes intact. Jeremy Morland, sole heir to his father's will, has no option but to marry to cold-hearted Lady Mary to secure Hanoverian protection and safeguard his inheritance. Then the rebellion of '4\n1720: political intrigue besets the kingdom as the Stuarts try to claim the throne occupied by the Hanoverians and the Morlands have to use all their wiles to keep their fortunes intact. Jeremy Morland, sole heir to his father's will, has no option but to marry to cold-hearted Lady Mary to secure Hanoverian protection and safeguard his inheritance. Then the rebellion of '45 and the bloody massacre at Culloden thrust his daughter Jemima into the spotlight as the saviour of the family. Independent, single-minded, and a rare beauty, Jemima is a capable caretaker of the Morland heritage. Although Morland Place and its lands suffer from the excesses of her dissolute husband, Jemima's quiet courage earns her an abiding love and loyalty.\n...more", "genre": ["Historical", "Historical Fiction", "Historical", "Fiction", "Romance", "Romance", "Historical Romance", "European Literature", "British Literature"], "author": "Cynthia Harrod-Eagles", "rating": "4.29", "pages": "413"}, {"id": 20025, "title": "The Oak Apple", "blurb": "1630 - Charles I; the Civil WarWhen civil war destroys the long years of peace in England, the clash between King and Parliament is echoed at Morland Place. Richard, the heir, brings home a Puritan bride, while his dashing brother Kit joins the Royalist cavalry under Prince Rupert, leaving their father, Edmund, desperately trying to steer a middle course. As the war grinds on, bitterness replaces early fervour and divisions grow deeper, and through it all Edmund struggles grimly to protect his inheritance and keep Morland Place intact.", "genre": ["Historical Fiction", "Historical", "Fiction", "British Literature", "Romance", "17th Century", "Historical Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.21", "pages": "403"}, {"id": 20026, "title": "The Emperor", "blurb": "1795 - NapoleonThe shadow of Napoleon is falling across Europe, and a restlessness seems to be changing mores and loosening society's restraints. At Morland Place James's marriage to Mary Ann is falling apart; Lucy's to Chetwyn is in the balance as she embarks on a blatant affair with a sea officer; and William supports a mistress he cannot marry. Mary goes to sea with her husband Captain Haworth and is caught up in the battle of the Nile; and as war becomes inevitable, Lucy knows she must say goodbye to her love as every fighting captain waits eagerly for his commission.", "genre": ["Historical Fiction", "Historical", "Fiction", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.30", "pages": "512"}, {"id": 20046, "title": "Show Me God: What the Message from Space Is Telling Us About God", "blurb": "In exclusive interviews, Stephen Hawking, NASA leaders, and Nobel prize-winning astronomers talk about how their discoveries have affected life's big questions. Topics include the creation and fine-tuning of the universe, the purpose of life, and the nature of God. The humor and multimedia format make this title make it especially appealing. 98 photos.", "genre": ["Science", "Nonfiction", "Religion", "Christianity", "Spirituality", "Faith", "Theology"], "author": "Fred Heeren", "rating": "4.00", "pages": "397"}, {"id": 20048, "title": "An Argument for Mind", "blurb": "In this elegantly written book, Jerome Kagan melds the history of the field of psychology during the past 50 years with the story of his own research efforts of the same period and an analysis of what he terms “the currently rocky romance between psychology and biology.” As Kagan unwinds his own history, he reveals the seminal events that have shaped his career and discuss\nIn this elegantly written book, Jerome Kagan melds the history of the field of psychology during the past 50 years with the story of his own research efforts of the same period and an analysis of what he terms “the currently rocky romance between psychology and biology.” As Kagan unwinds his own history, he reveals the seminal events that have shaped his career and discusses how his assumptions have changed. With full appreciation for the contributions to psychology of history, philosophy, literature, and neuroscience, he approaches a wide range of fascinating topics, including:·   the abandonment of orthodox forms of behaviorism and psychoanalysis·   the forces that inspired later-twentieth-century curiosity about young children·   why B. F. Skinner chose to study psychology·   why the study of science less often ignites imaginations today·   our society’s obsession with erotic love·   the resurgence of religious fanaticism and the religious RightEmbedded in Kagan’s discussions is a rejection of the current notion that a mature neuroscience will eventually replace psychology. He argues that a complete understanding of brain is not synonymous with a full explanation of mind, and he concludes with a brief prediction of the next five decades in the field of psychology.\n...more", "genre": ["Psychology"], "author": "Jerome Kagan", "rating": "4.11", "pages": "304"}, {"id": 20051, "title": "The Nature of the Child", "blurb": "The world-famous Harvard psychologist challenges many of psychology's most deeply held assumptions about human development—arguing, for example, that early experience does not inexorably shape our lives and that the influence of the family is more subtle than has been supposed.", "genre": ["Psychology", "Childrens"], "author": "Jerome Kagan", "rating": "3.46", "pages": "352"}, {"id": 20052, "title": "Unstable Ideas: Temperament, Cognition, and Self", "blurb": "In his most probing and expansive work to date, Jerome Kagan--one of this country's leading psychologists--demonstrates that innovative research methods in the behavioral sciences and neurobiology, together with a renewed philosophical commitment to rigorous empiricism, are transforming our understanding of human behavior. Contemporary psychology, according to Kagan, has been preoccupied with three central themes: How malleable is temperament? How predictable are the milestones of cognitive development? How accurate is consciousness as a window onto the self, its motives, beliefs, and emotions?In a review of past approaches to these questions, Kagan argues persuasively that behavioral scientists have reached less-than-satisfactory answers because they have failed to appreciate the biases inherent in their frame of reference and the limitations of their investigative procedures. He calls into question a number of techniques that have been mainstays of psychological investigation: the Ainsworth Strange Situation for assessing the emotional attachment of an infant to its mother, and interviews and questionnaires as indexes of personality, to name only two. Kagan's own research has used novel laboratory situations to discover a group of children who exhibit a pattern of behavior he calls temperamentally inhibited--they are restless and irritable from birth, and by twenty-four months cling to the mother and show biological signs of high anxiety in unfamiliar situations.These findings, coupled with current understanding of the structure and chemistry of the nervous system, lead him to speculate that these children are born with a biological predisposition that favors the development of a shy, fearful personality. Through longitudinal studies of this kind, as well as through his cross-cultural investigations of cognitive development, Kagan has infused new meaning into the nature-nurture debate.", "genre": ["Psychology"], "author": "Jerome Kagan", "rating": "4.00", "pages": "328"}, {"id": 20055, "title": "Crazy Woman", "blurb": "Sane and shrewd and funny...The story of a woman whose captivity is divided equally between her life with her own people and her life among the Indians.LILLIAN SCHISSELAuthor of WOMEN'S DIARIES OF THE WESTWARD JOURNEYSara Franklin is an outcast among her own white people. Her thirst for knowledge and spirituality is threatening to both her abusive father and her neurotic husband. When she is captured by the Apaches in New Mexico, they dub her Crazy Woman, and treat her like a slave. Yet, as she begins to learn the ways of her captors, she earns their respect as a strong, clever, even magical, woman. And when her innate sensual hunger is tempted, challenged, and finally satisfied by an Apache warrior, Sara finally embraces her whole self at last, body and soul....", "genre": ["Historical Fiction"], "author": "Kate Horsley", "rating": "3.44", "pages": "280"}, {"id": 20205, "title": "The Harbrace Anthology Of Poetry", "blurb": "THE HARBRACE ANTHOLOGY OF POETRY OFFERS UPDATED BIOGRAPHICAL AND EXPLANATORY NOTES FOR BOTH TRADITIONAL AND CONTEMPORARY POEMS, STRATEGIES FOR WRITING ABOUT LITERATURE, AND A CONCISE GLOSSARY OF LITERARY TERMS.", "genre": ["Poetry", "Nonfiction", "Anthologies", "Reference"], "author": "Jon C. Stott", "rating": "3.81", "pages": null}, {"id": 20285, "title": "The Complete Garden Bird Book: How To Identify And Attract Birds To Your Garden", "blurb": "This reference combines full identification and behavioural features of over 70 common garden birds with detailed, highly visual information on attracting and encouraging birds to the garden. The book is illustrated in colour throughout and designed for ease of use.", "genre": ["Nature", "Nonfiction"], "author": "Mark Golley", "rating": "3.84", "pages": "176"}, {"id": 20355, "title": "The Burnt Orange Heresy", "blurb": "A new paperback edition of the neo-noir novel book critics have called Willeford's best. Fast-talking, backstabbing, womanizing art critic Jacques Figueras will do anything - blackmail, burglary, fencing, assassination - to further his career. Crossing the art world with the underworld, Willeford expands his noir palette to include hues of sunny Florida and weird tints of \nA new paperback edition of the neo-noir novel book critics have called Willeford's best. Fast-talking, backstabbing, womanizing art critic Jacques Figueras will do anything - blackmail, burglary, fencing, assassination - to further his career. Crossing the art world with the underworld, Willeford expands his noir palette to include hues of sunny Florida and weird tints of Surrealism when Figueras takes a job for an art collector who doesn't care how his art is collected, even if it involves murder.\n...more", "genre": ["Fiction", "Mystery", "Crime", "Mystery", "Mystery", "Noir", "Art", "Novels", "Thriller", "Literature", "20th Century", "Literature", "American", "Thriller", "Mystery Thriller"], "author": "Charles Willeford", "rating": "3.79", "pages": "144"}, {"id": 20397, "title": "Khalil Gibran Reader: \"Spirits Rebellious\", \"Secrets of the Heart\", \"Tears and Laughter\"", "blurb": "I prefer to be a dreamer among the humblest, with visions to be realized, than lord among those without dreams and desires. The Kahlil Gibran Reader brings together sayings, poems, and short pieces from one of the twentieth century's most revered writers. Born in Lebanon in 1883, Kahlil Gibran's groundbreaking philosophy and simple yet eloquent poetry made him a figure of international renown. His writings have been translated into more than twenty languages, and his reflections on the nature of humanity continue to bring joy and inspiration to millions.This beautiful and accessible book is infused with Gibran's timeless and provocative truths, touching on subjects as diverse as love, friendship, beauty, wealth, sorrow, ambition, and destiny. A thoughtful gift for all milestone occasions-graduations, birthdays, anniversaries-and for every age group, this remarkable collection will provide a lifetime's worth of wisdom. To be closer to God, be closer to people.", "genre": ["Poetry", "Inspirational", "Fiction", "Philosophy"], "author": "Kahlil Gibran", "rating": "4.09", "pages": "Paperback"}, {"id": 20426, "title": "Magic Pencil: Children's Book Illustration Today", "blurb": "This highly illustrated new book features the work of thirteen of the top children's book illustrators working in the UK today. Each chapter contains a commentary by the illustrator, introducing their work and explaining how they started to illustrate children's books, and shows several original artworks by each illustrator. Quentin Blake's introduction reflects on the complexities of providing an illustrative response to the characters and activities of a writer.Joanna Carey, formerly Children's Book Editor of The Guardian, contributes an illustrated essay on the history of children's book illustration, from the work of Cruikshank, Ardizonne, and Walter Crane, to the instantly recognisable pictures from Winnie the Pooh and the tales of Beatrix Potter. The illustrators featured are: Angela Barrett, Quentin Blake, Lauren Child, Patrick Benson, Raymond Briggs, Sara Fanelli, Stephen Biesty, John Burningham, Michael Foreman, Tony Ross, Posy Simmonds, Emma Chichester Clark, and Charlotte Voake.", "genre": ["Art"], "author": "Quentin Blake", "rating": "4.17", "pages": "112"}, {"id": 20519, "title": "What Would Machiavelli Do?: The Ends Justify the Meanness", "blurb": "What Would Machiavelli Do?He would feast on other people's discordHe wouldn't exactly seek the company of ass-kissers and bimbos, but he wouldn't reject them out of hand eitherHe would realize that loving yourself means never having to say you're sorryHe would kill people, but only if he could feel good about himself afterwardHe would establish and maintain a psychotic lev\nWhat Would Machiavelli Do?He would feast on other people's discordHe wouldn't exactly seek the company of ass-kissers and bimbos, but he wouldn't reject them out of hand eitherHe would realize that loving yourself means never having to say you're sorryHe would kill people, but only if he could feel good about himself afterwardHe would establish and maintain a psychotic level of controlHe would use other people's opinions to sell his book!\n...more", "genre": ["Business", "Nonfiction", "Politics", "Humor", "Philosophy", "Psychology", "Self Help", "Leadership", "History", "Business", "Management"], "author": "Stanley Bing", "rating": "3.45", "pages": "176"}, {"id": 20672, "title": "Why Zebras Don't Get Ulcers", "blurb": "Now in a third edition, Robert M. Sapolsky's acclaimed and successful Why Zebras Don't Get Ulcers features new chapters on how stress affects sleep and addiction, as well as new insights into anxiety and personality disorder and the impact of spirituality on managing stress.As Sapolsky explains, most of us do not lie awake at night worrying about whether we have leprosy or\nNow in a third edition, Robert M. Sapolsky's acclaimed and successful Why Zebras Don't Get Ulcers features new chapters on how stress affects sleep and addiction, as well as new insights into anxiety and personality disorder and the impact of spirituality on managing stress.As Sapolsky explains, most of us do not lie awake at night worrying about whether we have leprosy or malaria. Instead, the diseases we fear--and the ones that plague us now--are illnesses brought on by the slow accumulation of damage, such as heart disease and cancer. When we worry or experience stress, our body turns on the same physiological responses that an animal's does, but we do not resolve conflict in the same way--through fighting or fleeing. Over time, this activation of a stress response makes us sick.\n...more", "genre": ["Psychology", "Nonfiction", "Science", "Health", "Science", "Biology", "Self Help", "Biology", "Neuroscience", "Health", "Mental Health", "Health", "Medicine", "Audiobook"], "author": "Robert M. Sapolsky", "rating": "4.19", "pages": "282"}, {"id": 20706, "title": "Later Auden", "blurb": "The definitive study of Auden's poems from 1939 to 1973.For a poet like myself, an autobiography is redundant, W. H. Auden wrote to a friend, since anything of importance that happens to one is immediately incorporated, however obscurely, in a poem. This book is the history of Auden's poems, and of the events that went into them, from the time he moved to the United States until his death, completing the story begun in Edward Mendelson's acclaimed Early Auden.Later Auden links the changes in Auden's intellectual, emotional, religious, and erotic life with his shifting public roles--as representative of political causes, as researcher working with the U.S. Army in postwar Germany, as public moralist, as lecturer and teacher, and above all as poet. Mendelson deftly reveals how Auden converted the success and later wreckage of his relationship with Chester Kallman into the seemingly impersonal meditations of some of his long poems, and explores the ways his later poetry celebrates the human body and represents it in verse. Throughout, he reveals the depth of Auden's struggles with himself and with the temptations of his growing fame, showing how these struggles gave shape to his imperishable art.This inner biography of a great poet and thinker has unusual breadth and intensity. An absorbing narrative of a varied, productive life, it will interest everyone who cares about literature.", "genre": ["Poetry", "Biography", "Nonfiction", "Literary Criticism"], "author": "Edward Mendelson", "rating": "4.37", "pages": "608"}, {"id": 20772, "title": "The Christmas Wish", "blurb": "As the daughter of the Devilish Dandy, Sarah Cresswell is excluded from society. She is content with her life helping unfortunate children until Lord Chance sweeps through her door demanding her help in finding his mother's jewels that have been stolen. Determined to prove to the arrogant Lord that she is capable of finding any jewel thief in London Sarah guides Lord Chanc\nAs the daughter of the Devilish Dandy, Sarah Cresswell is excluded from society. She is content with her life helping unfortunate children until Lord Chance sweeps through her door demanding her help in finding his mother's jewels that have been stolen. Determined to prove to the arrogant Lord that she is capable of finding any jewel thief in London Sarah guides Lord Chance through the seamy underside of town. It never occurs to the practical maiden that her heart might be in danger or that it will take the efforts of her notorious father to make her most cherished Christmas wish come true.\n...more", "genre": ["Romance", "Holiday", "Christmas", "Historical", "Fiction", "Romance", "Historical Romance", "Historical Romance", "Regency Romance", "Historical", "Historical Fiction"], "author": "Debbie Raleigh", "rating": "3.24", "pages": "218"}, {"id": 20805, "title": "Why I Am a Catholic", "blurb": "In this provocative work, which could not be timelier, Garry Wills, one of our country's most noted writers and historians, offers a powerful statement of his Catholic faith. Beginning with a reflection on his early experience of that faith as a child and later as a Jesuit seminarian, Wills reveals the importance of Catholicism in his own life. He goes on to challenge, in \nIn this provocative work, which could not be timelier, Garry Wills, one of our country's most noted writers and historians, offers a powerful statement of his Catholic faith. Beginning with a reflection on his early experience of that faith as a child and later as a Jesuit seminarian, Wills reveals the importance of Catholicism in his own life. He goes on to challenge, in clear and forceful terms, the claim that criticism or reform of the papacy is an assault on the faith itself. For Wills, a Catholic can be both loyal and critical, a loving child who stays with his father even if the parent is wrong. Wills turns outward from his personal experiences to present a sweeping narrative covering two thousand years of church history, revealing that the papacy, far from being an unchanging institution, has been transformed dramatically over the millennia -- and can be reimagined in the future. At a time when the church faces one of its most difficult crises, Garry Wills offers an important and compelling entrée into the discussion of the church's past -- and its future. Intellectually brisk and spiritually moving, Why I Am a Catholic poses urgent questions for Catholic and non-Catholic readers alike.\n...more", "genre": ["Religion", "Religion", "Christianity", "Nonfiction", "History", "Spirituality", "Religion", "Theology", "Christianity", "Catholic", "Biography", "Philosophy", "Christian"], "author": "Garry Wills", "rating": "3.59", "pages": "416"}, {"id": 20877, "title": "The Musashi Flex", "blurb": "Under the Galactic Confederation, there are very few ways to rise above your caste. One is to become a player in the extreme martial arts game known as the Musashi Flex. In the early 23rd century, three people will enter its violent culture: a battle-scarred veteran, an infiltrator, and a cunning upstart. Their fates will entwine--and be decided--in the bloody arena of the Flex. And if they survive, their story will become legend.", "genre": ["Science Fiction", "Science Fiction Fantasy", "Fiction", "Space Opera", "Speculative Fiction", "Fantasy"], "author": "Steve Perry", "rating": "4.24", "pages": "321"}, {"id": 20905, "title": "A Documentary History of Communism: Communism in Russia", "blurb": "An extensive revision of the valued but unobtainable 1960 edition. Nearly 300 key documents are now readily available in translation.", "genre": ["History", "Politics"], "author": "Robert V. Daniels", "rating": "3.75", "pages": "480"}, {"id": 20939, "title": "American Religious Poems: An Anthology", "blurb": "No more profound and intimate expression of America’s spiritual life can be found than the work of its poets. From Anne Bradstreet to the Beats, from Native American chant and Shaker hymnody to Walt Whitman and Emily Dickinson, religion and spirituality have always been central to American poetry. In this unique anthology, world-renowned scholar Harold Bloom weaves a tapes\nNo more profound and intimate expression of America’s spiritual life can be found than the work of its poets. From Anne Bradstreet to the Beats, from Native American chant and Shaker hymnody to Walt Whitman and Emily Dickinson, religion and spirituality have always been central to American poetry. In this unique anthology, world-renowned scholar Harold Bloom weaves a tapestry from the many strands of American religious experience and practice: the searching meditations of Puritan pioneers, the evangelical fervor of the Great Awakenings, the mystical currents of Transcendentalism, the diverse influences of the world religions that have taken root in modern America.Spanning four centuries and more than 200 poets, American Religious Poems is a bountiful and moving gathering of voices that offers countless moments of inspiration, solace, meditation, and transcendence. The poems in this unprecedented volume are a lasting testimony to the American spirit and its unremitting quest for ultimate truth and meaning.This deluxe collector’s edition features: • an introduction by Harold Bloom;  • a reader’s guide to significant topics and themes in the poems;  • Smyth-sewn binding and flexible, leatherette covers; and  • a ribbon page-marker.\n...more", "genre": ["Poetry", "Anthologies", "Religion"], "author": "Harold Bloom", "rating": "4.02", "pages": "685"}, {"id": 20952, "title": "Buffalo Bill's Wild West: An American Legend", "blurb": "A panoramic celebration of the colorful characters that made up the Wild West shows, with color and black and white photos throughout.", "genre": ["History"], "author": "R.L. Wilson", "rating": "3.81", "pages": "316"}, {"id": 21015, "title": "Dead Man's Chest", "blurb": "George can't deny the danger anymore. Leroy, the head of the underworld, knows who they are. But the clues are starting to come together and the treasure is only a map away. Will it be worth the risk?George and his friends know this isn't a just game of hide-and-seek anymore. There is a cursed diamond buried in the tunnels, and they are close to finding it. But Leroy and his thugs know who they are, and where they live. It's too big a risk to go on, but George won't give up. Sworn to protect each other by the Pyrate's Oath, the four friends vow to track down the last map -- the one that will complete the puzzle and lead them to the treasure. But as they take extra care to look out for one another, they don't realize they are putting others in danger.", "genre": ["Adventure", "Childrens", "Fiction"], "author": "Chris Archer", "rating": "4.08", "pages": "171"}, {"id": 21036, "title": "Riding the Roller Coaster: A History of the Chrysler Corporation", "blurb": "From the Chrysler Six of 1924 to the front-wheel-drive vehicles of the 70s and 80s to the minivan, Chrysler boasts an impressive list of technological firsts. But even though the company has catered well to a variety of consumers, it has come to the brink of financial ruin more than once in its seventy-five-year history.  How Chrysler has achieved monumental success and \nFrom the Chrysler Six of 1924 to the front-wheel-drive vehicles of the 70s and 80s to the minivan, Chrysler boasts an impressive list of technological firsts. But even though the company has catered well to a variety of consumers, it has come to the brink of financial ruin more than once in its seventy-five-year history.  How Chrysler has achieved monumental success and then managed colossal failure and sharp recovery is explained in Riding the Roller Coaster,  a lively, unprecedented look at a major force in the American automobile industry since 1925. Charles Hyde tells the intriguing story behind Chrysler-its products, people, and performance over time-with particular focus on the company's management. He offers a lens through which the reader can view the U.S. auto industry from the perspective of the smallest of the automakers who, along with Ford and General Motors, make up the Big Three.  The book covers Walter P. Chrysler's life and automotive career before 1925, when he founded the Chrysler Corporation, to 1998, when it merged with Daimler-Benz. Chrysler made a late entrance into the industry in 1925 when it emerged from Chalmers and Maxwell, and further grew when it absorbed Dodge Brothers and American Motors Corporation. The author traces this journey, explaining the company's leadership in automotive engineering, its styling successes and failures, its changing management, and its activities from auto racing to defense production to real estate. Throughout, the colorful personalities of its leaders-including Chrysler himself and Lee Iacocca-emerge as strong forces in the company's development, imparting a risk-taking mentality that gave the company its verve.\n...more", "genre": ["Business"], "author": "Charles K. Hyde", "rating": "4.35", "pages": "408"}, {"id": 21066, "title": "J. C. Leyendecker", "blurb": "Hardcover: 207 pages Publisher: Watson-Guptill Publications; 1ST edition (1974) Language: English ISBN-10: 0823027570 ISBN-13: 978-0823027576 Product Dimensions: 12.2 x 9.2 x 1 inches Shipping Weight: 2.8 pounds", "genre": ["Art", "Nonfiction"], "author": "Michael Schau", "rating": "4.46", "pages": "207"}, {"id": 21093, "title": "What Would You Do?", "blurb": "AmericanGirl magazine asked its readership how they'd handle everyday problems. What if someone told a lie about them? Would they tell the teacher if a classmate was cheating? This book is filled with quizzes that ask readers these same questions.", "genre": ["Self Help"], "author": "Patti Kelley Criswell", "rating": "4.23", "pages": "63"}, {"id": 21122, "title": "The Coming of Age", "blurb": "What do the words elderly, old, and aged really mean? How are they used by society, and how in turn do they define the generation that we are taught to respect and love but instead castigate and avoid? Most importantly, how is our treatment of this generation a reflection of our society's values and priorities? In The Coming of Age, Simone de Beauvoir seeks greater underst\nWhat do the words elderly, old, and aged really mean? How are they used by society, and how in turn do they define the generation that we are taught to respect and love but instead castigate and avoid? Most importantly, how is our treatment of this generation a reflection of our society's values and priorities? In The Coming of Age, Simone de Beauvoir seeks greater understanding of our perception of elders. With bravery, tenacity, and forceful honesty, she guides us on a study spanning a thousand years and a variety of different nations and cultures to provide a clear and alarming picture of Society's secret shame--the separation and distance from our communities that the old must suffer and endure.\n...more", "genre": ["Philosophy", "Nonfiction", "Feminism", "History", "Sociology", "Cultural", "France", "Anthropology", "Psychology", "Womens", "Classics"], "author": "Simone de Beauvoir", "rating": "3.95", "pages": "592"}]