[{"id": 2600001, "title": "Long Time No See", "blurb": "In Susan Isaac's Long Time No See, Courtney Logan, former investment analyst, devoted mother, and Long Island housewife, leaves her home on Halloween night for a quick trip to the grocery store. Five months later, her badly decomposed body is found floating in the backyard pool, concealed by the pool cover. Enter Judith Singer, who helped find a murderer in Isaac's 1978 bestseller, Compromising Positions. Something about the Logan case doesn't make sense to Judith, and she becomes so engrossed in the mystery that she actually knocks on the grieving husband's door and offers to help exonerate him. Long Time No See draws on the best of the light, character-driven mysteries, like those by Janet Evanovich and Mary Daheim. Isaac's first- person heroine is impulsive enough to get herself into trouble, yet thoughtful enough to invite confidences. And her voice is appealingly funny and honest. Since becoming a widow, she reflects, when faced with a twist in her investigation,  I'd tried hard not to indulge in the lonely person's Happy Hour: talking to oneself. About a year earlier, in the drugstore, I found myself befuddled, dithering between a condom rack and a display of batteries, and was startled when I heard my own loud voice demanding: 'Why am I here?' But now I gave in and had a chat with me.  Although clever and well-written, the novel's real strength lies in its characterization and in Isaac's leisurely unfolding of the implausible dark side of the perky blonde murder victim. This is a welcome outing from a deservedly popular writer. --Regina Marler", "genre": ["Mystery", "Fiction", "Romance", "Humor", "Contemporary", "Crime", "Romantic Suspense"], "author": "Susan Isaacs", "rating": "3.63", "pages": "First"}, {"id": 2600002, "title": "Marea incierta", "blurb": "The Maude Idris anchors in the Thames loaded with all type of valuable materials, like ebony and ivory, coming from Africa. That same afternoon, captain Clement Louvain leaves the surveillance of the ship and its load in charge of some armed sailors but, the following day, he finds out that the ivory has been stolen and one of the sailors has been murdered. In order to elucidate the matter and recover the stolen ivory, Louvain will ask William Monk to investigate the case.", "genre": ["Mystery", "Historical Fiction", "Historical Mystery", "Fiction", "Victorian", "Historical", "British Literature"], "author": "Anne Perry", "rating": "4.11", "pages": "352"}, {"id": 2600004, "title": "Crocus", "blurb": "WhetherAligned with the mechanismwhereby the spirit is borne aloftthrough song comes againthe question: whether. And not soothedso much as opened by the boysoprano's Sanctus, what movesin the mind as the throat constrictsin sympathy, one note peeledfrom the last, fine as paper slippedfrom a garlic bulb, veined, translucent, is whether--as ifwound through the spiralingampli\nWhetherAligned with the mechanismwhereby the spirit is borne aloftthrough song comes againthe question: whether. And not soothedso much as opened by the boysoprano's Sanctus, what movesin the mind as the throat constrictsin sympathy, one note peeledfrom the last, fine as paper slippedfrom a garlic bulb, veined, translucent, is whether--as ifwound through the spiralingamplitude, purpled, fretted, one voice suspendedin concentration of prayer or terrorwills itself above faltering, more perfect since time mustsoon break it. And made it.Whether and by whatever impossiblearrangement of stars, harmonies, correspondences through whichthe music finds the spirit and likea blade slits and releases, circulates the questionthrough the phrase, the delicateengine--as if it matters: the songrises, everything goes with it.The poems in Crocus take as their starting points the interior universes created by myth, art, andmemory, and through the exploration of these terrains create new ways of understanding the ordinary.\n...more", "genre": ["Poetry"], "author": "Karin Gottshall", "rating": "4.63", "pages": "78"}, {"id": 2600007, "title": "Crocus", "blurb": "The barnyard friends of Crocus the crocodile love and admire him for his fierce-looking teeth. When he must have them pulled, life changes for all the animals.", "genre": ["Childrens", "Picture Books"], "author": "Roger Duvoisin", "rating": "3.06", "pages": "32"}, {"id": 2600009, "title": "La máquina de ajedrez", "blurb": "En el siglo XVIII la nobleza del imperio austríaco queda deslumbrada por una máquina capaz de pensar y jugar al ajedrez. ¿Invento genial o estafa? En el palacio de Schónbrunn tiene lugar la presentación de un insólito invento: un autómata que juega al ajedrez.El sorprendente artefacto. que tiene la apariencia externa de un gran turco de penetrantes ojos azules. guarda en sus entrañas un misterio que guía sus manos y su mente. Un secreto que solo conocen su creador. el ingeniero y consejero de la corte Kempelen. y su ayudante carpintero- un secreto confinado en el desván del ingeniero. del que solo es sacado con ocasión de las concurridas partidas de ajedrez y que ha empezado a suscitar envidias y recelo.Pero el sueño de éxito que acaricia Kempelen no tarda en transformarse en pesadilla cuando. en presencia del turco autómata . una hermosa aristócrata halla la muerte en misteriosas circunstancias. La máquina pensante se convierte entonces en objeto de espionaje. de persecución eclesiástica y de intrigas de la nobleza.", "genre": ["Historical Fiction", "Fiction", "Chess", "Historical", "German Literature", "18th Century", "Roman"], "author": "Robert Löhr", "rating": "3.50", "pages": "Paperback"}, {"id": 2600018, "title": "Crimson  Skies. Piratengold. Wings Of Fortune Bd. 1", "blurb": "The Ace's Dream I've always been lucky, although you wouldn't necessarily know it to look at me. Take now, for instance, 15,000 feet off the ground in the seat of a baby Nieuport, Archie bursting shells all around me, German Pfalz buzzing around like someone stirred up a wasps' nest, machine guns tracing lines of fire through the air. But not a single bullet-hole marring the canvas of my Nieuport, much less me. Like I said, lucky. A Pflaz roars past, guns chattering. I pull back on the stick hard, pulling up my machine's nose and climbing up after him. I roll to the side and come up right behind. The Hun pilot doesn't even see me. With a grin I get him in my sights and hit the trigger on the paired machine guns mounted on the nose of my machine. They yammer out 650 rounds a minute, tracers lighting the way to the Pfalz's tail. I see smoke pour out in a steady stream and the Pfalz starts to go into a dive, the wind fanning the flames spreading across his tail. He! 's finished. I don't bother watching him go down, not when there are so many other tempting targets to deal with. I climb up to 20,000, the ceiling of my little Nieuport, and look down, spotting another Pflaz some 4,000 feet below. I bank to the left and come down in a dive, putting the Hun directly in my sights. Machine guns roar and the tracers announce my attack, but too late. The Pfalz banks one way, then the other, trying to get away, but I stay on him, my rounds ripping through canvas and cracking framework, looking for a vital spot or the pilot himself. I find it when some rounds reach the Pfalz's engine, which starts to smoke and the machine goes into a long, slow dive, trailing smoke like a flag of surrender. Making a close pass, I give the Hun pilot an ironic salute as he starts to drop, almost close enough to imagine he can hear me, even over the roar of the wind and the crackle of the flames starting to spout from his crippled engine. When you get to ground, tell 'em Nathan Zachary sent you!", "genre": ["Pulp", "Fiction"], "author": "Stephen Kenson", "rating": "3.62", "pages": "First"}, {"id": 2600022, "title": "Cure Tooth Decay: Heal and Prevent Cavities with Nutrition", "blurb": "There is a holistic alternative to conventional dental treatments which can help you heal tooth pain, reduce tooth infections, halt tooth decay and inhibit gum disease. Learn about a flexible whole foods dietary program pioneered by the head of research at the National Dental Association, Weston Price D.D.S. that proved 90-95% effective in halting cavities. Cure Tooth Deca\nThere is a holistic alternative to conventional dental treatments which can help you heal tooth pain, reduce tooth infections, halt tooth decay and inhibit gum disease. Learn about a flexible whole foods dietary program pioneered by the head of research at the National Dental Association, Weston Price D.D.S. that proved 90-95% effective in halting cavities. Cure Tooth Decay provides clear and easy to understand dental facts so you can make healthy, life affirming choices about your dental health, including a non-surgical approach to halt baby-bottle tooth decay. Learn five nutritional programs that Nagel used to cure his own cavities, and halt his daughter's severe cavities. Restore dental and oral health through nutrition and lifestyle, not harmful chemicals and surgery. Dr. Gallagher the president of the the Holistic Dental Association says, Cure Tooth Decay is treasure-trove of wisdom as it takes the mystery out of dental health.\n...more", "genre": ["Health", "Nonfiction", "Health", "Nutrition", "Food and Drink", "Food", "Reference", "Science", "Food and Drink", "Diets", "Self Help", "Medical", "Science", "Biology"], "author": "Ramiel Nagel", "rating": "4.01", "pages": "208"}, {"id": 2600023, "title": "Nuclear Physics in a Nutshell", "blurb": "Nuclear Physics in a Nutshell provides a clear, concise, and up-to-date overview of the atomic nucleus and the theories that seek to explain it. Bringing together a systematic explanation of hadrons, nuclei, and stars for the first time in one volume, Carlos A. Bertulani provides the core material needed by graduate and advanced undergraduate students of physics to acquire\nNuclear Physics in a Nutshell provides a clear, concise, and up-to-date overview of the atomic nucleus and the theories that seek to explain it. Bringing together a systematic explanation of hadrons, nuclei, and stars for the first time in one volume, Carlos A. Bertulani provides the core material needed by graduate and advanced undergraduate students of physics to acquire a solid understanding of nuclear and particle science. Nuclear Physics in a Nutshell is the definitive new resource for anyone considering a career in this dynamic field.The book opens by setting nuclear physics in the context of elementary particle physics and then shows how simple models can provide an understanding of the properties of nuclei, both in their ground states and excited states, and also of the nature of nuclear reactions. It then describes: nuclear constituents and their characteristics; nuclear interactions; nuclear structure, including the liquid-drop model approach, and the nuclear shell model; and recent developments such as the nuclear mean-field and the nuclear physics of very light nuclei, nuclear reactions with unstable nuclear beams, and the role of nuclear physics in energy production and nucleosynthesis in stars.Throughout, discussions of theory are reinforced with examples that provide applications, thus aiding students in their reading and analysis of current literature. Each chapter closes with problems, and appendixes address supporting technical topics.\n...more", "genre": ["Science", "Nonfiction", "Science", "Physics"], "author": "Carlos A. Bertulani", "rating": "3.85", "pages": "488"}, {"id": 2600028, "title": "Henry VI, Part III", "blurb": "Henry VI, Part III is a History written by English playwright William Shakespeare, who is widely considered to be the greatest writer of the English language. Henry VI, Part III is a play that is a continuation of the story of King Henry from the time of the War of the Roses and features the appearance of the future King Richard III. Henry VI, Part III is an important work of William Shakespeares, and is highly recommended for fans of his works as well as those discovering his plays for the first time.", "genre": ["Plays", "Classics", "Drama", "Fiction", "Historical Fiction", "Poetry", "Theatre"], "author": "William Shakespeare", "rating": "3.70", "pages": "188"}, {"id": 2600030, "title": "Henry VI (Parts I, II and III)", "blurb": "1 Henry VI was the Rose Theatre's great draw in the spring of 1592, a dramatic tale of the lives of soldiers, diplomats, kings, and insurrectionists. It centres on the fractious instability of the court and nobility of fifteenth-century England, and their squabbles with their French counterparts. Despite its debut performance in 1592, however, 1 Henry VI does not take a pr\n1 Henry VI was the Rose Theatre's great draw in the spring of 1592, a dramatic tale of the lives of soldiers, diplomats, kings, and insurrectionists. It centres on the fractious instability of the court and nobility of fifteenth-century England, and their squabbles with their French counterparts. Despite its debut performance in 1592, however, 1 Henry VI does not take a printed form until its appearance some thirty years later in the 1623 Folio. There are many questions, therefore, surrounding exactly how many people wrote the play, when they did so, how it was performed, who played what part, and the nature of the manuscript behind the first performance. In his wide-ranging introduction, Michael Taylor offers answers to these questions, and discusses other key issues such as language, structure, performance history, and the role of women in the play.\n...more", "genre": ["Classics", "Plays", "Drama", "Fiction", "Historical", "Historical Fiction", "Plays", "Theatre", "Historical", "Poetry", "European Literature", "British Literature", "Literature"], "author": "William Shakespeare", "rating": "3.82", "pages": "625"}, {"id": 2600034, "title": "Dim Sum: Traditional Favourites and Innovative Creations", "blurb": "One of the greatest pleasures in Chinese cuisine Â– Â‘dim sumÂ’ (which means Â‘touch the heartÂ’ in Cantonese) Â– is probably the most often enjoyed culinary fare and offers an endless assortment and variation of dish choices. These exotic tasty delights are often served in petite portions and have become increasingly popular to be had as a meal. With a great assortment of savory and sweet choices ranging from enticing buns, dumplings and pastries Â– who wouldnÂ’t enjoy having dim sum? Anyone who has enjoyed the pleasures of a dim sum meal has more often than not wondered at the gastronomical possibilities of recreating these delights in their very own kitchen. This is now made possible with Dim Sum.  Dim Sum is a contemporary compilation of authentic dim sum recipes from the private collection of renowned chef Â– Chef Chan Chen Hei. Chef ChanÂ’s bold and original approach to traditional dim sum strips much of the mystery that goes into his scrumptious creations such as Steamed Pork Dumpling topped with Crab Roe, Deep-fried Chewy Dumpling, White Jade Roll with Crab Sauce  to name a few. His creativity and desire to experiment with unexplored combinations of flavours and textures is evident in his other unique creations like Sugar Cane Jelly, Ginger Egg Tart, Green Tea Dumpling  etc, these and many more never fail to excite and tantalise the palates.  The recipes featured are specially selected from Chef ChanÂ’s private collection that he has compiled over years of experimenting, innovating and perfecting dim sum dishes. Dim Sum is an unique treasure cove of many delightful dim sum recipes and peppered with nuggets of advice and tips from Chef Chan. Both professionals and novices will find Dim Sum a useful reference for replicating dim sum dishes that are served in top restaurants. Beautiful full colour photos accompany the recipes and these in itself will guarantee to inspire even novices to discover the superb flavours of dim sum at home. Expand your culinary repertoire with Dim Sum!", "genre": ["Cookbooks"], "author": "Chan Chen Hei", "rating": "3.67", "pages": "147"}, {"id": 2600046, "title": "Absolute C++ [with MyCodemate Student Access]", "blurb": "Absolute C++, offers complete coverage of the C++ programming language. It provides all the tools necessary for experienced and novice programmers to master C++, including: thorough coverage of the Standard Template Library; complete and fully executable code throughout; sections highlighting programming tips and common pitfalls; and a logical order of coverage of C++ topics in order for students to better understand the language. This book is appropriate for introductory courses covering the C++ language, intermediate programming courses introducing C++ to students familiar with another language and will act as a total reference beyond a student's coursework. This book also comes with Addison-Wesley's CodeMate. This online program competency builder transforms a student's reading experience into a dynamic programming environment with a click of a mouse. CodeMate allows students to view, compile, run, and edit programming problems directly from the textbook without installing a compiler.", "genre": ["Nonfiction", "Computer Science", "Textbooks", "Reference", "Programming", "Computers", "Science"], "author": "Walter J. Savitch", "rating": "3.80", "pages": "912"}, {"id": 2600048, "title": "Il partner", "blurb": "Un giovane avvocato, dopo aver abilmente orchestrato la sua finta morte, è sparito con novanta milioni di dollari e con una massa di prove e documenti che potrebbero smascherare un importante caso di corruzione ai vertici dello stato. FBI e detective privati, uomini di legge e nemici che lo vogliono davvero morto, sono da tempo sulle sue tracce, e quando viene finalmente catturato, si scatena una battaglia senza esclusione di colpi, in cui è la legge lo strumento per nascondere le proprie colpe e l'arma per uccidere.", "genre": ["Fiction", "Thriller", "Mystery", "Legal Thriller", "Suspense", "Crime", "Mystery Thriller"], "author": "John Grisham", "rating": "3.95", "pages": "400"}, {"id": 2600049, "title": "Lelaki Misterius: No Ordinary Man", "blurb": "Pembunuh Sarasota kembali beraksi. Korban, sama seperti sepuluh korban sebelumnya, adalah wanita muda berambut gelap dengan potongan pendek, berwajah manis, dan tinggal sendirian. Sebelum dibunuh korban diperkosa, lalu ditinggalkan dalam keadaaan telanjang dengan kaki terikat.Jess Baxter, orangtua tunggal yang berprofesi sebagai penyanyi lepas, menyadari dirinya memiliki kesamaan dengan profil para korban. Ia pun mulai mewaspadai empat lelaki yang saat ini tengah mendekatinya: Ian, mantan suaminya, Rob, penyewa paviliun di sebelah rumahnya, Frank, teman kerja Rob, dan Stanford, tetangganya yang aneh.Di antara keeempatnya, Rob-lah yang paling misterius. Sikapnya yang begitu tertutup-terutama menyangkut latar belakangnya-membuat Jess tertarik sekaligus bertanya-tanya. Jess begitu terhanyut dalam pesona dan percintannya yang panas dengan Rob hingga tidak menyadari bahaya yang mengintai dirinya dan putrinya.", "genre": ["Romance", "Romantic Suspense", "Contemporary", "Contemporary Romance", "Harlequin", "Fiction", "Mystery"], "author": "Suzanne Brockmann", "rating": "3.59", "pages": "360"}, {"id": 2600051, "title": "Der Goldene Kompass / Das Magische Messer / Das Bernstein Teleskop", "blurb": "Die Waise Lyra, Hauptfigur in »Der Goldene Kompass, lebt in einer Parallelwelt – der unseren ganz ähnlich –, in der Wissenschaft, Theologie und Magie eng miteinander verwoben sind. Als ihr bester Freund verschwindet, macht Lyra sich auf die Suche nach ihm und kommt einer finsteren Verschwörung auf die Spur. Sie muss herausfinden, was es mit dem seltsamen »Staub auf sich \nDie Waise Lyra, Hauptfigur in »Der Goldene Kompass, lebt in einer Parallelwelt – der unseren ganz ähnlich –, in der Wissenschaft, Theologie und Magie eng miteinander verwoben sind. Als ihr bester Freund verschwindet, macht Lyra sich auf die Suche nach ihm und kommt einer finsteren Verschwörung auf die Spur. Sie muss herausfinden, was es mit dem seltsamen »Staub auf sich hat. In »Das Magische Messer bekommt sie dabei Unterstützung von Will, der ein besonderes Messer besitzt: Mit ihm kann er Fenster zwischen den Welten öffnen. Nach und nach entdecken Lyra und Will die Wahrheit über Lyras Herkunft. Und über ihre Rolle in der großen Schlacht, die nicht nur eine Welt umfasst und die in »Das Bernstein-Teleskop ihren spannenden Abschluss findet.Drei großartige Bände in einem – Fantasie, Spannung und Lesespaß pur!\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Childrens", "Science Fiction Fantasy", "Science Fiction", "Adventure", "Classics", "Science Fiction", "Steampunk", "Childrens", "Middle Grade"], "author": "Philip Pullman", "rating": "4.28", "pages": "1328"}, {"id": 2600052, "title": "Das magische Messer", "blurb": "Vor vielen Jahren verschwand Wills Vater spurlos auf einer Expedition in den hohen Norden. Auf der Suche nach ihm gerät Will zufällig durch ein Fenster in eine andere Welt. Dort begegnet er Lyra, die eine lange Odyssee hinter sich hat und das Geheimnis des Staubes ergründen will. Im Turm der Engel wollen WIll und Lyra Antworten auf ihre Fragen finden. Stattdessen gewinnt\nVor vielen Jahren verschwand Wills Vater spurlos auf einer Expedition in den hohen Norden. Auf der Suche nach ihm gerät Will zufällig durch ein Fenster in eine andere Welt. Dort begegnet er Lyra, die eine lange Odyssee hinter sich hat und das Geheimnis des Staubes ergründen will. Im Turm der Engel wollen WIll und Lyra Antworten auf ihre Fragen finden. Stattdessen gewinnt Will ein magisches Messer. Er besitzt ungeahnte Kräfte, kann Materie teilen und Türen in andere Welten schneiden. Doch das Messer ist mit Wills Schicksal noch auf eine andere Weise von größter Tragweite verbunden …\n...more", "genre": ["Fantasy", "Young Adult", "Fiction", "Childrens", "Adventure", "Science Fiction", "Audiobook", "Science Fiction Fantasy", "Science Fiction", "Steampunk", "Childrens", "Middle Grade"], "author": "Philip Pullman", "rating": "4.14", "pages": "11"}, {"id": 2600053, "title": "The Ethical Foundations of Marxism", "blurb": "", "genre": ["Philosophy", "Politics"], "author": "Eugene Kamenka", "rating": "3.39", "pages": "208"}, {"id": 2600055, "title": "Euclid's Elements", "blurb": "The classic Heath translation, in a completely new layout with plenty of space and generous margins. An affordable but sturdy sewn hardcover student and teacher edition in one volume, with minimal notes and a new index/glossary.", "genre": ["Mathematics", "Science", "Classics", "Philosophy", "Nonfiction", "History", "Reference"], "author": "Euclid", "rating": "4.32", "pages": "499"}, {"id": 2600056, "title": "A Briefer History Of Time", "blurb": "An accessible and up-to-date guide for nonscientists addressing the nature of space and time, the role of God in creation, and the history and future of the universe.", "genre": ["Science", "Nonfiction", "Physics", "History", "Astronomy", "Popular Science", "Philosophy"], "author": "Stephen Hawking", "rating": "4.25", "pages": "First"}, {"id": 2600057, "title": "A Briefer History in Time", "blurb": "Stephen Hawking's 1988 A Brief History of Time is hands down the bestselling book by a theoretical physicist in history. In fact, according the author's own estimates, one copy of his science classic has been sold for every 750 earthlings. This updated briefer history of time presents a more concise and accessible version of Hawking's seminal introduction to cosmology.", "genre": ["Science", "Nonfiction", "Physics", "History", "Astronomy", "Popular Science", "Philosophy"], "author": "Stephen Hawking", "rating": "4.25", "pages": "Unknown"}, {"id": 2600147, "title": "The Impressionists", "blurb": "The Life and Works art series collects the world's greatest artists and art movements into a handsome set of monographs Each book features a biography of an artist or an explanation of the movement, followed by 50 magnificent, individually commentated reproductions Each is an affordable treasure, sure to please every seasoned critic and newcomer to the beauty of great art.", "genre": ["Art", "Nonfiction"], "author": "Janice Anderson", "rating": "4.04", "pages": "80"}, {"id": 2600173, "title": "Entitled to Power: Farm Women and Technology, 1913-1963", "blurb": "The advent of modern agribusiness irrevocably changed the patterns of life and labor on the American family farm. In Entitled to Power, Katherine Jellison examines midwestern farm women's unexpected response to new labor-saving devices. Federal farm policy at mid-century treated farm women as consumers, not producers. New technologies, as promoted by agricultural extension\nThe advent of modern agribusiness irrevocably changed the patterns of life and labor on the American family farm. In Entitled to Power, Katherine Jellison examines midwestern farm women's unexpected response to new labor-saving devices. Federal farm policy at mid-century treated farm women as consumers, not producers. New technologies, as promoted by agricultural extension agents and by home appliance manufacturers, were expected to create separate spheres of work in the field and in the house. These innovations, however, enabled women to work as operators of farm machinery or independently in the rural community. Jellison finds that many women preferred their productive roles on and off the farm to the domestic ideal emphasized by contemporary prescriptive literature. A variety of visual images of farm women from advertisements and agricultural publications serve to contrast the publicized view of these women with the roles that they chose for themselves. The letters, interviews, and memoirs assembled by Jellison reclaim the many contributions women made to modernizing farm life.Originally published in 1993.A UNC Press Enduring Edition -- UNC Press Enduring Editions use the latest in digital technology to make available again books from our distinguished backlist that were previously out of print. These editions are published unaltered from the original, and are presented in affordable paperback formats, bringing readers both historical and cultural value.\n...more", "genre": ["History", "Textbooks"], "author": "Katherine Jellison", "rating": "4.18", "pages": "240"}, {"id": 2600210, "title": "Human Sexuality", "blurb": "For undergraduate courses in Human Sexuality, Marriage and Family, Intimate Relationships, Love and Intimacy With an interpersonal focus, Hock's Human Sexuality emphasizes the choice, awareness and responsibility that is integral to a planned, proactive, and well-educated sexual philosophy. Using an interpersonal, psycho-social foundation that approaches core content from a student perspective, this text focuses on the topics that are most critical and of greatest relevance to the students' diverse personal lives and their interactions with others. Written in a casual, easy-to-read, conversational style that will help them be more comfortable with and more connected to the course material, Roger Hock encourages and challenges students to consolidate the ideas and knowledge gained from the text into the growth of his or her personal sexual philosophy.", "genre": ["Psychology", "Textbooks", "Nonfiction", "School", "Academic"], "author": "Roger R. Hock", "rating": "4.08", "pages": "654"}, {"id": 2600265, "title": "Blue Fin", "blurb": "Twelve-year-old Steve Pascoe is nicknamed 'Snook' by everyone in Port Lincoln. He's thin and long-faced, like the fish he's named after. At school he's no good at sport and, at home, his father scorns him. Snook joins his father and fellow crewmen on a tuna-fishing expedition, when disaster strikes. It is up to Snook to save himself and his father from a desperate situatio\nTwelve-year-old Steve Pascoe is nicknamed 'Snook' by everyone in Port Lincoln. He's thin and long-faced, like the fish he's named after. At school he's no good at sport and, at home, his father scorns him. Snook joins his father and fellow crewmen on a tuna-fishing expedition, when disaster strikes. It is up to Snook to save himself and his father from a desperate situation.\n...more", "genre": ["Fiction", "Childrens", "Cultural", "Australia", "Young Adult"], "author": "Colin Thiele", "rating": "3.75", "pages": null}, {"id": 2600700, "title": "The Scriptures New Century Version: New Testament With Psalms and Proverbs", "blurb": "This portable New Testament with Psalms and Proverbs in a single-column layout reads like a novel Its user-friendly format makes it the perfect Bible for evangelism and for giving to seekers and new believers. Features include:The New Testament, Psalms, and Proverbs of the easy-to-read, easy-to-understand New Century VersionHow to Read the Bible OverviewThe Plan of SalvationFour Bible reading plans", "genre": ["Religion", "Christianity", "Christian Non Fiction"], "author": "Anonymous", "rating": "4.70", "pages": "616"}, {"id": 2600797, "title": "Seneca In Ten Volumes", "blurb": "This is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into pri\nThis is a reproduction of a book published before 1923. This book may have occasional imperfections such as missing or blurred pages, poor pictures, errant marks, etc. that were either part of the original artifact, or were introduced by the scanning process. We believe this work is culturally important, and despite the imperfections, have elected to bring it back into print as part of our continuing commitment to the preservation of printed works worldwide. We appreciate your understanding of the imperfections in the preservation process, and hope you enjoy this valuable book.\n...more", "genre": ["Philosophy", "History", "Writing", "Essays", "Classics"], "author": "Seneca", "rating": "4.43", "pages": null}, {"id": 2600805, "title": "Somewhere in Heaven: The Remarkable Love Story of Dana and Christopher Reeve", "blurb": "Dana is my life force.--Christopher Reeve A terrible thing happened. I wish it hadn't. But would I change who I married. . . . Never.--Dana Reeve He was a hero in every sense of the word--the chiseled-from-granite star of four blockbuster Superman films and the romantic classic Somewhere in Time who, after being paralyzed in a freak horseback riding accident, became a symbol of hope for millions. Dana Reeve was no less heroic, standing steadfastly by her husband's side until his surprisingly sudden and unexpected death at age fifty-two. When Dana, a non-smoker, passed away from lung cancer just seventeen months after Chris's death, she left behind their thirteen-year-old son, Will, to be raised by friends and family. Dana was only forty-four years old. That fate could have dealt such a cruel hand to this golden couple seemed unfathomable. That they could endure it all with grace, courage, and humor defied belief. Yet for all the millions of words that have been written about their public causes and private struggles following Chris's accident, little is known about the lives they led as passionate young lovers. Now, in the manner of his poignant-yet-stirring bestsellers Jack and Jackie, Jackie After Jack, An Affair to Remember, The Day Diana Died, After Diana, and The Day John Died, No. l New York Times bestselling author Christopher Andersen draws on those who knew them best to examine in touching detail the Reeves' unique partnership and the romance, faith, and fortitude that defined it. Sometimes heartbreaking, often uplifting, always compelling, Somewhere in Heaven is more than just a portrait of a marriage. It is the profoundly human story of two souls whose brief lives made a difference, a bittersweet saga of tragedy, triumph, and loss, and--above all else--a love story for the ages.", "genre": ["Biography", "Nonfiction", "Biography Memoir", "Tragedy", "Inspirational", "Romance", "Memoir"], "author": "Christopher Andersen", "rating": "4.09", "pages": "256"}, {"id": 2601049, "title": "アドルフに告ぐ 2", "blurb": "ドイツのヒットラー・ユーゲントに入れられたアドルフ・カウフマンは優秀な成績を修め、アドルフ・ヒットラーから表彰をうける。一方、ヒットラーに関する極秘文書はドイツから日本へ送られ、記者・峠草平の手に落ちるが……。", "genre": ["Manga", "Comics", "Graphic Novels", "Historical Fiction", "Fiction", "Japan", "Comics Manga"], "author": "Osamu Tezuka", "rating": "4.14", "pages": "256"}, {"id": 2601063, "title": "Budda", "blurb": "A story about a biography of Gautama Shiddhartha, the Buddha, who is a religious leader from India.", "genre": ["Sequential Art", "Manga", "Sequential Art", "Comics"], "author": "Osamu Tezuka", "rating": "3.97", "pages": "276"}, {"id": 2601218, "title": "Wanderer, kommst du nach Spa...", "blurb": "In seinem »Bekenntnis zur Trümmerliteratur« sagt Heinrich Böll, es sei Aufgabe des Schriftstellers, daran zu erinnern, »daß die Zerstörungen in unserer Welt nicht nur äußerer Art sind und nicht so geringfügiger Natur, daß man sich anmaßen kann, sie in wenigen Jahren zu heilen«. Für ihn war es eine Frage der Moral, Krieg und Nachkriegszeit so zu beschreiben wie sie wirklich\nIn seinem »Bekenntnis zur Trümmerliteratur« sagt Heinrich Böll, es sei Aufgabe des Schriftstellers, daran zu erinnern, »daß die Zerstörungen in unserer Welt nicht nur äußerer Art sind und nicht so geringfügiger Natur, daß man sich anmaßen kann, sie in wenigen Jahren zu heilen«. Für ihn war es eine Frage der Moral, Krieg und Nachkriegszeit so zu beschreiben wie sie wirklich waren. Seine frühen Erzählungen gehören zum Besten der deutschen Nachkriegsliteratur. Böll verliert sich nicht in vordergründigem Realismus. Sein Blick dringt in die Tiefen und erfaßt in wenigen, scheinbar nebensächlichen Details den Hintergrund jener Jahre, die heute mehr verdrängt als bewältigt sind. Er schrieb im Namen einer verführten und geschundenen Generation, im Namen der Humanität. So fand das Schicksal jener Jugend, die von der Schulbank in das Grauen des Krieges gestoßen wurde, in der unbestechlichen, prägnanten Darstellung der Titelgeschichte seinen gültigen Ausdruck.Inhalt:- Über die Brücke (1950)- Kumpel mit dem langen Haar (1947)- Der Mann mit den Messern (1948)- Steh auf, steh doch auf (1950)- Damals in Odessa (1950)- Wanderer, kommst du nach Spa... (1950- Trunk in Petöcki (1950)- Unsere gute, alte Renée (1950)- Auch Kinder sind Zivilisten (1950)- So ein Rummel (1950)- An der Brücke (1950)- Abschied (1950)- Die Botschaft (1947)- Aufenthalt in X (1950)- Wiedersehen mit Drüng (1950)- Die Essenholer (1950)- Wiedersehen in der Allee (1948)- In der Finsternis (1950)- Wir Besenbinder (1950)- Mein teures Bein (1950)- Lohengrins Tod (1950)- Geschäft ist Geschäft (1950)- An der Angel (1950)- Mein trauriges Gesicht (1950)- Kerzen für Maria (1950)\n...more", "genre": ["Short Stories", "European Literature", "German Literature", "Fiction", "Classics", "Cultural", "Germany", "War", "Literature", "20th Century", "Classics", "Modern Classics", "War", "World War II", "Academic", "School"], "author": "Heinrich Böll", "rating": "4.07", "pages": "160"}, {"id": 2601260, "title": "Huesos, Sangre y Otros Pedazos del Cuerpo / Blood, Bones and Body Bits", "blurb": "Te mueres de ganas de saber...?A dnde va lo que comes?Por qu los muertos necesitan un corte de pelo?Si crees que tu estmago puede soportar sta horrible ciencia, puedes empezar a leer lo que aparece en un cuerpo al abrirlo con un escalpelo. Pon a prueba las teorass sobre tu poder mental, descubre los secretos de cientficos extraordinarios y aprende a diagnosticar enfermedad\nTe mueres de ganas de saber...?A dnde va lo que comes?Por qu los muertos necesitan un corte de pelo?Si crees que tu estmago puede soportar sta horrible ciencia, puedes empezar a leer lo que aparece en un cuerpo al abrirlo con un escalpelo. Pon a prueba las teorass sobre tu poder mental, descubre los secretos de cientficos extraordinarios y aprende a diagnosticar enfermedades mortales.\n...more", "genre": ["Nonfiction", "Science", "Childrens", "Humor", "Humor", "Comedy", "Childrens", "Middle Grade", "Science", "Biology", "Anthologies", "Collections", "Literature", "20th Century", "Education"], "author": "Lectorum Publications", "rating": "4.05", "pages": null}, {"id": 2601351, "title": "Science Facts", "blurb": "These small but comprehensive pocket-sized books are packed with interesting facts, systematically organized for quick reference. Fully illustrated with color photos, drawings, and valuable reference sections with charts, graphs or maps.", "genre": ["Science", "Reference"], "author": "Steve Setford", "rating": "4.12", "pages": "160"}, {"id": 2601388, "title": "Omeros", "blurb": "Un extraordinario poema épico, en edición bilingüe y versión del poeta mexicano José Luis Rivas, de Derek Walcott, el premio Nobel que Joseph Brodsky considera «el mejor poeta en lengua inglesa». El libro comienza como la Ilíada, con la rivalidad por el amor de una mujer, pero la historia no tiene lugar en la Antigua Grecia, sino en una isla antillana, y la mujer no es una\nUn extraordinario poema épico, en edición bilingüe y versión del poeta mexicano José Luis Rivas, de Derek Walcott, el premio Nobel que Joseph Brodsky considera «el mejor poeta en lengua inglesa». El libro comienza como la Ilíada, con la rivalidad por el amor de una mujer, pero la historia no tiene lugar en la Antigua Grecia, sino en una isla antillana, y la mujer no es una princesa sino una criada de raza negra, deseada no por reyes sino por varios pescadores y por un antiguo oficial británico fascinado por la isla.No se trata ninguna princesa sino una negra criada antillana, y quienes luchan por ella son son reyes sino pescadores, pero el rostro de Helena es de aquellos en que los dioses consagran toda la belleza de una raza. Ella ama a Aquiles pero le deja por Héctor, y un día en que el pueblo se prepara para una fiesta, el amante desdeñado zarpa de Santa Lucía y en un sueño iniciático y un viaje a través de siglos, es devuelto a la tierra de sus antepasados, en la costa occidental de África. Y mientras Aquiles va tras sus raíces, otro personaje clave de la obra, Dennis Plunkett, el blanco, el colonizaor, el eterno marginal en un pueblo que ama, también cumple su personal odisea: tras sucumbir al encanto de Helena (en otro tiempo la isla se llamó como la muchacha), se convierte, por amor a ella, en un experto en la historia del lugar. así como en sus batallas.\n...more", "genre": ["Poetry", "Fiction", "Classics", "Literature", "Fantasy", "Mythology", "Nobel Prize", "Literature", "Post Colonial", "Epic", "Literature", "20th Century", "Academic", "School"], "author": "Derek Walcott", "rating": "4.00", "pages": "456"}, {"id": 2601579, "title": "Penggoda Misterius", "blurb": "Penampilan dapat menipu....Danielle terdampar di hutan tropis Quennsland. Suasana eksotis tempat itu tak terlalu diperhatikannya, sampai muncul seorang pria asing--tinggi, gelap, tampan dan... misterius.Flynn yang sangat seksi menggoda tidak hanya membangkitkan rasa ingin tahu jurnalistik Denielle. Nalurinya mengatakan pria itu punya kisah menarik; nalurinya juga mengataka\nPenampilan dapat menipu....Danielle terdampar di hutan tropis Quennsland. Suasana eksotis tempat itu tak terlalu diperhatikannya, sampai muncul seorang pria asing--tinggi, gelap, tampan dan... misterius.Flynn yang sangat seksi menggoda tidak hanya membangkitkan rasa ingin tahu jurnalistik Denielle. Nalurinya mengatakan pria itu punya kisah menarik; nalurinya juga mengatakan ia lelaki berbahaya... Masalahnya, semakin terlibat, Danielle semakin tak yakin ia hanya mengejar kisah pria itu. Mungkinkah ia telah jatuh cinta pada seorang lelaki yang bahkan tidak mau memberitahukan nama lengkapnya?Dapatkah Danielle mengungkap misteri sang laki-laki penggoda?\n...more", "genre": ["Category Romance", "Harlequin"], "author": "Elizabeth Oldfield", "rating": "3.14", "pages": "182"}, {"id": 2601582, "title": "Pernikahan Ganda", "blurb": "Kesulitan ganda!Dan Wisdom bertekad agar ayahnya Lawrence tidak lagi jatuh ke tangan seorang wanita pengejar harta. Memang, Leila Carlton dan cucunya Silvey kelihatannya bukan orang-orang yang gila harta, tapi siapa tahu....Sylvey Carlton tak senang neneknya menjadi Mrs. Lawrence Wisdom yang kelima. Tapi dia tahu cinta mereka adalah cinta sejati. Jadi jika Dan berteka berp\nKesulitan ganda!Dan Wisdom bertekad agar ayahnya Lawrence tidak lagi jatuh ke tangan seorang wanita pengejar harta. Memang, Leila Carlton dan cucunya Silvey kelihatannya bukan orang-orang yang gila harta, tapi siapa tahu....Sylvey Carlton tak senang neneknya menjadi Mrs. Lawrence Wisdom yang kelima. Tapi dia tahu cinta mereka adalah cinta sejati. Jadi jika Dan berteka berpikir buruk tentang dirinya--dan Leila, neneknya--Silvey hanya harus membuktikan bahwa Dan keliru...Leila dan Lawrence yakin akan dua hal: mereka pasti akan menikah dan akan menyadarkan Dan serta Silvey bahwa mereka juga berjodoh!\n...more", "genre": ["Category Romance", "Harlequin", "Romance", "Asian Literature", "Indonesian Literature"], "author": "Patricia Knoll", "rating": "2.55", "pages": "191"}, {"id": 2601658, "title": "Valeur Et Prix: Histoire D'un Debat", "blurb": "", "genre": ["Philosophy"], "author": "Gilles Dostaler", "rating": "0.00", "pages": null}, {"id": 2601770, "title": "The Amazon Experiment", "blurb": "When Max Remy's mother announces plans to marry creepy Aidan, Max needs to escape. Max then finds out about a time travel machine that gives her the power to change the past, but she doesn't count on Mr. Blue and her rival, Toby, being involved. Illustrations.", "genre": ["Childrens"], "author": "Deborah Abela", "rating": "4.01", "pages": "288"}, {"id": 2601796, "title": "As I Was Dying", "blurb": "Images of human suffering within areas of conflict, war and disaster. Leica European Publishers Award Winner.", "genre": ["Art", "Photography"], "author": "Paolo Pellegrin", "rating": "4.43", "pages": "140"}, {"id": 2601798, "title": "The Warden", "blurb": "When John Bold decides to challenge corruption in the Church of England he sets the whole town of Barchester by the ears with consequences both comic and sad. Trollope's first masterpiece is the study of conflicting loyalties and principles in a cathedral city where the gentle warden becomes an unwilling focus of national controversy. The resulting story is both a fine com\nWhen John Bold decides to challenge corruption in the Church of England he sets the whole town of Barchester by the ears with consequences both comic and sad. Trollope's first masterpiece is the study of conflicting loyalties and principles in a cathedral city where the gentle warden becomes an unwilling focus of national controversy. The resulting story is both a fine comedy of manners and a magnificent group portrait. THE WARDEN is the first novel of the Barsetshire series.\n...more", "genre": ["Classics", "Fiction", "Literature", "19th Century", "Historical", "Victorian", "Historical", "Historical Fiction", "Literature", "European Literature", "British Literature", "Audiobook", "Novels", "Classics", "Classic Literature"], "author": "Anthony Trollope", "rating": "3.74", "pages": "256"}, {"id": 2601802, "title": "The Complete Short Stories: Courtship and Marriage", "blurb": "En los cuentos reunidos en esta antología preparada por Marta Salís, recorremos medio mundo -de Saratoga Springs a Nueva Zelanda, de los Pirineos a Viena, pasando por pequeñas ciudades inglesas- para asistir a los desvelos, abnegaciones y ardides de unas jóvenes casaderas en general más preocupadas por su felicidad que por su respetabilidad, a pesar de que no todas dispong\nEn los cuentos reunidos en esta antología preparada por Marta Salís, recorremos medio mundo -de Saratoga Springs a Nueva Zelanda, de los Pirineos a Viena, pasando por pequeñas ciudades inglesas- para asistir a los desvelos, abnegaciones y ardides de unas jóvenes casaderas en general más preocupadas por su felicidad que por su respetabilidad, a pesar de que no todas dispongan de los medios para alcanzarla. Noviazgo y matrimonio cuenta historias de amores aplazados, de relaciones equívocas, de compromisos impuestos y de heroínas capaces de manipular a sus pretendientes o a sus padres con tal de vencer los prejuicios sociales o de defender su libertad de decisión. Constituyen, en conjunto, un espléndido ejemplo de la obra de Anthony Trollope, de la que dijo Nathaniel Hawthorne que «era tan real como si un gigante hubiera excavado un gran trozo de tierra y lo hubiera encerrado en una campana de cristal: allí sus habitantes seguirían con sus quehaceres cotidianos, sin sospechar que eran objeto de exhibición». El mismo Trollope afirmó que nunca había pretendido otra cosa más que ver «a los hombres y los mujeres andar por ese gran trozo de tierra como andan aquí entre nosotros», describiendo «los detalles más habituales de la vida corriente de la gente más común».\n...more", "genre": ["Classics"], "author": "Anthony Trollope", "rating": "3.75", "pages": "282"}, {"id": 2601807, "title": "Treatments: Language, Politics, and the Culture of Illness", "blurb": "Creative expression inspired by disease has been criticized as a celebration of victimhood, unmediated personal experience, or just simply bad art. Despite debate, however, memoirs written about illness—particularly AIDS or cancer—have proliferated since the late twentieth century and occupy a highly influential place on the cultural landscape today.In Treatments, Lisa Die\nCreative expression inspired by disease has been criticized as a celebration of victimhood, unmediated personal experience, or just simply bad art. Despite debate, however, memoirs written about illness—particularly AIDS or cancer—have proliferated since the late twentieth century and occupy a highly influential place on the cultural landscape today.In Treatments, Lisa Diedrich considers illness narratives, demonstrating that these texts not only recount and interpret symptoms but also describe illness as an event that reflects wider cultural contexts, including race, gender, class, and sexuality. Diedrich begins this theoretically rigorous analysis by offering examples of midcentury memoirs of tuberculosis. She then looks at Susan Sontag’s Illness As Metaphor, Audre Lorde’s The Cancer Journals, and Eve Kosofsky Sedgwick’s “White Glasses,” showing how these breast cancer survivors draw on feminist health practices of the 1970s and also anticipate the figure that would appear in the wake of the AIDS crisis in the 1980s—the “politicized patient.” She further reveals how narratives written by doctors Abraham Verghese and Rafael Campo about treating people with AIDS can disrupt the doctor–patient hierarchy, and she explores practices of witnessing that emerge in writing by Paul Monette and John Bayley.Through these records of intensely personal yet universal experience, Diedrich demonstrates how language both captures and fails to capture these “scenes of loss” and how illness narratives affect the literary, medical, and cultural contexts from which they arise. Finally, by examining the ways in which the sick speak and are spoken for, she argues for an ethics of failure—the revaluation of loss as creating new possibilities for how we live and die.Lisa Diedrich is assistant professor of women’s studies at Stony Brook University.\n...more", "genre": ["Health"], "author": "Lisa Diedrich", "rating": "4.00", "pages": "288"}, {"id": 2601984, "title": "The Way to Pentecost", "blurb": "Too often we fail claim the authority of the Holy Spirit in our lives. Chadwick--a man who lived what he preached--challenges us to dig deeper into our spiritual walks to discover the power of the Spirit. No other book I have ever read on the subject so clearly analyzes both our spiritual problems and God's wonderful promise concerning the supply of His Spirit. - Pastor Ji\nToo often we fail claim the authority of the Holy Spirit in our lives. Chadwick--a man who lived what he preached--challenges us to dig deeper into our spiritual walks to discover the power of the Spirit. No other book I have ever read on the subject so clearly analyzes both our spiritual problems and God's wonderful promise concerning the supply of His Spirit. - Pastor Jim Cymbala\n...more", "genre": ["Christian"], "author": "Samuel Chadwick", "rating": "4.32", "pages": "170"}, {"id": 2602026, "title": "Christ In All The Scriptures", "blurb": "If we want to learn about Jesus Christ our first port of call is usually the Gospels. Matthew, Mark, Luke and John tell us about Jesus' life on earth, but if we think that Christ can only be found in those four precious books then we are missing out on the big picture. As the title suggests this book shows that the message and life of Christ runs through every part of Scripture. In the Old Testament we have prophecies of his coming and parallels of his sacrificial life, in the New Testament we have the realisation of Christ as the Messiah and the impact that this is going to have on the individual believer and the entire World. In this classic book, we are shown the breadth of impact of the Christ. Every book of the Bible is touched on, and we are shown that the Bible stands as a whole, a planned, inspired and flawless whole with a constant thread of God's rescue plan for mankind, rather than a disparate mosaic of books on unconnected issues.", "genre": ["Theology"], "author": "A.M. Hodgkin", "rating": "4.28", "pages": "249"}, {"id": 2602103, "title": "Crossed Bones", "blurb": "In an expensive London restaurant Julia Lovat receives a gift that will change her life. It appears to be a book of exquisite 17th-century embroidery patterns but on closer examination Julia finds it also contains faint diary entries. In these, Cat Tregenna, an embroideress, tells how she and others were stolen out of a Cornish church in 1625 by Muslim pirates and taken on\nIn an expensive London restaurant Julia Lovat receives a gift that will change her life. It appears to be a book of exquisite 17th-century embroidery patterns but on closer examination Julia finds it also contains faint diary entries. In these, Cat Tregenna, an embroideress, tells how she and others were stolen out of a Cornish church in 1625 by Muslim pirates and taken on a brutal voyage to Morocco to be auctioned off as slaves.Captivated by this dramatic discovery, Julia sets off to North Africa to determine the authenticity of the book and to uncover more of Cat's story. There, in the company of a charismatic Moroccan guide, amid the sultry heat, the spice markets, and exotic ruins, Julia discovers buried secrets. And in Morocco, just as Cat did before her, she loses her heart.Almost 400 years apart, the stories of the two women converge in an extraordinary and haunting manner that will make readers wonder - is history fated to repeat itself?\n...more", "genre": ["Historical", "Historical Fiction", "Fiction", "Historical", "Mystery", "Romance", "Northern Africa", "Morocco", "Writing", "Books About Books", "Adventure", "Adventure", "Pirates", "European Literature", "British Literature"], "author": "Jane Johnson", "rating": "3.85", "pages": "375"}, {"id": 2602240, "title": "My Favorite Recipes", "blurb": "Customers can create their own treasured collection of recipes and keep family & friends near with our Apple Orchard Collection, created from original watercolors just for Gooseberry Patch. Our exclusive design will be the apple of your eye...perfect for any gift-giving occasion!Keep favorite recipes close at hand in our sturdy spiral-bound Recipe Keeper. Roomy double-side\nCustomers can create their own treasured collection of recipes and keep family & friends near with our Apple Orchard Collection, created from original watercolors just for Gooseberry Patch. Our exclusive design will be the apple of your eye...perfect for any gift-giving occasion!Keep favorite recipes close at hand in our sturdy spiral-bound Recipe Keeper. Roomy double-sided cards feature original watercolor illustrations.\n...more", "genre": ["Food and Drink", "Cooking"], "author": "Gooseberry Patch", "rating": "4.48", "pages": null}, {"id": 2602265, "title": "Simple Food for the Good Life: Random Acts of Cooking & Pithy Quotations", "blurb": "Fifty years before the phrase simple living became fashionable, Helen and Scott Nearing were living their celebrated Good Life on homesteads first in Vermont, then in Maine. All the way to their ninth decades, the Nearings grew their own food, built their own buildings, and fought an eloquent combat against the silliness of America's infatuation with consumer goods and ref\nFifty years before the phrase simple living became fashionable, Helen and Scott Nearing were living their celebrated Good Life on homesteads first in Vermont, then in Maine. All the way to their ninth decades, the Nearings grew their own food, built their own buildings, and fought an eloquent combat against the silliness of America's infatuation with consumer goods and refined foods. They also wrote or co-wrote more than thirty books, many of which are now being brought back into print by the Good Life Center and Chelsea Green.Simple Food for the Good Life is a jovial collection of quips, quotes, and one-of-a-kind recipes meant to amuse and intrigue all of those who find themselves in the kitchen, willingly or otherwise. Recipes such as Horse Chow, Scott's Emulsion, Crusty Carrot Croakers, Raw Beet Borscht, Creamy Blueberry Soup, and Super Salad for a Crowd should improve the mood as well as whet the appetite of any guest.Here is an antidote for the whole foods enthusiast who is fed up with the anxieties and drudgeries of preparing fancy meals with stylish, expensive, hard-to-find ingredients. This celebration of salads, leftovers, raw foods, and homegrown fruits and vegetables takes the straightest imaginable route from their stem or vine to your table.The funniest, crankiest, most ambivalent cookbook you'll ever read, said Food & Wine magazine. This is more than a mere cookbook, said Health Science magazine: It belongs to the category of classics, destined to be remembered through the ages.Among Helen Nearing's numerous books is Chelsea Green's Loving and Leaving the Good Life, a memoir of her fifty-year marriage to Scott Nearing and the story of Scott's deliberate death at the age of one hundred. Helen and Scott Nearing's final homestead in Harborside, Maine, has been established in perpetuity as an educational progam under the name of The Good Life Center.\n...more", "genre": ["Food and Drink", "Food", "Food and Drink", "Cookbooks", "Nonfiction", "Food and Drink", "Cooking"], "author": "Helen Nearing", "rating": "3.75", "pages": "309"}, {"id": 2602324, "title": "Martha Stewart's Quick Cook Menus", "blurb": "The follow-up to the popular Quick Cook features 230 new recipes and 52 seasonal menus by America's favorite hostess, plus gorgeous photography. 175 full-color photographs.", "genre": ["Cookbooks", "Cooking", "Reference", "Food", "Nonfiction"], "author": "Martha Stewart", "rating": "3.82", "pages": "224"}, {"id": 2602384, "title": "Bees in Amber - A Little Book of Thoughtful Verse", "blurb": "This vintage book contains John Oxenham s 1913 collection of poetry, Bees In Amber - A Little Book Of Thoughtful Verse. This fantastic collection is recommended for all lovers of poetry, and constitutes a veritable must-read for fans of Oxenham s beautiful work. The poems of this collection include: Credo, New Year s Day and Everyday, Philosopher s Garden, Flowers of the\nThis vintage book contains John Oxenham s 1913 collection of poetry, Bees In Amber - A Little Book Of Thoughtful Verse. This fantastic collection is recommended for all lovers of poetry, and constitutes a veritable must-read for fans of Oxenham s beautiful work. The poems of this collection include: Credo, New Year s Day and Everyday, Philosopher s Garden, Flowers of the Dust, The Pilgrim Way, Everymaid, Better and Best, The Shadow, The Potter, Nightfall, The Pruner, The Ways, Seeds, Whirring Wheels, The Bells of YS, The Little Poem of Life, and many more. William Arthur Dunkerley (1852 - 1941) was an English poet, novelist, and journalist. Many antiquarian texts such as this are increasingly hard to come by and expensive, and it is with this in mind that we are republishing this volume now in an affordable, modern, high-quality edition. It comes complete with a specially commissioned new biography of the author.\n...more", "genre": ["Poetry", "Christian"], "author": "John Oxenham", "rating": "3.81", "pages": "128"}, {"id": 2602657, "title": "Astrology for Initiates: Astrological Secrets of the Western Mystery Tradition", "blurb": "The French physician Papus (Gerard Encausee, 1865-1916) is best known to English speaking readers for his work The Tarot of the Bohemians. He lived during an exciting period when mystery traditions and esoteric research were at an all time high. Papus was in an ideal position to synthesize his influences into his astrological and esoteric work.His mentor was Francois Charles Berlet, the premier French astrologer. Papus was also influenced by Thomas Burgoyne, the author of Light of Egypt, the book that explained the principles of the practices of the Hermetic Brotherhood.", "genre": ["Astrology", "Reference", "Occult"], "author": "Papus", "rating": "3.94", "pages": "160"}, {"id": 2602822, "title": "If You Lived In Colonial Times", "blurb": "This book is a great resource book for teachers of K-2. From 3rd grade and up, the student can read this and use it for information on life in colonial times.", "genre": ["History", "American History", "Nonfiction", "Childrens", "Picture Books", "School", "Historical"], "author": "Ann McGovern", "rating": "3.91", "pages": "Paperback"}, {"id": 2602938, "title": "Holy Bible: NIV Leadership Study Bible - Spanish", "blurb": "The Leadership BibleContemporary principles of leadership from the Word of GodThe Leadership Bible offers 52 weeks of practical studies on contemporaryleadership issues that will help you experience a quantum leapin your leadership effectiveness. In just 15 minutes a day, you'll discoverhow to improve your personal development skills and relationshipsby following Biblical \nThe Leadership BibleContemporary principles of leadership from the Word of GodThe Leadership Bible offers 52 weeks of practical studies on contemporaryleadership issues that will help you experience a quantum leapin your leadership effectiveness. In just 15 minutes a day, you'll discoverhow to improve your personal development skills and relationshipsby following Biblical leadership principles. Each workweek, you'll cover a personal quality such as Courage, Humility, or Vision.\n...more", "genre": ["Religion", "Reference"], "author": "Anonymous", "rating": "4.57", "pages": "1792"}, {"id": 2602984, "title": "The Metamorphosis", "blurb": "Alternate cover edition of ISBN 0553213695 / 9780553213690As Gregor Samsa awoke one morning from uneasy dreams he found himself transformed in his bed into a gigantic insect. He was laying on his hard, as it were armor-plated, back and when he lifted his head a little he could see his domelike brown belly divided into stiff arched segments on top of which the bed quilt co\nAlternate cover edition of ISBN 0553213695 / 9780553213690As Gregor Samsa awoke one morning from uneasy dreams he found himself transformed in his bed into a gigantic insect. He was laying on his hard, as it were armor-plated, back and when he lifted his head a little he could see his domelike brown belly divided into stiff arched segments on top of which the bed quilt could hardly keep in position and was about to slide off completely. His numerous legs, which were pitifully thin compared to the rest of his bulk, waved helplessly before his eyes. With it's startling, bizarre, yet surprisingly funny first opening, Kafka begins his masterpiece, The Metamorphosis. It is the story of a young man who, transformed overnight into a giant beetle-like insect, becomes an object of disgrace to his family, an outsider in his own home, a quintessentially alienated man. A harrowing—though absurdly comic—meditation on human feelings of inadequacy, guilt, and isolation, The Metamorphosis has taken its place as one of the most widely read and influential works of twentieth-century fiction. As W.H. Auden wrote, Kafka is important to us because his predicament is the predicament of modern man.\n...more", "genre": ["Classics", "Fiction", "Fantasy", "Literature", "Philosophy", "Short Stories", "Academic", "School", "Horror", "European Literature", "German Literature", "Novels"], "author": "Franz Kafka", "rating": "3.84", "pages": "201"}, {"id": 2603200, "title": "Justin Morgan Had a Horse", "blurb": "Joel's face suddenly lit up as if he had thought of something for the first time. He spoke now to the horse, as though he were the one that mattered. Why, come to think of it, you're just like us, Bub. You're American! That's what you are. American!  In 1791 a Vermont schoolmaster by the name of Justin Morgan comes home with a two-year-old colt named Little Bub. Taken as payment for an outstanding debt, the little colt doesn't seem like he is worth much, but the kindly teacher asks one of his students, Joel Goss, to train him. Joel knows the horse has great potential, and soon word about Little Bub spreads throughout the entire Northeast for his ability to outwork, outrun, outtrot, and outwalk any horse in the area.  This is the extraordinary tale of a little workhorse, who, after being born in obscurity, becomes one of the greatest breeding stallions of all time. In this true story Newbery Medal-winning author Marguerite Henry and artist Wesley Dennis celebrate the life of the only horse ever to establish a breed all by himself -- the Morgan.", "genre": ["Horses", "Historical Fiction", "Childrens", "Fiction", "Animals", "Classics", "Young Adult"], "author": "Marguerite Henry", "rating": "4.04", "pages": "176"}, {"id": 2603209, "title": "S and M: Studies in Sadomasochism", "blurb": "The contributors to this newly revised classic emphasize the complexity and symbolic nature of this velvet underground of human sexuality.", "genre": ["Sexuality", "BDSM", "Nonfiction"], "author": "Thomas S. Weinberg", "rating": "3.57", "pages": "211"}, {"id": 2603255, "title": "Sexing the Brain", "blurb": "How much of sexual diversity is the result of nature versus nurture? Prevailing theories today lean heavily toward nature. Now a leading researcher in neuroscience and animal behavior shows how, in recent history, scientific claims about sex and gender differences have reflected the culture of the time. Although the conviction that genetics can explain everything is now wi\nHow much of sexual diversity is the result of nature versus nurture? Prevailing theories today lean heavily toward nature. Now a leading researcher in neuroscience and animal behavior shows how, in recent history, scientific claims about sex and gender differences have reflected the culture of the time. Although the conviction that genetics can explain everything is now widespread, the author demonstrates the interaction of culture and environment in the formation of behavioral traits and so provides an important corrective to popular notions of reductionism.Starting with a summary of sex and gender studies, Rogers explains the error of sex biasing, especially the once-assumed inferiority of women. She then addresses several modern studies and investigations, some of which assert that sex and gender differences are the product of genetic inheritance and hormones. Rogers uses laboratory evidence from studies of animals that help illustrate the biologically fluid properties of sex and gender.Sexing the Brain addresses a variety of topical questions: Are there sex differences in how we think and feel? Is language processed in different parts of the brain in men and women? Do social influences have a stronger influence on sexual behavior than sex hormone levels? Rogers concludes that our biology does not bind us to remain the same.... We have the ability to change, and the future of sex differences belongs to us.\n...more", "genre": ["Nonfiction", "Science", "Psychology", "Neuroscience", "Brain", "Science", "Biology", "Gender", "Gender Studies"], "author": "Leslie J. Rogers", "rating": "3.34", "pages": "136"}, {"id": 2603407, "title": "Siegfried Sassoon: The Making of a War Poet, a Biography", "blurb": "First published in 1999. Routledge is an imprint of Taylor & Francis, an informa company.", "genre": ["Biography", "World War I", "Poetry", "Nonfiction", "Biography Memoir", "War", "Literary Criticism"], "author": "Jean Moorcroft Wilson", "rating": "4.00", "pages": "608"}, {"id": 2603530, "title": "The Broken Shore", "blurb": "Broken by his last case, homicide detective Joe Cashin has fled the city and returned to his hometown to run its one-man police station while his wounds heal and the nightmares fade. But his peaceful existence is rudely interrupted by a brutal attack on Charles Bourgoyne, a prominent member of the local community.", "genre": ["Mystery", "Crime", "Mystery", "Fiction", "Cultural", "Australia", "Thriller", "Mystery", "Detective", "Thriller", "Mystery Thriller", "Book Club", "Audiobook", "Contemporary"], "author": "Peter Temple", "rating": "3.86", "pages": "345"}, {"id": 2603589, "title": "Poems of George Meredith", "blurb": "Originally published in 1902. Author: George Meredith Language: English Keywords: Literature / Poetry Many of the earliest books, particularly those dating back to the 1900s and before, are now extremely scarce and increasingly expensive. Obscure Press are republishing these classic works in affordable, high quality, modern editions, using the original text and artwork.", "genre": ["Poetry"], "author": "George Meredith", "rating": "3.89", "pages": "264"}, {"id": 2603609, "title": "Immaculate Deception", "blurb": "A powerful pro-life Senator is found dead in her nightgown. Looks like suicide but Fiona FitzGerald knows better. Things get more baffling when one shocking clue contradicts the whole case.", "genre": ["Mystery", "Fiction"], "author": "Warren Adler", "rating": "3.61", "pages": "272"}, {"id": 2603629, "title": "Winter in Taos", "blurb": "Winter in Taos starkly contrasts Luhan's memoirs, published in four volumes and inspired by Marcel Proust's Remembrances of Things Past. They follow her life through three failed marriages, numerous affairs, and ultimately a feeling of being nobody in myself, despite years of psychoanalysis and a luxurious lifestyle on two continents among the leading literary, art a\nWinter in Taos starkly contrasts Luhan's memoirs, published in four volumes and inspired by Marcel Proust's Remembrances of Things Past. They follow her life through three failed marriages, numerous affairs, and ultimately a feeling of being nobody in myself, despite years of psychoanalysis and a luxurious lifestyle on two continents among the leading literary, art and intellectual personalities of the day. Winter in Taos unfolds in an entirely different pattern, uncluttered with noteworthy names and ornate details. With no chapters dividing the narrative, Luhan describes her simple life in Taos, New Mexico, this new world she called it, from season to season, following a thread that spools out from her consciousness as if she's recording her thoughts in a journal. My pleasure is in being very still and sensing things, she writes, sharing that pleasure with the reader by describing the joys of adobe rooms warmed in winter by aromatic cedar fires; fragrant in spring with flowers; and scented with homegrown fruits and vegetables being preserved and pickled in summer. Having wandered the world, Luhan found her home at last in Taos. Winter in Taos celebrates the spiritual connection she established with the deep living earth as well as the bonds she forged with Tony Luhan, her mountain. This moving tribute to a land and the people who eked a life from it reminds readers that in northern New Mexico, where the seasons can be harshly beautiful, one can bathe in the sunshine until 'untied are the knots in the heart, ' for there is nothing like the sun for smoothing out all difficulties. Born in 1879 to a wealthy Buffalo family, Mabel Dodge Luhan earned fame for her friendships with American and European artists, writers and intellectuals and for her influential salons held in her Italian villa and Greenwich Village apartments. In 1917, weary of society and wary of a world steeped in war, she set down roots in remote Taos, New Mexico, then publicized the tiny town's inspirational beauty to the world, drawing a steady stream of significant guests to her adobe estate, including artist Georgia O'Keeffe, poet Robinson Jeffers, and authors D.H. Lawrence and Willa Cather. Luhan could be difficult, complex and often cruel, yet she was also generous and supportive, establishing a solid reputation as a patron of the arts and as an author of widely read autobiographies. She died in Taos in 1962.\n...more", "genre": ["Autobiography", "Memoir", "Westerns"], "author": "Mabel Dodge Luhan", "rating": "3.93", "pages": "292"}, {"id": 2603722, "title": "The Wonderful Wizard of Oz", "blurb": "Come along, Toto, she said. We will go to the Emerald City and ask the Great Oz how to get back to Kansas again. Swept away from her home in Kansas by a tornado, Dorothy and her dog Toto find themselves stranded in the fantastical Land of Oz. As instructed by the Good Witch of the North and the Munchkins, Dorothy sets off on the yellow brick road to try and find her way to the Emerald City and the Wizard of Oz, who can help her get home. With her companions the Scarecrow, the Tin Woodman and the Cowardly Lion, Dorothy experiences an adventure full of friendship, magic and danger. A much-loved children's classic, The Wizard of Oz continues to delight readers young and old with its enchanting tale of witches, flying monkeys and silver shoes.", "genre": ["Classics", "Fantasy", "Fiction", "Childrens", "Young Adult", "Adventure", "Middle Grade"], "author": "L. Frank Baum", "rating": "3.99", "pages": "154"}, {"id": 2603960, "title": "Pagans in the Promised Land: Decoding the Doctrine of Christian Discovery", "blurb": "Pagans in the Promised Land provides a unique, well-researched challenge to U.S. federal Indian law and policy. It attacks the presumption that American Indian nations are legitimately subject to the plenary power of the United States.", "genre": ["Nonfiction", "History"], "author": "Steven T. Newcomb", "rating": "3.91", "pages": "216"}, {"id": 2604047, "title": "The Turquoise Trail", "blurb": "Beautiful Diana Howard did not know why her iron-willed father refused to let her wed the dashing distant cousin she adored. Or why he demanded she be the bride of icy and calculating William Ryder. She only knew she had to escape this entanglement — even if it meant a marriage-in-name-only with the arrogantly attractive wagon master, Cord Montgomery, whom she detested for\nBeautiful Diana Howard did not know why her iron-willed father refused to let her wed the dashing distant cousin she adored. Or why he demanded she be the bride of icy and calculating William Ryder. She only knew she had to escape this entanglement — even if it meant a marriage-in-name-only with the arrogantly attractive wagon master, Cord Montgomery, whom she detested for the very desire he sparked within her. But now, in Cord's hands and at his mercy on a trek across the great Southwest, they came to the secret place south of the border where Diana found the truth...about her legacy of vast wealth and lethal lies...about the hunger that only a man she tried to resist could satisfy...and about the love that shed its disguise to engulf them both.\n...more", "genre": ["Westerns"], "author": "Susannah  Leigh", "rating": "3.25", "pages": "399"}, {"id": 2604068, "title": "Somebody Loves You, Mr. Hatch", "blurb": "One wintry day, a postman delivers a mysterious package with a big pink bow to a lonely man named Mr. Hatch. Somebody loves you the note says.Somebody loves me! Mr. Hatch sings as he dusts his living room. Somebody loves me! Mr. Hatch whistles as he does his errands in town. But who,  Mr. Hatch wonders, could that somebody be?After some time, Mr. Hatch discovers \nOne wintry day, a postman delivers a mysterious package with a big pink bow to a lonely man named Mr. Hatch. Somebody loves you the note says.Somebody loves me! Mr. Hatch sings as he dusts his living room. Somebody loves me! Mr. Hatch whistles as he does his errands in town. But who,  Mr. Hatch wonders, could that somebody be?After some time, Mr. Hatch discovers just who his secret admirer is and, in doing so, enjoys the biggest surprise of his life!\n...more", "genre": ["Childrens", "Picture Books", "Childrens", "Love", "Holiday", "Fiction", "Realistic Fiction", "Classics", "Childrens", "Storytime", "Romance", "Childrens", "2nd Grade"], "author": "Eileen Spinelli", "rating": "4.49", "pages": "32"}, {"id": 2604092, "title": "Google Apps Administrator Guide", "blurb": "With Google Apps, you and your colleagues or friends can check email, schedule meetings, chat in real time, collaborate on documents, and more. You can create your own personalized web and email addresses, and get loads of free storage. You can connect with others and access your documents 24/7, no matter where you are. Best of all, it's all hosted by Google--you get the s\nWith Google Apps, you and your colleagues or friends can check email, schedule meetings, chat in real time, collaborate on documents, and more. You can create your own personalized web and email addresses, and get loads of free storage. You can connect with others and access your documents 24/7, no matter where you are. Best of all, it's all hosted by Google--you get the same bandwidth, service, and machines that Google provides its staff and other online clients, and there's no hardware or software for you to install or maintain. Google Apps Administrator Guide is for aspiring and practicing webmasters or IT Professionals from any small business, university, college, eBay shop, charity organization, or any other kind of group that wants to work together. That means you can work with colleagues and friends in a single-sign-on web workspace. This book begins by explaining the often tricky and technical work of preparing your domain to work properly with Google Apps in friendly, layman's terms. That includes registering your domain, explaining zone files, transferring existing email accounts and web pages to your new domain and email system, and creating user accounts. Then it's time to start building your workspace by customizing how Google Apps interacts with your domain, and deciding which services you choose to provide for your users and employees, and/or friends and family. This book also discusses more advanced techniques for working online with Google Apps, including adding administrators, sharing calendars, editing web pages, and much more. Because Google Apps is always gaining new functionality, this book provides online updates and bonus chapters at http: //bolesbooks.com/thomson/. Those online updates contain any major changes to Google Apps and help make sure your Google Apps Administrator Guide will always be up-to-date. This is the only book you will ever need to master Google Apps\n...more", "genre": ["Reference"], "author": "David W. Boles", "rating": "2.25", "pages": "240"}, {"id": 2604119, "title": "The Old Stone House and Other Stories", "blurb": "I was riding along one autumn day through a certain wooded portion of New York State, when I came suddenly upon an old stone house in which the marks of age were in such startling contrast to its unfinished condition that I involun-tarily stopped my horse and took a long survey of the lonesome structure. Embowered in a forest which had so grown in thickness and height sinc\nI was riding along one autumn day through a certain wooded portion of New York State, when I came suddenly upon an old stone house in which the marks of age were in such startling contrast to its unfinished condition that I involun-tarily stopped my horse and took a long survey of the lonesome structure. Embowered in a forest which had so grown in thickness and height since the erection of this building that the boughs of some of the tallest trees almost met across its decayed roof, it presented even at first view an appearance of picturesque solitude almost approaching to desolation. But when my eye had time to note that the moss was clinging to eaves from under which the scaffolding had never been taken, and that of the ten large windows in the blackened front of the house only two had ever been furnished with frames, the awe of some tragic mystery began to creep over me, and I sat and wondered at the sight till my increasing interest compelled me to alight and take a nearer view of the place.\n...more", "genre": ["Mystery", "Short Stories"], "author": "Anna Katharine Green", "rating": "3.57", "pages": "144"}, {"id": 2604132, "title": "The Postnational Constellation: Political Essays", "blurb": "translated, edited, and with an introduction by Max Pensky Does a global economy render the traditional nation-state obsolete? Does globalization threaten democratic life, or offer it new forms of expression? What are the implications of globalization for our understanding of politics and of national and cultural identities? In The Postnational Constellation, Jurgen Habermas addresses these and other questions. He explores the historical and political origins of national identity, the achievements and catastrophes of the twentieth century, the future of democracy in the wake of the era of the nation-state, the political and moral challenges facing the European Union, and the status of global human rights in the ongoing debate on the sources of cultural identity. In their scope, critical insight, and clarity, the essays present a powerful vision of the contemporary political scene and the opportunities and challenges facing us. Those new to Habermas's work will find in this book a lucid and engaging introduction to one of the twentieth century's most influential thinkers. Those familiar with Habermas's writings will appreciate the application of his social and political theories to current political realities.", "genre": ["Philosophy", "Politics", "Sociology"], "author": "Jürgen Habermas", "rating": "3.76", "pages": "210"}, {"id": 2604272, "title": "Mémoires d'un chasseur de renards", "blurb": "'The essence of Memoirs of a Fox-Hunting Man is neither historical nor exotic; it is one of the most subtle and moving narratives of youth's education in life, of the gradual breakdown of an egocentric universe that is happy, innocent and hopeless.' Angus Wilson, The Observer.\n'The essence of Memoirs of a Fox-Hunting Man is neither historical nor exotic; it is one of the most subtle and moving narratives of youth's education in life, of the gradual breakdown of an egocentric universe that is happy, innocent and hopeless.' Angus Wilson, The Observer.\n...more", "genre": ["Fiction", "Historical", "Historical Fiction", "Classics", "War", "War", "World War I", "Literature", "20th Century", "European Literature", "British Literature", "Literature", "Poetry", "Biography Memoir"], "author": "Siegfried Sassoon", "rating": "3.91", "pages": "268"}, {"id": 2604373, "title": "Tess of the D’Urbervilles", "blurb": "Alternate cover edition of ISBN 9780141439594.When Tess Durbeyfield is driven by family poverty to claim kinship with the wealthy D'Urbervilles and seek a portion of their family fortune, meeting her 'cousin' Alec proves to be her downfall. A very different man, Angel Clare, seems to offer her love and salvation, but Tess must choose whether to reveal her past or remain silent in the hope of a peaceful future.", "genre": ["Classics", "Fiction", "Romance", "Literature", "Historical Fiction", "19th Century", "Victorian"], "author": "Thomas Hardy", "rating": "3.82", "pages": "518"}, {"id": 2604507, "title": "Remembering the Kanji 3: Writing and Reading Japanese Characters for Upper-Level Proficiency", "blurb": "Students who have learned to read and write the basic 2,000 characters run into the same difficulty that university students in Japan face. The government-approved list of basic educational kanji is not sufficient for advanced reading and writing. This book helps readers learn the writing and reading of these characters.", "genre": ["Japanese Literature", "Language", "Japan", "Reference", "Linguistics"], "author": "James W. Heisig", "rating": "4.33", "pages": "430"}, {"id": 2604528, "title": "The Ninth Dominion", "blurb": "DISAPPEARANCE. At a maximum-security prison for the criminally insane, eighty-four of the most dangerous psycopaths alive have vanished from their cells without a trace. Leading their ranks: the Candy Man -- the most ruthlessly brilliant serial killer ever in captivity.DETERMINATION. The only way to catch a crazed killer is to think like one. Rogue agent Jared Kimberlain -- the most dangerous man who ever worked for the forces of good -- is the only man driven enough to do the job. Or die trying.DEVASTATION. A shocking conspiracy is taking shape across the country, hatched by an unholy alliance of twisted, insane murderers. They plan to wipe out the entire population, and they possess the horrifying means to do it.THE NINTH DOMINION. It could be mankind's ultimate undoing. Jared Kimberlain is all that stands between humanity and a grave new world of disorder, damnation, and death. Time is short, and the fuse that will ignite a hell on earth is shorter . . . .", "genre": ["Thriller"], "author": "Jon Land", "rating": "4.20", "pages": "354"}, {"id": 2604555, "title": "Vanity Fair", "blurb": "A novel that chronicles the lives of two women who could not be more different: Becky Sharp, an orphan whose only resources are her vast ambitions, her native wit, and her loose morals; and her schoolmate Amelia Sedley, a typically naive Victorian heroine, the pampered daughter of a wealthy family.", "genre": ["Classics", "Fiction", "Historical Fiction", "Literature", "19th Century", "Romance", "British Literature"], "author": "William Makepeace Thackeray", "rating": "3.80", "pages": "867"}]