[{"id": 20001, "title": "Interfictions: An Anthology of Interstitial Writing", "blurb": "Nineteen writers dig into the imaginative spaces between conventional genres—realistic and fantastical, scholarly and poetic, personal and political—and bring up gems of new fiction: interstitial fiction.This is the literary mode of the new century, a reflection of the complex, ambiguous, and challenging world that we live in. These nineteen stories, by some of the most in\nNineteen writers dig into the imaginative spaces between conventional genres—realistic and fantastical, scholarly and poetic, personal and political—and bring up gems of new fiction: interstitial fiction.This is the literary mode of the new century, a reflection of the complex, ambiguous, and challenging world that we live in. These nineteen stories, by some of the most interesting and innovative writers working today, will change your mind about what stories can and should do as they explore the imaginative space between conventional genres. The editors garnered stories from new and established authors in the United States, Canada, Australia, and the United Kingdom, and also fiction translated from Spanish, Hungarian, and French. The collection features stories from Christopher Barzak, Colin Greenland, Holly Phillips, Rachel Pollack, Vandana Singh, Anna Tambour, Catherynne Valente, Leslie What, and others.\n...more", "genre": ["Short Stories", "Fantasy", "Fiction", "Anthologies", "Speculative Fiction", "Science Fiction", "Magical Realism", "Science Fiction Fantasy", "Short Stories", "Short Story Collection", "Weird Fiction", "New Weird"], "author": "Delia Sherman", "rating": "3.76", "pages": "291"}, {"id": 20002, "title": "The Fall of the Kings", "blurb": "This stunning follow-up to Ellen Kushner's cult-classic novel, Swordspoint, is set in the same world of labyrinthine intrigue, where sharp swords and even sharper wits rule. Against a rich tapestry of artists and aristocrats, students, strumpets, and spies, a gentleman and a scholar will find themselves playing out an ancient drama destined to explode their society's smug view of itself--and reveal that sometimes the best price of uncovering history is being forced to repeat it.... The Fall of the Kings Generations ago the last king fell, taking with him the final truths about a race of wizards who ruled at his side. But the blood of the kings runs deep in the land and its people, waiting for the coming together of two unusual men. Theron Campion, a young nobleman of royal lineage, is heir to an ancient house and a modern scandal. Tormented by his twin duties to his family and his own bright spirit, he seeks solace in the University. There he meets Basil St. Cloud, a brilliant and charismatic teacher ruled by a passion for knowledge--and a passion for the ancient kings. Of course, everyone now knows that the wizards were charlatans and the kings their dupes and puppets. Only Basil is not convinced--nor is he convinced that the city has seen its last king... From the Trade Paperback edition", "genre": ["Fantasy", "Fiction", "M M Romance", "Queer", "Gay", "LGBT", "Science Fiction Fantasy"], "author": "Ellen Kushner", "rating": "3.66", "pages": "510"}, {"id": 20009, "title": "Growing Up Untouchable in India: A Dalit Autobiography", "blurb": "There is much in Vasant Moon's extraordinary story of his vasti, his childhood neighbourhood in India, that would probably be true of any urban ghetto anywhere in the world. But there is much that is peculiarly and vividly Indian. In this first autobiography of a so-called Untouchable, we learn about the inescapable hierarchy imposed by caste, based on ancient principles o\nThere is much in Vasant Moon's extraordinary story of his vasti, his childhood neighbourhood in India, that would probably be true of any urban ghetto anywhere in the world. But there is much that is peculiarly and vividly Indian. In this first autobiography of a so-called Untouchable, we learn about the inescapable hierarchy imposed by caste, based on ancient principles of heriditary pollution. We see the unmatched importance of the heroic Dr. B. R. Ambedkar for India's awakened and newly ambitious Dalits. We feel, viscerally, Nagpur's heat and the joy brought by the monsoon. Vasant Moon's Vasti, the first Dalit autobiography to be published in English, is a moving and eloquent testament to a uniquely Indian life as well as to the universal human spirit.\n...more", "genre": ["Cultural", "India", "Politics", "Autobiography", "Memoir", "History", "Biography", "Biography Memoir", "Nonfiction"], "author": "Vasant Moon", "rating": "3.83", "pages": "224"}, {"id": 20017, "title": "The Bill Slider Omnibus", "blurb": "ORCHESTRATED DEATHMiddle-class, middle-aged and, according to his partner, menopausal, Detective Inspector Bill Slider is never going to make it to the Yard. Passed over for promotion again, the last thing he needs in his life, or on his patch, is an unidentifiable, naked female corpse.A priceless Stradivarius and a giant tin of olive oil are the only clues in an investigation that takes the steely-eyed, furry-headed detective all the way from the exotic backstreets of Shepherd's Bush to far-flung Birmingham.DEATH WATCHWhen a noted womaniser dies in mysterious circumstances in a sleazy motel and the whole of his murky past comes to light, DI Bill Slider begins to question more than whether the game is worth the candle. Right is right, and indivisible. As soon as he's solved the motel mystery, and found out what the Neary boys and Gorgeous George are up to, Slider's going to have to start putting his own house in orders ...NECROCHIPDetective Superintendent 'George' Dickson's replacement by DS 'Mad Ivan' Barrington - a new broom determined to sweep clean - is all par for the course for DI Bill Slider, as he faces the unhygienic fact of a dismembered corpse in a catering establishment.But there are still niggling questions to distract him: why didn't Barrington like Dickson? What is the mystery of the stake-out they once did together? And why is Slider's home life in almost perpetual stride?", "genre": ["Mystery"], "author": "Cynthia Harrod-Eagles", "rating": "4.24", "pages": "848"}, {"id": 20018, "title": "Dear Departed", "blurb": "Chattie Cornfeld was murdered while jogging in the park. She ran her own small marketing company and lived comfortably, perhaps too comfortably for her income. At first it looked as though she was the latest victim of the Park Killer, but it doesn't take Slider and Atherton long to establish that someone was trying to pass the killing off as part of a pattern—only the pattern doesn't fit, this one was personal. Chattie was popular with all who crossed her path, and it was difficult to imagine she had gained any enemies. Turning to the two most popular motives for murder—money and passion—Slider and his team's investigation turn up some puzzling anomalies in her life, not least the number of men who counted themselves as her lover and the tangled relationships of her family. But none of the suspects can be made to fit what evidence they have, unless of course they've been mis-reading the evidence.", "genre": ["Mystery", "Crime", "Fiction", "Mystery Thriller", "Historical Fiction"], "author": "Cynthia Harrod-Eagles", "rating": "3.98", "pages": "352"}, {"id": 20019, "title": "Killing Time", "blurb": "Detective Inspector Bill Slider is back at his post at London's Shepherd's Bush police station--accompanied by a persistent headache, resulting from a recent case that also left his steadfast colleague Atherton hospitalized. And the throbbing pain is compounded by his ex-wife's efforts to seek a reconciliation that doesn't happen to sit well with Joanna, his lover. But his\nDetective Inspector Bill Slider is back at his post at London's Shepherd's Bush police station--accompanied by a persistent headache, resulting from a recent case that also left his steadfast colleague Atherton hospitalized. And the throbbing pain is compounded by his ex-wife's efforts to seek a reconciliation that doesn't happen to sit well with Joanna, his lover. But his domestic problems are swiftly put on hold when duty calls.After receiving a series of threatening correspondence, a gender-bending, erotic male dancer had pleaded with Slider for help. But the wily policeman doesn't respond until it's too late--and the dancer has been murdered. Probing the victim's sordid career, Slider plunges into a world of seedy nightclubs to interrogate table-dancers, prostitutes, pimps, and cabinet ministers with some very peculiar peccadilloes. When the vicious attack of a popular constable links itself to the dancer's murder, Slider delves even deeper to find the connection between the two incidents. As the pressure mounts, he must work his trusted gray matter to the quick if he wants to prevent a savage murderer from killing again.\n...more", "genre": ["Mystery", "Fiction", "Mystery", "Crime", "European Literature", "British Literature", "Suspense", "Thriller", "Mystery Thriller", "Mystery", "Detective"], "author": "Cynthia Harrod-Eagles", "rating": "4.03", "pages": "280"}, {"id": 20020, "title": "Death Watch", "blurb": "Publishers Weekly hailed the first book in this series, Orchestrated Death, with a starred review at publication, giving special praise to the book's sophisticated ending and strong players. Now, in Death Watch, London policeman Bill Slider returns in a case of arson--and murder.\nPublishers Weekly hailed the first book in this series, Orchestrated Death, with a starred review at publication, giving special praise to the book's sophisticated ending and strong players. Now, in Death Watch, London policeman Bill Slider returns in a case of arson--and murder.\n...more", "genre": ["Mystery", "Mystery", "Crime", "Fiction", "European Literature", "British Literature", "Thriller", "Mystery Thriller"], "author": "Cynthia Harrod-Eagles", "rating": "3.88", "pages": "280"}, {"id": 20021, "title": "The Tangled Thread", "blurb": "1788 - The French Revolution; beginning of Industrial RevolutionIn France, as the revolution begins, Henri, the bastard offshoot of the Morland family, strives to protect his family. He binds his daughter Heloise in loveless marriage to a Revolutionary, and allies himself with the vigorous Danton. But in the bloodbath of the Terror and the fall of Danton, Henri goes to the\n1788 - The French Revolution; beginning of Industrial RevolutionIn France, as the revolution begins, Henri, the bastard offshoot of the Morland family, strives to protect his family. He binds his daughter Heloise in loveless marriage to a Revolutionary, and allies himself with the vigorous Danton. But in the bloodbath of the Terror and the fall of Danton, Henri goes to the guillotine and Heloise flees to England where she is welcomed warmly by the Morland family. In Yorkshire Jemima's troublesome brood cause her anxiety - especially her youngest, Lucy, who disguises herself as a boy and runs away to sea - but at last she sees three of her children marry and the hope of an heir to Morland Place.\n...more", "genre": ["Historical", "Historical Fiction", "Historical", "Fiction", "Romance", "Romance", "Historical Romance", "Cultural", "France"], "author": "Cynthia Harrod-Eagles", "rating": "4.33", "pages": "474"}, {"id": 20022, "title": "The Flood-Tide", "blurb": "1772 - George III; the American War of IndependenceEngland is peaceful under George III, and Morland Place flourishes under the careful tending of Jemima and her loyal husband Allen. Their seven children often bring them heartache, but they are sustained by their love for each other and their absorbing interest in improving the estate lands. But beyond England's shores thi\n1772 - George III; the American War of IndependenceEngland is peaceful under George III, and Morland Place flourishes under the careful tending of Jemima and her loyal husband Allen. Their seven children often bring them heartache, but they are sustained by their love for each other and their absorbing interest in improving the estate lands. But beyond England's shores things are not so calm. Morland cousins find themselves embroiled in the American war for independence, and the family's bastard offshoot, Henri, disports himself in the salons of Paris while outside revolution creeps closer.\n...more", "genre": ["Historical", "Historical Fiction", "Historical", "Fiction", "Romance", "Historical Romance", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.25", "pages": "428"}, {"id": 20023, "title": "The White Road", "blurb": "August 1914The whole country is thrilled by the declaration of war. The British Expeditionary Force goes off to France to defend gallant little Belgium, and thousands more young men rush to volunteer, hoping to see action before the war ends at Christmas. At home everyone competes to be doing the most for the war effort. The Morlands have their share of volunteers, and no-one can say they aren't at the very heart of things. But when Christmas comes the war is far from over, and nine in ten of the men who marched, singing, down the white road to Mons have fallen.", "genre": ["Historical Fiction", "Historical", "Fiction", "World War I", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.31", "pages": "480"}, {"id": 20024, "title": "The Maiden", "blurb": "1720: political intrigue besets the kingdom as the Stuarts try to claim the throne occupied by the Hanoverians and the Morlands have to use all their wiles to keep their fortunes intact. Jeremy Morland, sole heir to his father's will, has no option but to marry to cold-hearted Lady Mary to secure Hanoverian protection and safeguard his inheritance. Then the rebellion of '45 and the bloody massacre at Culloden thrust his daughter Jemima into the spotlight as the saviour of the family. Independent, single-minded, and a rare beauty, Jemima is a capable caretaker of the Morland heritage. Although Morland Place and its lands suffer from the excesses of her dissolute husband, Jemima's quiet courage earns her an abiding love and loyalty.", "genre": ["Historical Fiction", "Historical", "Fiction", "Romance", "Historical Romance", "British Literature"], "author": "Cynthia Harrod-Eagles", "rating": "4.29", "pages": "413"}, {"id": 20025, "title": "The Oak Apple", "blurb": "1630 - Charles I; the Civil WarWhen civil war destroys the long years of peace in England, the clash between King and Parliament is echoed at Morland Place. Richard, the heir, brings home a Puritan bride, while his dashing brother Kit joins the Royalist cavalry under Prince Rupert, leaving their father, Edmund, desperately trying to steer a middle course. As the war grinds on, bitterness replaces early fervour and divisions grow deeper, and through it all Edmund struggles grimly to protect his inheritance and keep Morland Place intact.", "genre": ["Historical Fiction", "Historical", "Fiction", "British Literature", "Romance", "17th Century", "Historical Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.21", "pages": "403"}, {"id": 20026, "title": "The Emperor", "blurb": "1795 - NapoleonThe shadow of Napoleon is falling across Europe, and a restlessness seems to be changing mores and loosening society's restraints. At Morland Place James's marriage to Mary Ann is falling apart; Lucy's to Chetwyn is in the balance as she embarks on a blatant affair with a sea officer; and William supports a mistress he cannot marry. Mary goes to sea with her husband Captain Haworth and is caught up in the battle of the Nile; and as war becomes inevitable, Lucy knows she must say goodbye to her love as every fighting captain waits eagerly for his commission.", "genre": ["Historical Fiction", "Historical", "Fiction", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.30", "pages": "512"}, {"id": 20046, "title": "Show Me God: What the Message from Space Is Telling Us About God (Wonders That Witness/Fred Heeren, Vol 1)", "blurb": "In exclusive interviews, Stephen Hawking, NASA leaders, and Nobel prize-winning astronomers talk about how their discoveries have affected life's big questions. Topics include the creation and fine-tuning of the universe, the purpose of life, and the nature of God. The humor and multimedia format make this title make it especially appealing. 98 photos.\nIn exclusive interviews, Stephen Hawking, NASA leaders, and Nobel prize-winning astronomers talk about how their discoveries have affected life's big questions. Topics include the creation and fine-tuning of the universe, the purpose of life, and the nature of God. The humor and multimedia format make this title make it especially appealing. 98 photos.\n...more", "genre": ["Science", "Nonfiction", "Religion", "Religion", "Christianity", "Spirituality", "Religion", "Faith", "Religion", "Theology"], "author": "Fred Heeren", "rating": "4.00", "pages": "397"}, {"id": 20048, "title": "An Argument for Mind", "blurb": "In this elegantly written book, Jerome Kagan melds the history of the field of psychology during the past 50 years with the story of his own research efforts of the same period and an analysis of what he terms “the currently rocky romance between psychology and biology.” As Kagan unwinds his own history, he reveals the seminal events that have shaped his career and discusses how his assumptions have changed. With full appreciation for the contributions to psychology of history, philosophy, literature, and neuroscience, he approaches a wide range of fascinating topics, including:·   the abandonment of orthodox forms of behaviorism and psychoanalysis·   the forces that inspired later-twentieth-century curiosity about young children·   why B. F. Skinner chose to study psychology·   why the study of science less often ignites imaginations today·   our society’s obsession with erotic love·   the resurgence of religious fanaticism and the religious RightEmbedded in Kagan’s discussions is a rejection of the current notion that a mature neuroscience will eventually replace psychology. He argues that a complete understanding of brain is not synonymous with a full explanation of mind, and he concludes with a brief prediction of the next five decades in the field of psychology.", "genre": ["Psychology"], "author": "Jerome Kagan", "rating": "4.11", "pages": "304"}, {"id": 20051, "title": "The Nature of the Child", "blurb": "The world-famous Harvard psychologist challenges many of psychology's most deeply held assumptions about human development—arguing, for example, that early experience does not inexorably shape our lives and that the influence of the family is more subtle than has been supposed.\nThe world-famous Harvard psychologist challenges many of psychology's most deeply held assumptions about human development—arguing, for example, that early experience does not inexorably shape our lives and that the influence of the family is more subtle than has been supposed.\n...more", "genre": ["Psychology", "Childrens"], "author": "Jerome Kagan", "rating": "3.46", "pages": "352"}, {"id": 20052, "title": "Unstable Ideas: Temperament, Cognition, and Self", "blurb": "In his most probing and expansive work to date, Jerome Kagan--one of this country's leading psychologists--demonstrates that innovative research methods in the behavioral sciences and neurobiology, together with a renewed philosophical commitment to rigorous empiricism, are transforming our understanding of human behavior. Contemporary psychology, according to Kagan, has been preoccupied with three central themes: How malleable is temperament? How predictable are the milestones of cognitive development? How accurate is consciousness as a window onto the self, its motives, beliefs, and emotions?In a review of past approaches to these questions, Kagan argues persuasively that behavioral scientists have reached less-than-satisfactory answers because they have failed to appreciate the biases inherent in their frame of reference and the limitations of their investigative procedures. He calls into question a number of techniques that have been mainstays of psychological investigation: the Ainsworth Strange Situation for assessing the emotional attachment of an infant to its mother, and interviews and questionnaires as indexes of personality, to name only two. Kagan's own research has used novel laboratory situations to discover a group of children who exhibit a pattern of behavior he calls temperamentally inhibited--they are restless and irritable from birth, and by twenty-four months cling to the mother and show biological signs of high anxiety in unfamiliar situations.These findings, coupled with current understanding of the structure and chemistry of the nervous system, lead him to speculate that these children are born with a biological predisposition that favors the development of a shy, fearful personality. Through longitudinal studies of this kind, as well as through his cross-cultural investigations of cognitive development, Kagan has infused new meaning into the nature-nurture debate.", "genre": ["Psychology"], "author": "Jerome Kagan", "rating": "4.00", "pages": "328"}, {"id": 20055, "title": "Crazy Woman", "blurb": "Sane and shrewd and funny...The story of a woman whose captivity is divided equally between her life with her own people and her life among the Indians.LILLIAN SCHISSELAuthor of WOMEN'S DIARIES OF THE WESTWARD JOURNEYSara Franklin is an outcast among her own white people. Her thirst for knowledge and spirituality is threatening to both her abusive father and her neurotic husband. When she is captured by the Apaches in New Mexico, they dub her Crazy Woman, and treat her like a slave. Yet, as she begins to learn the ways of her captors, she earns their respect as a strong, clever, even magical, woman. And when her innate sensual hunger is tempted, challenged, and finally satisfied by an Apache warrior, Sara finally embraces her whole self at last, body and soul....", "genre": ["Historical Fiction"], "author": "Kate Horsley", "rating": "3.44", "pages": "280"}, {"id": 20061, "title": "Three Weeks to eBay Profits: Go from Beginner to Successful Seller in Less than a Month", "blurb": "Over one million people list an item for sale on eBay every day—and 600,000 of these are professional full-time sellers. Now anyone with ambition and a dream can realize financial success on eBay. Whether readers are looking to be their own boss or launch a part-time business, eBay guru Skip McGrath walks them through a series of easy steps designed to generate income in less than a month. This practical guide reveals how to find products to sell, successfully compete in the crowded eBay marketplace, and optimize and grow one’s business. Three Weeks to eBay Profits offers instant answers to anyone who dreams of running this or her own business and realizing financial freedom. Skip McGrath is currently a Gold Level Power Seller on eBay. He has written seven books on eBay selling, including The eBay Power Seller’s Manual and The Complete eBay Marketing System. His Web site, www.auction-sellers-resource.com, is one of the most visited eBay-related sites on the Net.", "genre": ["Business"], "author": "Skip McGrath", "rating": "3.56", "pages": "320"}, {"id": 20140, "title": "Bridge to Terabithia: L-I-T Guide", "blurb": "An excellent teaching aid that integrates the reading of outstanding works of children's literature with important reading comprehension, speaking, writing, and listening skills. It includes learning experiences that provide opportunities for group dynamics as well as activities to challenge students' abilities in critical and creative thinking. Includes: story summary, ab\nAn excellent teaching aid that integrates the reading of outstanding works of children's literature with important reading comprehension, speaking, writing, and listening skills. It includes learning experiences that provide opportunities for group dynamics as well as activities to challenge students' abilities in critical and creative thinking. Includes: story summary, about the author, preparing to read, cooperative-learning activities, vocabulary skills, chapter-by-chapter critical thinking questions, spotlight literary skills, creative thinking activities, glossary of literary terms, and post-reading activities.\n...more", "genre": ["Young Adult", "Classics"], "author": "Charlotte S. Jaffe", "rating": "3.94", "pages": "40"}, {"id": 20161, "title": "Long Shadow of Little Rock (C)", "blurb": "This is a classic account of the Little Rock School Crisis, with a new afterword by Clayborne Carson.At an event honoring Daisy Bates as 1990's Distinguished Citizen then-governor Bill Clinton called her the most distinguished Arkansas citizen of all time. Her classic account of the 1957 Little Rock School Crisis, The Long Shadow of Little Rock, couldn't be found on most\nThis is a classic account of the Little Rock School Crisis, with a new afterword by Clayborne Carson.At an event honoring Daisy Bates as 1990's Distinguished Citizen then-governor Bill Clinton called her the most distinguished Arkansas citizen of all time. Her classic account of the 1957 Little Rock School Crisis, The Long Shadow of Little Rock, couldn't be found on most bookstore shelves in 1962 and was banned throughout the South. In 1988, after the University of Arkansas Press reprinted it, it won an American Book Award.On September 3, 1957, Gov. Orval Faubus called out the National Guard to surround all-white Central High School and prevent the entry of nine black students, challenging the Supreme Court's 1954 order to integrate all public schools. On September 25, Daisy Bates, an official of the NAACP in Arkansas, led the nine children into the school with the help of federal troops sent by President Eisenhower-the first time in eighty-one years that a president had dispatched troops to the South to protect the constitutional rights of black Americans. This new edition of Bates's own story about these historic events is being issued to coincide with the fiftieth anniversary of the Little Rock School crisis in 2007.\n...more", "genre": ["History", "Nonfiction", "Biography", "Cultural", "African American", "Race", "Autobiography", "Memoir", "North American Hi...", "American History", "Academic", "School", "Womens", "Politics"], "author": "Daisy Bates", "rating": "4.20", "pages": "234"}, {"id": 20190, "title": "Science Rules: A Historical Introduction to Scientific Methods", "blurb": "Is there a universal set of rules for discovering and testing scientific hypotheses? Since the birth of modern science, philosophers, scientists, and other thinkers have wrestled with this fundamental question of scientific practice. Efforts to devise rigorous methods for obtaining scientific knowledge include the twenty-one rules Descartes proposed in his Rules for the Direction of the Mind and the four rules of reasoning that begin the third book of Newton's Principia, and continue today in debates over the very possibility of such rules. Bringing together key primary sources spanning almost four centuries, Science Rules introduces readers to scientific methods that have played a prominent role in the history of scientific practice.Editor Peter Achinstein includes works by scientists and philosophers of science to offer a new perspective on the nature of scientific reasoning. For each of the methods discussed, he presents the original formulation of the method; selections written by a proponent of the method together with an application to a particular scientific example; and a critical analysis of the method that draws on historical and contemporary sources.The methods included in this volume are Cartesian rationalism with an application to Descartes' laws of motion; Newton's inductivism and the law of gravity; two versions of hypothetico-deductivism—those of William Whewell and Karl Popper—and the nineteenth-century wave theory of light; Paul Feyerabend's principle of proliferation and Thomas Kuhn's views on scientific values, both of which deny that there are universal rules of method, with an application to Galileo's tower argument. Included also is a famous nineteenth-century debate about scientific reasoning between the hypothetico-deductivist William Whewell and the inductivist John Stuart Mill; and an account of the realism-antirealism dispute about unobservables in science, with a consideration of Perrin's argument for the existence of molecules in the early twentieth century.", "genre": ["Science", "Philosophy"], "author": "Peter Achinstein", "rating": "4.00", "pages": "440"}, {"id": 20241, "title": "Bill Bryson's African Diary", "blurb": "Bill Bryson goes to Kenya at the invitation of CARE International, the charity dedicated to working with local communities to eradicate poverty around the world. Kenya, generally regarded as the cradle of mankind, is a land of contrasts, with famous game reserves, stunning landscapes, and a vibrant cultural tradition. It also provides plenty to worry a traveller like Bill \nBill Bryson goes to Kenya at the invitation of CARE International, the charity dedicated to working with local communities to eradicate poverty around the world. Kenya, generally regarded as the cradle of mankind, is a land of contrasts, with famous game reserves, stunning landscapes, and a vibrant cultural tradition. It also provides plenty to worry a traveller like Bill Bryson, fixated as he is on the dangers posed by snakes, insects and large predators. But on a more sober note, it is a country that shares many serious human and environmental problems with the rest of Africa: refugees, AIDS, drought and grinding poverty. Travelling around the country, Bryson casts his inimitable eye on a continent new to him, and the resultant diary, though short in length, contains the trademark Bryson stamp of wry observation and curious insight. All the author's royalties from Bill Bryson's African Diary, as well as all profits, will go to CARE International.\n...more", "genre": ["Travel", "Nonfiction", "Cultural", "Africa", "Autobiography", "Memoir", "Humor", "Eastern Africa", "Kenya", "Biography", "Adventure", "Travel", "Travelogue", "History"], "author": "Bill Bryson", "rating": "3.47", "pages": "63"}, {"id": 20268, "title": "Griefwork", "blurb": "In a European city just after World War II, the odd curator of a greenhouse garden welcomes guests to savor his tropical plants, which open only at night. In his care, the exotic species have survived the war, and now he struggles to keep the greenhouse's boilers going in the fuel-starved privation of postwar Europe. Threats to their survival abound: the tempting offers of a foreign princess, his employers' plans to sell the botanical garden, and his own failing body and mind - which is racked by fantasies in which the plants talk to him. Griefwork is a fictional evocation of a lost world and of lost love, and a fable about the ways we impose order on the world so as to forestall such losses.", "genre": ["Fiction"], "author": "James Hamilton-Paterson", "rating": "4.06", "pages": "250"}, {"id": 20283, "title": "Garden Birds: Get to Know the Natural World", "blurb": "An invaluable pocket-sized guide to the 100 most popular species of bird that you are most likely to find in your town, garden or park. Birdwatching is becoming very popular - over 300,000 surveys were submitted for the 2003 Big Garden Birdwatch with the RSPB. This completely new title in the Collins Wild Guide series incorporates both practical information on each species\nAn invaluable pocket-sized guide to the 100 most popular species of bird that you are most likely to find in your town, garden or park. Birdwatching is becoming very popular - over 300,000 surveys were submitted for the 2003 Big Garden Birdwatch with the RSPB. This completely new title in the Collins Wild Guide series incorporates both practical information on each species and expert advice on how to encourage them into your garden. Each two-page spread is devoted to a different species and illustrated with a colour photograph to aid identification. Compact and easy-to-use, Wild Guide Garden Birds is the perfect introduction to this increasingly popular subject.\n...more", "genre": ["Reference", "Nonfiction"], "author": "Stephen  Moss", "rating": "3.90", "pages": "256"}, {"id": 20296, "title": "Kavik the Wolf Dog", "blurb": "For use in schools and libraries only. A wolf-dog instinctively travels 2,000 miles from Washington to Alaska to return to the boy who once saved his life.", "genre": ["Animals", "Fiction", "Young Adult", "Adventure", "Childrens", "Dogs", "Historical Fiction"], "author": "Walt Morey", "rating": "4.14", "pages": "192"}, {"id": 20297, "title": "The Go-Getter: A Story That Tells You How To Be One", "blurb": "The classic motivational parable (over 500,000 copies sold worldwide) that shows you how to make your own opportunities in life, updated for the modern reader by bestselling business author Alan Axelrod Ever since its first printing by William Randolph Hearst in 1921, The Go-Getter has inspired employees and entrepreneurs to take initiative, increase their productivity, an\nThe classic motivational parable (over 500,000 copies sold worldwide) that shows you how to make your own opportunities in life, updated for the modern reader by bestselling business author Alan Axelrod Ever since its first printing by William Randolph Hearst in 1921, The Go-Getter has inspired employees and entrepreneurs to take initiative, increase their productivity, and excel against the odds. Now, more than half a million copies later, Alan Axelrod, bestselling author of Patton on Leadership and Elizabeth I, CEO, updates the tale to address today's most pressing work issues.In The Go-Getter, Bill Peck, a war veteran, persuades Cappy Ricks, the influential founder of the Rick's Logging & Lumbering Company, to let him prove himself by selling skunk wood in odd lengths-a job that everyone knows can only lead to failure. When Peck goes on to beat his quota, Rick hands Peck the ultimate opportunity and the ultimate test: the quest for an elusive blue vase. Drawing on such classic values as honesty, determination, passion, and responsibility, Peck overcomes nearly insurmountable obstacles to find the vase and launch hia career as a successful manager.In a time when jobs are tight and managers are too busy for mentoring, how can you maintain positive energy, take control of your career, and prepare yourself to ace the tests that come your way? By applying the timeless lessons in this compulsively readable parable, employees at all levels can learn to rekindle the go-getter in themselves.\n...more", "genre": ["Business", "Self Help", "Self Help", "Personal Development", "Leadership", "Fiction", "Classics", "Philosophy", "Inspirational", "Economics", "Finance", "Currency", "Money"], "author": "Peter B. Kyne", "rating": "4.16", "pages": "96"}, {"id": 20393, "title": "Love Letters in the Sand: The Love Poems of Khalil Gibran", "blurb": "Optimistic and wise, these love poems convey a mystical certainty of the arrival of love, while dramatizing the search for a soul mate that takes place in daily life, the imagination, and dreams. Inviting reflection on the meaning of love and eloquently rendering the chain of moments that the experience of love leads us through, this famous inspirational poet channels the \nOptimistic and wise, these love poems convey a mystical certainty of the arrival of love, while dramatizing the search for a soul mate that takes place in daily life, the imagination, and dreams. Inviting reflection on the meaning of love and eloquently rendering the chain of moments that the experience of love leads us through, this famous inspirational poet channels the same proverbial simplicity and lyrical beauty that made his poem The Prophet instantly and internationally loved.\n...more", "genre": ["Poetry", "Classics", "Romance", "Philosophy", "Love", "Spirituality", "Nonfiction", "Literature", "Cultural", "Lebanon", "Art"], "author": "Kahlil Gibran", "rating": "4.26", "pages": "94"}, {"id": 20410, "title": "The Complete Short Stories Of Robert Louis Stevenson: With A Selection Of The Best Short Novels", "blurb": "Scottish novelist, poet, and essayist Robert Louis Stevenson (1850\u00961894) was a writer of power and originality, who penned such classics as Treasure Island, Kidnapped, and The Weir of Hermiston. The editor has collected in convenient form Stevenson's short fiction, including the complete New Arabian Nights and The Strange Case of Dr. Jekyll and Mr. Hyde, as well as ghost stories, medieval romances, farces, horror stories, and the South Sea Tales. This volume amply illustrates Stephenson’s wide range and enduring appeal.Lodging for the night --Suicide Club: Story of the young man with the cream tarts / Story of the physician and the Saratoga trunk / Adventure of the Hansom cab --Rajah's Diamond: Story of the bandbox / Story of the young man in Holy Orders / Story of the house with the green blinds / Adventure of Prince Florizel and a detective --Providence and the guitar --Sire de Maletroit's door --Will o' the mill --Story of a lie --Thrawn Janet --Merry men --Body-snatcher --Markheim --Strange case of Dr. Jekyll and Mr. Hyde --Bottle imp --Beach of Falesa --Isle of Voices.", "genre": ["Classics", "Short Stories", "Fiction", "Literature"], "author": "Robert Louis Stevenson", "rating": "4.16", "pages": "720"}, {"id": 20411, "title": "Kidnapped", "blurb": "Original oil paintings by N. C. Wyeth capture the vitality of Robert Louis Stevenson’s timeless tale of fortune, camaraderie, betrayal, and independence in this stunning picture book edition of Kidnapped.David Balfour has never had an adventure. He has never spent a night camping in the Scottish Highlands. He has never sailed the high seas. He has never fought in a battle.\nOriginal oil paintings by N. C. Wyeth capture the vitality of Robert Louis Stevenson’s timeless tale of fortune, camaraderie, betrayal, and independence in this stunning picture book edition of Kidnapped.David Balfour has never had an adventure. He has never spent a night camping in the Scottish Highlands. He has never sailed the high seas. He has never fought in a battle. In fact, David Balfour has never even left home. All he knows is a quiet country life.  All of this changes after the death of his parents. He suddenly learns that he, David Balfour, is a man of wealth and standing, and that he is not destined for a simple life after all. All he needs to do to assume this new station in life is to travel to the town of Cramond, Scotland, to collect his inheritance from his father’s younger brother, an uncle he had not even known existed. But David soon discovers that this is not as simple as it sounds, as he struggles to survive and outwit his treacherous uncle in this classic adventure story.\n...more", "genre": ["Classics", "Fiction", "Adventure", "Historical", "Historical Fiction", "Cultural", "Scotland", "Young Adult", "Literature", "Historical", "Novels", "Audiobook"], "author": "Robert Louis Stevenson", "rating": "3.79", "pages": "64"}, {"id": 20438, "title": "Emerson in His Journals", "blurb": "This long-awaited volume offers the general reader the heart of Emerson's journals, that extraordinary series of diaries and notebooks in which he poured out his thoughts for more than fifty years, beginning with the luckless ragamuffin ideas of his college days.Emerson as revealed in his journals is more spontaneous, more complex, more human and appealing than he appear\nThis long-awaited volume offers the general reader the heart of Emerson's journals, that extraordinary series of diaries and notebooks in which he poured out his thoughts for more than fifty years, beginning with the luckless ragamuffin ideas of his college days.Emerson as revealed in his journals is more spontaneous, more complex, more human and appealing than he appears in the published works. This man is the seeker rather than the sage; he records the turmoil, struggle, and questioning that preceded the serene and confident affirmations of the essays. He is honest, earthy, tough-minded, self-critical (I am a lover of indolence, & of the belly), warm in his enthusiasms, a witty and sharp observer of people and events. Everything is grist for his mill: personal experiences, his omnivorous reading, ruminations on matters large and small, his doubts and perplexities, public issues and local gossip. There are abrupt shifts in subject and tone, reflecting the variousness of his moods and the restless energy of his mind.Drawing from Harvard's sixteen-volume scholarly edition of the journals--but omitting the textual apparatus that makes it hard to read--Joel Porte presents a sympathetic selection that brings us close to Emerson the man.\n...more", "genre": ["Classics", "Nonfiction", "Diary", "Journal"], "author": "Ralph Waldo Emerson", "rating": "4.23", "pages": "608"}, {"id": 20457, "title": "Being Methodist in the Bible Belt", "blurb": "This Methodist counterpart to Being Presbyterian in the Bible Belt is designed to help readers understand their own faith in the light of the dominant forces of evangelicalism and fundamentalism in the Bible Belt.", "genre": ["Religion", "Nonfiction"], "author": "F. Belton Joyner Jr.", "rating": "3.84", "pages": "112"}, {"id": 20463, "title": "An Omelette and a Glass of Wine", "blurb": "Contains delightful explorations of food and cooking, among which are the collection's namesake essay and many other gems; with black-and-white photographs and illustrations.\nContains delightful explorations of food and cooking, among which are the collection's namesake essay and many other gems; with black-and-white photographs and illustrations.\n...more", "genre": ["Food and Drink", "Food", "Food and Drink", "Cookbooks", "Nonfiction", "Food and Drink", "Cooking", "Food and Drink", "Food Writing", "Writing", "Essays", "Food and Drink", "Culinary", "Food and Drink", "Food and Drink", "Foodie", "Autobiography", "Memoir"], "author": "Elizabeth David", "rating": "4.12", "pages": "320"}, {"id": 20502, "title": "The Negative", "blurb": "Ansel Adams (1902-1984) produced some of this century's truly memorable photographic images and helped nurture the art of photgraphy through his creative innovations and peerless technical mastery. This handbook - the second volume in Adams' celebrated series of books on photographic techniques - has taught a generation of photographers how to use film and the film develop\nAnsel Adams (1902-1984) produced some of this century's truly memorable photographic images and helped nurture the art of photgraphy through his creative innovations and peerless technical mastery. This handbook - the second volume in Adams' celebrated series of books on photographic techniques - has taught a generation of photographers how to use film and the film development process creatively. Now available for the first time in paperback, it remains as vital today as when it was first published.Anchored by a detailed discussion of Adams' Zone System and his seminal concept of visualization, The Negative covers artificial and natural light, film and exposure, and darkoom equipment and techniques. Numerous examples of Adams' work clarify the principles discussed. Beautifully illustrated with photographs by Adams as well as instructive line drawings, this classic manual can dramatically improve your photography.\n...more", "genre": ["Art", "Photography", "Nonfiction", "Art", "Reference", "Art and Photography", "Culture", "Film", "Computer Science", "Technical", "Literature", "American", "Academic", "Grad School", "Art", "Art Design"], "author": "Ansel Adams", "rating": "4.41", "pages": "265"}, {"id": 20566, "title": "Daniel Deronda", "blurb": "A beautiful young woman stands poised over the gambling tables in an expensive hotel. She is aware of, and resents, the gaze of an unusual young man, a stranger, who seems to judge her, and find her wanting. The encounter will change her life.The strange young man is Daniel Deronda, brought up with his own origins shrouded in mystery, searching for a compelling outlet for his singular talents and remarkable capacity for empathy. Deronda's destiny will change the lives of many.", "genre": ["Classics", "Fiction", "19th Century", "Victorian", "Literature", "Historical Fiction", "British Literature"], "author": "George Eliot", "rating": "3.85", "pages": "850"}, {"id": 20634, "title": "Pequeña historia del perfume: la alquimia de las esencias", "blurb": "Desde los tiempos mas remotos las personas parecen experimentar un placer instintivo cuando frotan sus cuerpos con unguentos perfumados hechos con cortezas, hojas, flores y plantas. El perfume, etereo y casi intangible, inigualable en su capacidad para evocar nuestras emociones mas profundas, nos ha ayudado a orar, a curar y a hacer el amor. Los perfumes no solo estan directamente relacionados con sus fabricantes, sin mas bien con sus sacerdotes y alquimistas, que fueron los primeros en descubrir los poderes de la combinacion de esencias. Sin embargo, en gran medida, la perfumeria es un arte perdido. Su promesa creadora y sensual se eclipso con la llegada de los ingredientes sinteticos; productos quimicos que carecen de la sutileza y complejidad de las esencias derivadas de substancias naturales y de sus lujuriosas historias, y de los cuales se incluye una alta proporcion en la fabricacion de los perfumes contemporaneos Mandy Aftel resucita la rica herencia relacionada con la evolucion de la perfumeria, desde el comercio de especias hasta las investigaciones de los alquimistas, y desentierra un mundo olvidado donde el aroma era alabado por los poetas, contemplado por los filosofos y apreciado universalmente por sus profundos efectos sobre el cuerpo, la mente y el alma. La autora nos induce a experimentar por nosotros mismos los placeres derivados de las composiciones con fragancias naturales, guiando asi al lector en un proceso de transformacion que sigue el decreto alquimico solve et coagula disuelve y combina y que supone, en si mismo, toda una transformacion estetica y espiritual.", "genre": ["Nonfiction", "History", "Science", "Fashion", "Historical", "Crafts", "Unfinished"], "author": "Mandy Aftel", "rating": "4.10", "pages": "231"}, {"id": 20658, "title": "Blind Huber", "blurb": "Award-winning poet Nick Flynn takes readers into the dangerous and irresistible center of the hiveI sit in a body & think of a body, I pictureBurnens' hands, my wordsmake them move. I say, plunge them into the hive,& his hands go in.—from Blind HuberBlindness does not deter François Huber—the eighteenth-century beekeeper—in his quest to learn about bees through their beh\nAward-winning poet Nick Flynn takes readers into the dangerous and irresistible center of the hiveI sit in a body & think of a body, I pictureBurnens' hands, my wordsmake them move. I say, plunge them into the hive,& his hands go in.—from Blind HuberBlindness does not deter François Huber—the eighteenth-century beekeeper—in his quest to learn about bees through their behavior. Through an odd, but productive arrangement, Huber's assistant Burnens becomes his eyes, his narrator as he goes about his work. In Nick Flynn's extraordinary new collection, Huber and Burnens speak and so do the bees. The strongest virgin waits silently to kill the other virgins; drones are made of waiting; the swarm attempts to protect the queen. It is a cruel existence. Everyone sacrifices for the sweet honey, except the human hand that harvests it all in a single afternoon. Blind Huber is about the body, love, and devotion and also about the limits of what can be known and what will forever be unknown. Nick Flynn's bees and keepers—sometimes in a state of magnificent pollen-drunk dizziness—view the world from a striking and daring perspective.\n...more", "genre": ["Poetry", "Academic", "School", "Contemporary"], "author": "Nick Flynn", "rating": "3.97", "pages": "89"}, {"id": 20739, "title": "Asylums: Essays on the Social Situation of Mental Patients and Other Inmates", "blurb": "Asylums is an analysis of life in total institutions--closed worlds like prisons, army camps, boarding schools, nursing homes and mental hospitals. It focuses on the relationship between the inmate and the institution, how the setting affects the person and how the person can deal with life on the inside.", "genre": ["Sociology", "Psychology", "Nonfiction", "Mental Health", "Essays", "Philosophy", "Mental Illness"], "author": "Erving Goffman", "rating": "4.15", "pages": "386"}, {"id": 20772, "title": "The Christmas Wish", "blurb": "As the daughter of the Devilish Dandy, Sarah Cresswell is excluded from society. She is content with her life helping unfortunate children until Lord Chance sweeps through her door demanding her help in finding his mother's jewels that have been stolen. Determined to prove to the arrogant Lord that she is capable of finding any jewel thief in London Sarah guides Lord Chanc\nAs the daughter of the Devilish Dandy, Sarah Cresswell is excluded from society. She is content with her life helping unfortunate children until Lord Chance sweeps through her door demanding her help in finding his mother's jewels that have been stolen. Determined to prove to the arrogant Lord that she is capable of finding any jewel thief in London Sarah guides Lord Chance through the seamy underside of town. It never occurs to the practical maiden that her heart might be in danger or that it will take the efforts of her notorious father to make her most cherished Christmas wish come true.\n...more", "genre": ["Romance", "Holiday", "Christmas", "Historical", "Fiction", "Romance", "Historical Romance", "Historical Romance", "Regency Romance", "Historical", "Historical Fiction"], "author": "Debbie Raleigh", "rating": "3.24", "pages": "218"}, {"id": 20819, "title": "Vespers", "blurb": "Soon to be a blockbuster movie from Touchstone Pictures and the director of Men in Black, Vespers combines the terror of a Stephen King novel with the plot twists of Hitchcock's The Birds. A New York detective and a Bronx Zoo expert team up to solve what seems at first to be a series of random killings. But a swarm of deadly predators is on the loose in Manhattan and they must be stopped before they strike again. Martin's Press.", "genre": ["Horror", "Fiction", "Thriller", "Audiobook", "Science Fiction"], "author": "Jeff Rovin", "rating": "3.50", "pages": "Hardcover"}, {"id": 20860, "title": "The Encyclopedia of World Religions", "blurb": "This encyclopedia presents young adults with reliable, unbiased information on the world's religions, from ancient times onwards. This revised edition covers all the major and minor religions of the world, including those of the ancient world.", "genre": ["Religion", "Nonfiction"], "author": "Robert S. Ellwood", "rating": "3.00", "pages": "514"}, {"id": 20862, "title": "Divide and Conquer", "blurb": "Shadowy elements within the State Department secretly cause tensions to flare between Iran and the former Soviet republic of Azerbaijan. They hope to start a shooting war to increase their own power and profit.At the same time, the conspirators decide to up the ante --- by deposing the president of the United States. In a treacherous scheme, they convince the president that he is mentally unstable, and a silent coup d'etat is within their reach.Now, Paul Hood and the members of Op-Center must race against the clock to prevent the outbreak of war, save the honor of the president --- and expose the traitors ...", "genre": ["Thriller", "Fiction", "Espionage", "Action", "Adventure", "Military Fiction", "Suspense"], "author": "Jeff Rovin", "rating": "3.83", "pages": "372"}, {"id": 20867, "title": "Line of Control", "blurb": "It's a mission that only Striker - the military arm of Op-Center - can handle: capture an Islamic cleric who is stirring up a rebellion against the Indian government. But when the border between India and Pakistan erupts, the Striker team gets caught in the crossfire. Now America's most proficient covert team is trapped in a full-fledged war. Their fate rests in the hands \nIt's a mission that only Striker - the military arm of Op-Center - can handle: capture an Islamic cleric who is stirring up a rebellion against the Indian government. But when the border between India and Pakistan erupts, the Striker team gets caught in the crossfire. Now America's most proficient covert team is trapped in a full-fledged war. Their fate rests in the hands of a devious double agent whose own agenda is unknown - a man who could just as easily sell them out as set them free...\n...more", "genre": ["Fiction", "Thriller", "War", "Military Fiction", "Action", "Adventure", "Spy Thriller", "Espionage", "War", "Cultural", "Pakistan", "Politics", "Government", "Cultural", "India"], "author": "Jeff Rovin", "rating": "3.87", "pages": "384"}, {"id": 20949, "title": "American Caesar: Douglas MacArthur 1880-1964", "blurb": "MacArthur, the public figure, the private man, the soldier-hero whose mystery and appeal created a uniquely American legend, portrayed in a biography that will challenge the cherished myths of admirers and critics alike.IllustrationsPreamble: ReveilleFirst Call Ruffles & Flourishes (1880-1917)Charge (1917-1918) Call to Quarters (1919-1935)To the Colors (1935-1941)Retreat (\nMacArthur, the public figure, the private man, the soldier-hero whose mystery and appeal created a uniquely American legend, portrayed in a biography that will challenge the cherished myths of admirers and critics alike.IllustrationsPreamble: ReveilleFirst Call Ruffles & Flourishes (1880-1917)Charge (1917-1918) Call to Quarters (1919-1935)To the Colors (1935-1941)Retreat (1941-1942) The Green War (1942-1944)At High Port (1944-1945)Last Post (1945-1950) Sunset Gun (1950-1951) Recall (1951) Taps (1951-1964)AcknowledgmentsNotesBibliographyCopyright AcknowledgmentsIndex\n...more", "genre": ["Biography", "History", "Nonfiction", "War", "Military Fiction", "North American Hi...", "American History", "Military", "Military History", "War", "World War II", "War", "Cultural", "Japan", "Biography Memoir"], "author": "William Manchester", "rating": "4.07", "pages": "811"}, {"id": 20977, "title": "What Do You Really Want for Your Children?", "blurb": "World-famous author Wayne Dyer, the doctor who taught millions how to take charge of their own lives in the bestselling classics Your Erroneous Zones and Pulling Your Own Strings, reveals how to help your kids take charge of their own happiness.If you have children, then you have dreams for them. You want to see them growing up happy, healthy, self-reliant, and confident in themselves and their abilities. You’ve also probably wondered if you'll be able to give them all this. There's good news: you can. Wayne Dyer shares the wisdom and guidance that have already helped millions of readers take charge of their lives and shows how to make all your hopes for your children come true.Learn valuable advice including Dyer’s original seven simple secrets for building your child's self-esteem every day; how to give very young children all the love they need without spoiling them; how to encourage risk-taking without fear of failure; action strategies for dealing with both your own anger and your child's; the right way (and the wrong way) to improve your child's behavior; the secrets of raising kids relatively free of illness; techniques that encourage children to enjoy life, and much more.It's all here – straightforward, commonsense advice that no parent can afford to do without.", "genre": ["Parenting", "Self Help", "Nonfiction", "Psychology", "Family", "Spirituality"], "author": "Wayne W. Dyer", "rating": "4.36", "pages": "480"}, {"id": 21018, "title": "The Last Clue", "blurb": "It all comes together in the last episode of the Pyrates adventure. George and his friends have all the clues, but they don't yet know how to read them in order to find the Eye of Eternity gem. As they piece together the puzzle, they learn that Leroy, the master of the underground, has kidnapped Kira Trenov -- a woman who works with George's dad. If the kids don't turn over diamond, Leroy has threatened to kill her. As the stakes get higher, the young pyrate crew gets gutsier, and they battle Leroy in a true swashbuckler showdown in order to save the day -- and the diamond.", "genre": ["Adventure", "Childrens", "Juvenile", "Fiction"], "author": "Chris Archer", "rating": "4.09", "pages": "192"}, {"id": 21084, "title": "Un Pensamiento Positiva Para Cada Dia", "blurb": "La filosofía de pensamiento positivo de Norman Vincent Peale ha tenido una influencia sin precedentes en millones de personas alrededor del mundo. Ahora, la sabiduría de nueve libros -- incluyendo El poder de pensamiento -- puede ser encontrada entre estas páginas. Infinitos en sus mensajes, inapreciables en el curso diario de la vida, los libros clásicos del Dr. Peale proporcionan inspiración cuando usted más la necesita y marcan el camino hacia una vida más llena, mas feliz y más satisfactoria.", "genre": ["Self Help", "Inspirational", "Nonfiction", "Personal Development"], "author": "Norman Vincent Peale", "rating": "4.24", "pages": "376"}]