[{"id": 1, "title": "Harry Potter and the Half-Blood Prince", "blurb": "It is the middle of the summer, but there is an unseasonal mist pressing against the windowpanes. Harry Potter is waiting nervously in his bedroom at the Dursleys' house in Privet Drive for a visit from Professor Dumbledore himself. One of the last times he saw the Headmaster was in a fierce one-to-one duel with Lord Voldemort, and Harry can't quite believe that Professor \nIt is the middle of the summer, but there is an unseasonal mist pressing against the windowpanes. Harry Potter is waiting nervously in his bedroom at the Dursleys' house in Privet Drive for a visit from Professor Dumbledore himself. One of the last times he saw the Headmaster was in a fierce one-to-one duel with Lord Voldemort, and Harry can't quite believe that Professor Dumbledore will actually appear at the Dursleys' of all places. Why is the Professor coming to visit him now? What is it that cannot wait until Harry returns to Hogwarts in a few weeks' time? Harry's sixth year at Hogwarts has already got off to an unusual start, as the worlds of Muggle and magic start to intertwine...\n...more", "genre": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Childrens", "Adventure", "Audiobook", "Childrens", "Middle Grade", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.58", "pages": "652"}, {"id": 3, "title": "Harry Potter and the Sorcerer's Stone", "blurb": "Harry Potter has no idea how famous he is. That's because he's being raised by his miserable aunt and uncle who are terrified Harry will learn that he's really a wizard, just as his parents were. But everything changes when Harry is summoned to attend an infamous school for wizards, and he begins to discover some clues about his illustrious birthright. From the surprising way he is greeted by a lovable giant, to the unique curriculum and colorful faculty at his unusual school, Harry finds himself drawn deep inside a mystical world he never knew existed and closer to his own noble destiny.", "genre": ["Fantasy", "Fiction", "Young Adult", "Magic", "Childrens", "Middle Grade", "Classics"], "author": "J.K. Rowling", "rating": "4.47", "pages": "309"}, {"id": 5, "title": "Harry Potter and the Prisoner of Azkaban", "blurb": "Harry Potter, along with his best friends, Ron and Hermione, is about to start his third year at Hogwarts School of Witchcraft and Wizardry. Harry can't wait to get back to school after the summer holidays. (Who wouldn't if they lived with the horrible Dursleys?) But when Harry gets to Hogwarts, the atmosphere is tense. There's an escaped mass murderer on the loose, and th\nHarry Potter, along with his best friends, Ron and Hermione, is about to start his third year at Hogwarts School of Witchcraft and Wizardry. Harry can't wait to get back to school after the summer holidays. (Who wouldn't if they lived with the horrible Dursleys?) But when Harry gets to Hogwarts, the atmosphere is tense. There's an escaped mass murderer on the loose, and the sinister prison guards of Azkaban have been called in to guard the school...\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Magic", "Childrens", "Childrens", "Middle Grade", "Adventure", "Audiobook", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.58", "pages": "435"}, {"id": 6, "title": "Harry Potter and the Goblet of Fire", "blurb": "It is the summer holidays and soon Harry Potter will be starting his fourth year at Hogwarts School of Witchcraft and Wizardry. Harry is counting the days: there are new spells to be learnt, more Quidditch to be played, and Hogwarts castle to continue exploring. But Harry needs to be careful - there are unexpected dangers lurking...", "genre": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Childrens", "Childrens", "Middle Grade", "Adventure", "Audiobook", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.57", "pages": "734"}, {"id": 7, "title": "The Harry Potter Collection", "blurb": "Six years of magic, adventure, and mystery make this paperback collection the perfect gift for Harry Potter fans of all ages.Follow Harry from his first days at Hogwarts School for Witchcraft and Wizardry, through his many adventures with Hermione and Ron, to his confrontations with rival Draco Malfoy and the dreaded Professor Snape. From a dangerous descent into the Chamb\nSix years of magic, adventure, and mystery make this paperback collection the perfect gift for Harry Potter fans of all ages.Follow Harry from his first days at Hogwarts School for Witchcraft and Wizardry, through his many adventures with Hermione and Ron, to his confrontations with rival Draco Malfoy and the dreaded Professor Snape. From a dangerous descent into the Chamber of Secrets to the Triwizard Tournament to the return of He-Who-Must-Not-Be-Named, each adventure is more riveting and exhilarating than its predecessor, and now all six books are available together for the first time in a\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Magic", "Childrens", "Adventure", "Classics", "Science Fiction Fantasy", "Novels", "Paranormal", "Wizards"], "author": "J.K. Rowling", "rating": "4.72", "pages": null}, {"id": 8, "title": "Harry Potter Boxed Set, Books 1-5 (Harry Potter, #1-5)", "blurb": "Box Set containing Harry Potter and the Sorcerer's Stone, Harry Potter and the Chamber Of Secrets, Harry Potter and the Prisoner of Azkaban, Harry Potter and the Goblet Of Fire, and Harry Potter and the Order of the Phoenix!\nBox Set containing Harry Potter and the Sorcerer's Stone, Harry Potter and the Chamber Of Secrets, Harry Potter and the Prisoner of Azkaban, Harry Potter and the Goblet Of Fire, and Harry Potter and the Order of the Phoenix!\n...more", "genre": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Adventure", "Fantasy", "Supernatural", "Mystery", "Childrens", "Childrens", "Middle Grade", "Fantasy", "Paranormal"], "author": "J.K. Rowling", "rating": "4.75", "pages": "2690"}, {"id": 9, "title": "Unauthorized Harry Potter Book Seven News: \"Half-Blood Prince\" Analysis and Speculation", "blurb": "Through the magic of print-on-demand technology, this nimble guide to the work of best-selling author J. K. Rowling provides the latest news about the author and her works, updated whenever there are significant developments. Unlike a conventional book, for which editions are printed in quantity every couple of years, this living book goes through frequent mini-editio\nThrough the magic of print-on-demand technology, this nimble guide to the work of best-selling author J. K. Rowling provides the latest news about the author and her works, updated whenever there are significant developments. Unlike a conventional book, for which editions are printed in quantity every couple of years, this living book goes through frequent mini-editions and is printed fresh whenever customers place an order. Purchasers are entitled to free PDF updates! An entirely new section of analysis with more than 75 new pages will be added shortly after the release of Harry Potter and the Half-Blood Prince on July 16, 2005.\n...more", "genre": [], "author": "W. Frederick Zimmerman", "rating": "3.81", "pages": "152"}, {"id": 10, "title": "Harry Potter Collection", "blurb": "Six years of magic, adventure, and mystery make this luxurious boxed set the perfect gift for Harry Potter fans of all ages. Follow Harry from his first days at Hogwarts School for Witchcraft and Wizardry, through his many adventures with Hermione and Ron, to his confrontations with rival Draco Malfoy and the dreaded Professor Snape. From the thrilling search for the Sorce\nSix years of magic, adventure, and mystery make this luxurious boxed set the perfect gift for Harry Potter fans of all ages. Follow Harry from his first days at Hogwarts School for Witchcraft and Wizardry, through his many adventures with Hermione and Ron, to his confrontations with rival Draco Malfoy and the dreaded Professor Snape. From the thrilling search for the Sorcerer's Stone to the Triwizard Tournament to the return of He-Who-Must-Not-Be-Named, each adventure is more riveting and exhilarating than its predecessor, and now all six books are available together for the first time in an elegant hardcover boxed set.\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Magic", "Childrens", "Adventure", "Classics", "Science Fiction Fantasy", "Novels", "Paranormal", "Wizards"], "author": "J.K. Rowling", "rating": "4.72", "pages": "3342"}, {"id": 32, "title": "The Lord of the Rings", "blurb": "Classics in the genre, J.R.R. Tolkien's definitive three-book epic, the Lord of the Rings (encompassing The Fellowship of the Ring, The Two Towers, and The Return of the King), and its charming precursor, The Hobbit. That many (if not most) fantasy works are in some way derivative of Tolkien is understood, but the influence of the Lord of the Rings is so universal that eve\nClassics in the genre, J.R.R. Tolkien's definitive three-book epic, the Lord of the Rings (encompassing The Fellowship of the Ring, The Two Towers, and The Return of the King), and its charming precursor, The Hobbit. That many (if not most) fantasy works are in some way derivative of Tolkien is understood, but the influence of the Lord of the Rings is so universal that everybody from George Lucas to Led Zeppelin has appropriated it for one purpose or another. Not just revolutionary because it was groundbreaking, the Lord of the Rings is timeless because it's the product of a truly top-shelf mind. Tolkien was a distinguished linguist and Oxford scholar of dead languages, with strong ideas about the importance of myth and story and a deep appreciation of nature. His epic, 10 years in the making, recounts the Great War of the Ring and the closing of Middle-Earth's Third Age, a time when magic begins to fade from the world and men rise to dominance. Tolkien carefully details this transition with tremendous skill and love, creating in the Lord of the Rings a universal and all-embracing tale, a justly celebrated classic. --Paul Hughes\n...more", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Literature", "Novels", "Young Adult"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1137"}, {"id": 35, "title": "The Lord of the Rings", "blurb": "Celebrated Tolkien illustrator Alan Lee, a conceptual designer for the blockbuster films based on The Lord of the Rings, contributes 50 beautiful full-page, full-color paintings to this elegant three-volume edition.One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted b\nCelebrated Tolkien illustrator Alan Lee, a conceptual designer for the blockbuster films based on The Lord of the Rings, contributes 50 beautiful full-page, full-color paintings to this elegant three-volume edition.One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them. In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell, by chance, into the hands of the hobbit, Bilbo Baggins. From his fastness in the Dark Tower of Mordor, Sauron's power spread far and wide. He gathered all the Great Rings to him, but ever he searched far and wide for the One Ring that would complete his dominion. On his eleventy-first birthday Bilbo disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest -- to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom. The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard, Merry, Pippin, and Sam, Gimli the Dwarf, Legolas the Elf, Boromir of Gondor, and a tall, mysterious stranger called Strider. Saga of a group heroes who set forth to save their world from evil. A brotherhood of hobbits, elves, dwarves, and people is formed to combat evil forces. Tolkien drew on his extensive knowledge of folklore and the classics to create the worlds and creatures described in the trilogy, which includes The Fellowship of the Ring, The Two Towers, and The Return of the King.\n...more", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Literature", "Novels", "Young Adult"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1216"}, {"id": 27, "title": "Neither Here nor There: Travels in Europe", "blurb": "Bill Bryson's first travel book, The Lost Continent, was unanimously acclaimed as one of the funniest books in years. In Neither Here nor There he brings his unique brand of humour to bear on Europe as he shoulders his backpack, keeps a tight hold on his wallet, and journeys from Hammerfest, the northernmost town on the continent, to Istanbul on the cusp of Asia. Fluent in, oh, at least one language, he retraces his travels as a student twenty years before.Whether braving the homicidal motorist of Paris, being robbed by gypsies in Florence, attempting not to order tripe and eyeballs in a German restaurant, window-shopping in the sex shops of the Reeperbahn or disputing his hotel bill in Copenhagen, Bryson takes in the sights, dissects the culture and illuminates each place and person with his hilariously caustic observations. He even goes to Liechtenstein.", "genre": ["Travel", "Nonfiction", "Humor", "Memoir", "Biography", "Audiobook", "Travelogue"], "author": "Bill Bryson", "rating": "3.85", "pages": "254"}, {"id": 29, "title": "The Mother Tongue: English and How It Got That Way", "blurb": "Only Bill Bryson could make a book about the English language so entertaining. With his boundless enthusiasm and restless eye for the absurd, this is his astonishing tour of English.From its mongrel origins to its status as the world's most-spoken tongue; its apparent simplicity to its deceptive complexity; its vibrant swearing to its uncertain spelling and pronunciation; Bryson covers all this as well as the many curious eccentricities that make it as maddening to learn as it is flexible to use.Bill Bryson's classic Mother Tongue is a highly readable and hilarious tale of how English came to be the world's language.", "genre": ["Nonfiction", "History", "Language", "Linguistics", "Humor", "Audiobook", "Writing"], "author": "Bill Bryson", "rating": "3.91", "pages": "270"}, {"id": 31, "title": "The Lord of the Rings", "blurb": "The Fellowship of the Ring, part one of J.R.R. Tolkien’s epic masterpiece, first reached these shores on October 21, 1954, arriving, as C. S. Lewis proclaimed, “like lightning from a clear sky.” Fifty years and nearly one hundred million American readers later comes a beautiful new one-volume collector’s edition befitting the stature of this crown jewel of our list. With a text fully corrected under the supervision of Christopher Tolkien to meet the author’s exacting wishes, two large-format fold-out maps, a ribbon placemarker, gilded page edges, a color insert depicting Tolkien's own paintings of the Book of Mazarbul and exceptionally elegant and sturdy overall packaging housed within an attractive slipcase, this edition is the finest we’ve ever produced.", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Epic Fantasy", "High Fantasy"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1184"}, {"id": 39, "title": "The Lord of the Rings", "blurb": "Widely regarded as a broadcasting classic, the 1981 BBC Radio dramatisation of The Lord of the Rings stars Ian Holm, Michael Hordern, Robert Stephens, John Le Mesurier and Peter Woodthorpe. This box set contains all three parts of the epic tale - The Fellowship of the Ring, The Two Towers and The Return of the King. Sauron, the Dark Lord, has gathered to him the Rings of P\nWidely regarded as a broadcasting classic, the 1981 BBC Radio dramatisation of The Lord of the Rings stars Ian Holm, Michael Hordern, Robert Stephens, John Le Mesurier and Peter Woodthorpe. This box set contains all three parts of the epic tale - The Fellowship of the Ring, The Two Towers and The Return of the King. Sauron, the Dark Lord, has gathered to him the Rings of Power - the means by which he will be able to rule the world. All he lacks in his plan for domination is the Ruling Ring, which has fallen into the hands of the hobbit, Frodo Baggins... Brian Sibley, one of the original dramatists, has written new opening and closing narration for the character of Frodo, played by Ian Holm. This collection also includes a bonus CD featuring Stephen Oliver's complete musical score, and a demo version of 'Bilbo's Last Song'.13 CDs. 13 hrs 15 mins.\n...more", "genre": ["Fantasy", "Fiction", "Audiobook", "Classics", "Adventure", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Science Fiction Fantasy", "Adult", "Science Fiction"], "author": "Brian Sibley", "rating": "4.75", "pages": null}, {"id": 2, "title": "Harry Potter and the Order of the Phoenix", "blurb": "Harry Potter is about to start his fifth year at Hogwarts School of Witchcraft and Wizardry. Unlike most schoolboys, Harry never enjoys his summer holidays, but this summer is even worse than usual. The Dursleys, of course, are making his life a misery, but even his best friends, Ron and Hermione, seem to be neglecting him.Harry has had enough. He is beginning to think he \nHarry Potter is about to start his fifth year at Hogwarts School of Witchcraft and Wizardry. Unlike most schoolboys, Harry never enjoys his summer holidays, but this summer is even worse than usual. The Dursleys, of course, are making his life a misery, but even his best friends, Ron and Hermione, seem to be neglecting him.Harry has had enough. He is beginning to think he must do something, anything, to change his situation, when the summer holidays come to an end in a very dramatic fashion. What Harry is about to discover in his new year at Hogwarts will turn his world upside down...\n...more", "genre": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic", "Childrens", "Adventure", "Audiobook", "Childrens", "Middle Grade", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.50", "pages": "912"}, {"id": 18, "title": "The Ultimate Hitchhiker's Guide", "blurb": "The Hitchhiker's Guide to the GalaxySeconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time and space.The Restaurant at the End of the UniverseFacing annihilation at the hands of warmongers is a curious time to crave tea. It could only happen to the cosmically displaced Arthur Dent and his comrades as they hurtle across the galaxy in a desperate search for a place to eat.Life, the Universe and EverythingThe unhappy inhabitants of planet Krikkit are sick of looking at the night sky- so they plan to destroy it. The universe, that is. Now only five individuals can avert Armageddon: mild-mannered Arthur Dent and his stalwart crew.So Long, and Thanks for All the FishBack on Earth, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription conspires to thrust him back to reality. So to speak.Mostly HarmlessJust when Arthur Dent makes the terrible mistake of starting to enjoy life, all hell breaks loose. Can he save the Earth from total obliteration? Can he save the Guide from a hostile alien takeover? Can he save his daughter from herself?Also includes the short story Young Zaphod Plays It Safe.", "genre": ["Science Fiction", "Fiction", "Humor", "Fantasy", "Classics", "Comedy", "Science Fiction Fantasy"], "author": "Douglas Adams", "rating": "4.38", "pages": "815"}, {"id": 33, "title": "The Lord of the Rings", "blurb": "One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind themIn ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, i\nOne Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind themIn ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins.From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings to him, but always he searched for the One Ring that would complete his dominion.When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom.The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider.\n...more", "genre": ["Fantasy", "Classics", "Fiction", "Adventure", "Science Fiction Fantasy", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Literature", "Novels", "Young Adult"], "author": "J.R.R. Tolkien", "rating": "4.52", "pages": "1216"}, {"id": 49, "title": "Bucaneer", "blurb": "A tale of the Caribbean when privateers tapped into Spain's Mother Lode of gold and silver they were ripping from the New World. Buccaneers boarded these treasure ships and transferred the contents into their own vessels. High excitement when a bunch of pig roasters turned into robbers of the sea. High romance and brutal sea battles await the reader of this fiction drawn f\nA tale of the Caribbean when privateers tapped into Spain's Mother Lode of gold and silver they were ripping from the New World. Buccaneers boarded these treasure ships and transferred the contents into their own vessels. High excitement when a bunch of pig roasters turned into robbers of the sea. High romance and brutal sea battles await the reader of this fiction drawn from history.\n...more", "genre": [], "author": "Luther Butler", "rating": "3.57", "pages": "208"}, {"id": 4, "title": "Harry Potter and the Chamber of Secrets", "blurb": "The Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.And strike it does. For in Harry's second year at Ho\nThe Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.And strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor, Gilderoy Lockhart, a spirit named Moaning Myrtle who haunts the girls' bathroom, and the unwanted attentions of Ron Weasley's younger sister, Ginny. But each of these seem minor annoyances when the real trouble begins, and someone, or something, starts turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects: Harry Potter himself?\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Fantasy", "Magic", "Childrens", "Childrens", "Middle Grade", "Audiobook", "Adventure", "Classics", "Science Fiction Fantasy"], "author": "J.K. Rowling", "rating": "4.43", "pages": "352"}, {"id": 12, "title": "The Ultimate Hitchhiker's Guide: Five Complete Novels and One Story", "blurb": "At last in paperback in one complete volume, here are the five novels from Douglas Adams's Hitchhiker series. The Hitchhiker's Guide to the GalaxySeconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time an\nAt last in paperback in one complete volume, here are the five novels from Douglas Adams's Hitchhiker series. The Hitchhiker's Guide to the GalaxySeconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time and space.The Restaurant at the End of the UniverseFacing annihilation at the hands of warmongers is a curious time to crave tea. It could only happen to the cosmically displaced Arthur Dent and his comrades as they hurtle across the galaxy in a desperate search for a place to eat.Life, the Universe and EverythingThe unhappy inhabitants of planet Krikkit are sick of looking at the night sky- so they plan to destroy it. The universe, that is. Now only five individuals can avert Armageddon: mild-mannered Arthur Dent and his stalwart crew.So Long, and Thanks for All the FishBack on Earth, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription conspires to thrust him back to reality. So to speak.Mostly HarmlessJust when Arthur Dent makes the terrible mistake of starting to enjoy life, all hell breaks loose. Can he save the Earth from total obliteration? Can he save the Guide from a hostile alien takeover? Can he save his daughter from herself?Also includes the short story Young Zaphod Plays It Safe.\n...more", "genre": ["Science Fiction", "Fiction", "Humor", "Fantasy", "Classics", "Humor", "Comedy", "Science Fiction Fantasy", "Adventure", "Novels", "Space"], "author": "Douglas Adams", "rating": "4.38", "pages": "815"}, {"id": 17, "title": "The Hitchhiker's Guide to the Galaxy: Quandary Phase", "blurb": "Many are familiar with Douglas Adams's classic Hitchhiker's Guide to the Galaxy series, but few know that these books started out as a multi-part series performed on BBC radio. This installment, part four, is a robust radio dramatization of So Long and Thanks for All the Fish. The Earth has miraculously reappeared and Arthur Dent is in love with the otherworldly Fenchurch,\nMany are familiar with Douglas Adams's classic Hitchhiker's Guide to the Galaxy series, but few know that these books started out as a multi-part series performed on BBC radio. This installment, part four, is a robust radio dramatization of So Long and Thanks for All the Fish. The Earth has miraculously reappeared and Arthur Dent is in love with the otherworldly Fenchurch, but Ford Prefect has an idea that might burst Arthur’s happy little bubble. What is really going on with Arthur’s dream girl, where have all the dolphins gone, and what was their departing message to mankind?\n...more", "genre": ["Science Fiction", "Audiobook", "Humor", "Fiction", "Humor", "Comedy", "Science Fiction Fantasy", "Fantasy", "Classics", "Space", "Adult"], "author": "Douglas Adams", "rating": "4.33", "pages": null}, {"id": 36, "title": "The Lord of the Rings: Weapons and Warfare", "blurb": "Lavishly illustrated with 1,000 photos, paintings, maps, sculptures and sketches, most appearing here for the first time, Weapons and Warfare is an indispensable chronicle of The Lord of the Rings' many creatures, warriors, armies and battlegrounds. From the graceful and proficient Elves to the horrendous war machines of the Dark Lord, each culture's approach to warfare is explained - how they fought, why they were fighting, what armor they wore and what weapons they used against their enemies. Now you can get as close to a marauding Orc as you could ever wish, without suffering the consequences!Treating the filmmakers' notes, designs and props as a true archive, Weapons and Warfare describes in detail every major conflict depicted in the film trilogy - from The Last Alliance of Elves and Men to the climactic Battle of the Pelennor Fields - each accompanied by a battle diagram from the films' chief designers.Armed with a wealth of fascinating facts and unique imagery, and with an exclusive foreword by Christopher Lee and an introduction by the Academy Award winner Richard Taylor, Weapons and Warfare promises to be the most striking companion to The Lord of the Rings movie trilogy published to date.", "genre": ["Fantasy", "Art", "Fiction", "Reference", "Media Tie In", "Film", "Classics"], "author": "Chris   Smith", "rating": "4.59", "pages": "218"}, {"id": 45, "title": "Agile Web Development with Rails: A Pragmatic Guide", "blurb": "Rails is a full-stack, open source web framework that enables you to create full-featured, sophisticated web-based applications, but with a twist... A full Rails application probably has less total code than the XML you'd need to configure the same application in other frameworks. With this book you'll learn how to use ActiveRecord to connect business objects and database tables. No more painful object-relational mapping. Just create your business objects and let Rails do the rest. You'll learn how to use the Action Pack framework to route incoming requests and render pages using easy-to-write templates and components. See how to exploit the Rails service frameworks to send emails, implement web services, and create dynamic, user-centric web-pages using built-in Javascript and Ajax support. There are extensive chapters on testing, deployment, and scaling. You'll see how easy it is to install Rails using your web server of choice (such as Apache or lighttpd) or using its own included web server. You'll be writing applications that work with your favorite database (MySQL, Oracle, Postgres, and more) in no time at all. You'll create a complete online store application in the extended tutorial section, so you'll see how a full Rails application is developed---iteratively and rapidly. Rails strives to honor the Pragmatic Programmer's DRY Principle by avoiding the extra work of configuration files and code annotations. You can develop in real-time: make a change, and watch it work immediately. Forget XML. Everything in Rails, from templates to control flow to business logic, is written in Ruby, the language of choice for programmers who like to get the job done well (and leave work ontime for a change). Rails is the framework of choice for the new generation of Web 2.0 developers. Agile Web Development with Rails is the book for that generation, written by Dave Thomas (Pragmatic Programmer and author of Programming Ruby) and David Heinemeier Hansson, who created Rails.", "genre": ["Programming", "Nonfiction", "Technology", "Technical", "Reference", "Computers", "Software"], "author": "Dave Thomas", "rating": "3.84", "pages": "558"}]