[{"id": 20001, "title": "Interfictions: An Anthology of Interstitial Writing", "blurb": "Nineteen writers dig into the imaginative spaces between conventional genres—realistic and fantastical, scholarly and poetic, personal and political—and bring up gems of new fiction: interstitial fiction.This is the literary mode of the new century, a reflection of the complex, ambiguous, and challenging world that we live in. These nineteen stories, by some of the most in\nNineteen writers dig into the imaginative spaces between conventional genres—realistic and fantastical, scholarly and poetic, personal and political—and bring up gems of new fiction: interstitial fiction.This is the literary mode of the new century, a reflection of the complex, ambiguous, and challenging world that we live in. These nineteen stories, by some of the most interesting and innovative writers working today, will change your mind about what stories can and should do as they explore the imaginative space between conventional genres. The editors garnered stories from new and established authors in the United States, Canada, Australia, and the United Kingdom, and also fiction translated from Spanish, Hungarian, and French. The collection features stories from Christopher Barzak, Colin Greenland, Holly Phillips, Rachel Pollack, Vandana Singh, Anna Tambour, Catherynne Valente, Leslie What, and others.\n...more", "genre": ["Short Stories", "Fantasy", "Fiction", "Anthologies", "Speculative Fiction", "Science Fiction", "Magical Realism", "Science Fiction Fantasy", "Short Stories", "Short Story Collection", "Weird Fiction", "New Weird"], "author": "Delia Sherman", "rating": "3.76", "pages": "291"}, {"id": 20002, "title": "The Fall of the Kings", "blurb": "This stunning follow-up to Ellen Kushner's cult-classic novel, Swordspoint, is set in the same world of labyrinthine intrigue, where sharp swords and even sharper wits rule. Against a rich tapestry of artists and aristocrats, students, strumpets, and spies, a gentleman and a scholar will find themselves playing out an ancient drama destined to explode their society's smu\nThis stunning follow-up to Ellen Kushner's cult-classic novel, Swordspoint, is set in the same world of labyrinthine intrigue, where sharp swords and even sharper wits rule. Against a rich tapestry of artists and aristocrats, students, strumpets, and spies, a gentleman and a scholar will find themselves playing out an ancient drama destined to explode their society's smug view of itself--and reveal that sometimes the best price of uncovering history is being forced to repeat it.... The Fall of the Kings Generations ago the last king fell, taking with him the final truths about a race of wizards who ruled at his side. But the blood of the kings runs deep in the land and its people, waiting for the coming together of two unusual men. Theron Campion, a young nobleman of royal lineage, is heir to an ancient house and a modern scandal. Tormented by his twin duties to his family and his own bright spirit, he seeks solace in the University. There he meets Basil St. Cloud, a brilliant and charismatic teacher ruled by a passion for knowledge--and a passion for the ancient kings. Of course, everyone now knows that the wizards were charlatans and the kings their dupes and puppets. Only Basil is not convinced--nor is he convinced that the city has seen its last king... From the Trade Paperback edition\n...more", "genre": ["Fantasy", "Fiction", "Romance", "M M Romance", "LGBT", "Queer", "LGBT", "Gay", "LGBT", "Science Fiction Fantasy", "Fantasy", "Fantasy Of Manners", "Romance", "Fantasy Of Manners", "Mannerpunk"], "author": "Ellen Kushner", "rating": "3.66", "pages": "510"}, {"id": 20009, "title": "Growing Up Untouchable in India: A Dalit Autobiography", "blurb": "There is much in Vasant Moon's extraordinary story of his vasti, his childhood neighbourhood in India, that would probably be true of any urban ghetto anywhere in the world. But there is much that is peculiarly and vividly Indian. In this first autobiography of a so-called Untouchable, we learn about the inescapable hierarchy imposed by caste, based on ancient principles o\nThere is much in Vasant Moon's extraordinary story of his vasti, his childhood neighbourhood in India, that would probably be true of any urban ghetto anywhere in the world. But there is much that is peculiarly and vividly Indian. In this first autobiography of a so-called Untouchable, we learn about the inescapable hierarchy imposed by caste, based on ancient principles of heriditary pollution. We see the unmatched importance of the heroic Dr. B. R. Ambedkar for India's awakened and newly ambitious Dalits. We feel, viscerally, Nagpur's heat and the joy brought by the monsoon. Vasant Moon's Vasti, the first Dalit autobiography to be published in English, is a moving and eloquent testament to a uniquely Indian life as well as to the universal human spirit.\n...more", "genre": ["Cultural", "India", "Politics", "Autobiography", "Memoir", "History", "Biography", "Biography Memoir", "Nonfiction"], "author": "Vasant Moon", "rating": "3.83", "pages": "224"}, {"id": 20017, "title": "The Bill Slider Omnibus", "blurb": "ORCHESTRATED DEATHMiddle-class, middle-aged and, according to his partner, menopausal, Detective Inspector Bill Slider is never going to make it to the Yard. Passed over for promotion again, the last thing he needs in his life, or on his patch, is an unidentifiable, naked female corpse.A priceless Stradivarius and a giant tin of olive oil are the only clues in an investigation that takes the steely-eyed, furry-headed detective all the way from the exotic backstreets of Shepherd's Bush to far-flung Birmingham.DEATH WATCHWhen a noted womaniser dies in mysterious circumstances in a sleazy motel and the whole of his murky past comes to light, DI Bill Slider begins to question more than whether the game is worth the candle. Right is right, and indivisible. As soon as he's solved the motel mystery, and found out what the Neary boys and Gorgeous George are up to, Slider's going to have to start putting his own house in orders ...NECROCHIPDetective Superintendent 'George' Dickson's replacement by DS 'Mad Ivan' Barrington - a new broom determined to sweep clean - is all par for the course for DI Bill Slider, as he faces the unhygienic fact of a dismembered corpse in a catering establishment.But there are still niggling questions to distract him: why didn't Barrington like Dickson? What is the mystery of the stake-out they once did together? And why is Slider's home life in almost perpetual stride?", "genre": ["Mystery"], "author": "Cynthia Harrod-Eagles", "rating": "4.24", "pages": "848"}, {"id": 20018, "title": "Dear Departed", "blurb": "Chattie Cornfeld was murdered while jogging in the park. She ran her own small marketing company and lived comfortably, perhaps too comfortably for her income. At first it looked as though she was the latest victim of the Park Killer, but it doesn't take Slider and Atherton long to establish that someone was trying to pass the killing off as part of a pattern—only the pattern doesn't fit, this one was personal. Chattie was popular with all who crossed her path, and it was difficult to imagine she had gained any enemies. Turning to the two most popular motives for murder—money and passion—Slider and his team's investigation turn up some puzzling anomalies in her life, not least the number of men who counted themselves as her lover and the tangled relationships of her family. But none of the suspects can be made to fit what evidence they have, unless of course they've been mis-reading the evidence.", "genre": ["Mystery", "Crime", "Fiction", "Mystery Thriller", "Historical Fiction"], "author": "Cynthia Harrod-Eagles", "rating": "3.98", "pages": "352"}, {"id": 20019, "title": "Killing Time", "blurb": "Detective Inspector Bill Slider is back at his post at London's Shepherd's Bush police station--accompanied by a persistent headache, resulting from a recent case that also left his steadfast colleague Atherton hospitalized. And the throbbing pain is compounded by his ex-wife's efforts to seek a reconciliation that doesn't happen to sit well with Joanna, his lover. But his domestic problems are swiftly put on hold when duty calls.After receiving a series of threatening correspondence, a gender-bending, erotic male dancer had pleaded with Slider for help. But the wily policeman doesn't respond until it's too late--and the dancer has been murdered. Probing the victim's sordid career, Slider plunges into a world of seedy nightclubs to interrogate table-dancers, prostitutes, pimps, and cabinet ministers with some very peculiar peccadilloes. When the vicious attack of a popular constable links itself to the dancer's murder, Slider delves even deeper to find the connection between the two incidents. As the pressure mounts, he must work his trusted gray matter to the quick if he wants to prevent a savage murderer from killing again.", "genre": ["Mystery", "Fiction", "Crime", "British Literature", "Suspense", "Mystery Thriller", "Detective"], "author": "Cynthia Harrod-Eagles", "rating": "4.03", "pages": "280"}, {"id": 20020, "title": "Death Watch", "blurb": "Publishers Weekly hailed the first book in this series, Orchestrated Death, with a starred review at publication, giving special praise to the book's sophisticated ending and strong players. Now, in Death Watch, London policeman Bill Slider returns in a case of arson--and murder.", "genre": ["Mystery", "Crime", "Fiction", "British Literature", "Mystery Thriller"], "author": "Cynthia Harrod-Eagles", "rating": "3.88", "pages": "280"}, {"id": 20021, "title": "The Tangled Thread", "blurb": "1788 - The French Revolution; beginning of Industrial RevolutionIn France, as the revolution begins, Henri, the bastard offshoot of the Morland family, strives to protect his family. He binds his daughter Heloise in loveless marriage to a Revolutionary, and allies himself with the vigorous Danton. But in the bloodbath of the Terror and the fall of Danton, Henri goes to the guillotine and Heloise flees to England where she is welcomed warmly by the Morland family. In Yorkshire Jemima's troublesome brood cause her anxiety - especially her youngest, Lucy, who disguises herself as a boy and runs away to sea - but at last she sees three of her children marry and the hope of an heir to Morland Place.", "genre": ["Historical Fiction", "Historical", "Fiction", "Romance", "Historical Romance", "France"], "author": "Cynthia Harrod-Eagles", "rating": "4.33", "pages": "474"}, {"id": 20022, "title": "The Flood-Tide", "blurb": "1772 - George III; the American War of IndependenceEngland is peaceful under George III, and Morland Place flourishes under the careful tending of Jemima and her loyal husband Allen. Their seven children often bring them heartache, but they are sustained by their love for each other and their absorbing interest in improving the estate lands. But beyond England's shores things are not so calm. Morland cousins find themselves embroiled in the American war for independence, and the family's bastard offshoot, Henri, disports himself in the salons of Paris while outside revolution creeps closer.", "genre": ["Historical Fiction", "Historical", "Fiction", "Historical Romance", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.25", "pages": "428"}, {"id": 20023, "title": "The White Road", "blurb": "August 1914The whole country is thrilled by the declaration of war. The British Expeditionary Force goes off to France to defend gallant little Belgium, and thousands more young men rush to volunteer, hoping to see action before the war ends at Christmas. At home everyone competes to be doing the most for the war effort. The Morlands have their share of volunteers, and no-\nAugust 1914The whole country is thrilled by the declaration of war. The British Expeditionary Force goes off to France to defend gallant little Belgium, and thousands more young men rush to volunteer, hoping to see action before the war ends at Christmas. At home everyone competes to be doing the most for the war effort. The Morlands have their share of volunteers, and no-one can say they aren't at the very heart of things. But when Christmas comes the war is far from over, and nine in ten of the men who marched, singing, down the white road to Mons have fallen.\n...more", "genre": ["Historical", "Historical Fiction", "Historical", "Fiction", "War", "World War I", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.31", "pages": "480"}, {"id": 20024, "title": "The Maiden", "blurb": "1720: political intrigue besets the kingdom as the Stuarts try to claim the throne occupied by the Hanoverians and the Morlands have to use all their wiles to keep their fortunes intact. Jeremy Morland, sole heir to his father's will, has no option but to marry to cold-hearted Lady Mary to secure Hanoverian protection and safeguard his inheritance. Then the rebellion of '45 and the bloody massacre at Culloden thrust his daughter Jemima into the spotlight as the saviour of the family. Independent, single-minded, and a rare beauty, Jemima is a capable caretaker of the Morland heritage. Although Morland Place and its lands suffer from the excesses of her dissolute husband, Jemima's quiet courage earns her an abiding love and loyalty.", "genre": ["Historical Fiction", "Historical", "Fiction", "Romance", "Historical Romance", "British Literature"], "author": "Cynthia Harrod-Eagles", "rating": "4.29", "pages": "413"}, {"id": 20025, "title": "The Oak Apple", "blurb": "1630 - Charles I; the Civil WarWhen civil war destroys the long years of peace in England, the clash between King and Parliament is echoed at Morland Place. Richard, the heir, brings home a Puritan bride, while his dashing brother Kit joins the Royalist cavalry under Prince Rupert, leaving their father, Edmund, desperately trying to steer a middle course. As the war grinds\n1630 - Charles I; the Civil WarWhen civil war destroys the long years of peace in England, the clash between King and Parliament is echoed at Morland Place. Richard, the heir, brings home a Puritan bride, while his dashing brother Kit joins the Royalist cavalry under Prince Rupert, leaving their father, Edmund, desperately trying to steer a middle course. As the war grinds on, bitterness replaces early fervour and divisions grow deeper, and through it all Edmund struggles grimly to protect his inheritance and keep Morland Place intact.\n...more", "genre": ["Historical", "Historical Fiction", "Historical", "Fiction", "European Literature", "British Literature", "Romance", "Literature", "17th Century", "Romance", "Historical Romance", "War", "Historical", "Stuart"], "author": "Cynthia Harrod-Eagles", "rating": "4.21", "pages": "403"}, {"id": 20026, "title": "The Emperor", "blurb": "1795 - NapoleonThe shadow of Napoleon is falling across Europe, and a restlessness seems to be changing mores and loosening society's restraints. At Morland Place James's marriage to Mary Ann is falling apart; Lucy's to Chetwyn is in the balance as she embarks on a blatant affair with a sea officer; and William supports a mistress he cannot marry. Mary goes to sea with her\n1795 - NapoleonThe shadow of Napoleon is falling across Europe, and a restlessness seems to be changing mores and loosening society's restraints. At Morland Place James's marriage to Mary Ann is falling apart; Lucy's to Chetwyn is in the balance as she embarks on a blatant affair with a sea officer; and William supports a mistress he cannot marry. Mary goes to sea with her husband Captain Haworth and is caught up in the battle of the Nile; and as war becomes inevitable, Lucy knows she must say goodbye to her love as every fighting captain waits eagerly for his commission.\n...more", "genre": ["Historical", "Historical Fiction", "Historical", "Fiction", "Romance"], "author": "Cynthia Harrod-Eagles", "rating": "4.30", "pages": "512"}, {"id": 20046, "title": "Show Me God: What the Message from Space Is Telling Us About God", "blurb": "In exclusive interviews, Stephen Hawking, NASA leaders, and Nobel prize-winning astronomers talk about how their discoveries have affected life's big questions. Topics include the creation and fine-tuning of the universe, the purpose of life, and the nature of God. The humor and multimedia format make this title make it especially appealing. 98 photos.", "genre": ["Science", "Nonfiction", "Religion", "Christianity", "Spirituality", "Faith", "Theology"], "author": "Fred Heeren", "rating": "4.00", "pages": "397"}, {"id": 20048, "title": "An Argument for Mind", "blurb": "In this elegantly written book, Jerome Kagan melds the history of the field of psychology during the past 50 years with the story of his own research efforts of the same period and an analysis of what he terms “the currently rocky romance between psychology and biology.” As Kagan unwinds his own history, he reveals the seminal events that have shaped his career and discusses how his assumptions have changed. With full appreciation for the contributions to psychology of history, philosophy, literature, and neuroscience, he approaches a wide range of fascinating topics, including:·   the abandonment of orthodox forms of behaviorism and psychoanalysis·   the forces that inspired later-twentieth-century curiosity about young children·   why B. F. Skinner chose to study psychology·   why the study of science less often ignites imaginations today·   our society’s obsession with erotic love·   the resurgence of religious fanaticism and the religious RightEmbedded in Kagan’s discussions is a rejection of the current notion that a mature neuroscience will eventually replace psychology. He argues that a complete understanding of brain is not synonymous with a full explanation of mind, and he concludes with a brief prediction of the next five decades in the field of psychology.", "genre": ["Psychology"], "author": "Jerome Kagan", "rating": "4.11", "pages": "304"}, {"id": 20051, "title": "The Nature of the Child", "blurb": "The world-famous Harvard psychologist challenges many of psychology's most deeply held assumptions about human development—arguing, for example, that early experience does not inexorably shape our lives and that the influence of the family is more subtle than has been supposed.\nThe world-famous Harvard psychologist challenges many of psychology's most deeply held assumptions about human development—arguing, for example, that early experience does not inexorably shape our lives and that the influence of the family is more subtle than has been supposed.\n...more", "genre": ["Psychology", "Childrens"], "author": "Jerome Kagan", "rating": "3.46", "pages": "352"}, {"id": 20052, "title": "Unstable Ideas: Temperament, Cognition, and Self", "blurb": "In his most probing and expansive work to date, Jerome Kagan--one of this country's leading psychologists--demonstrates that innovative research methods in the behavioral sciences and neurobiology, together with a renewed philosophical commitment to rigorous empiricism, are transforming our understanding of human behavior. Contemporary psychology, according to Kagan, has b\nIn his most probing and expansive work to date, Jerome Kagan--one of this country's leading psychologists--demonstrates that innovative research methods in the behavioral sciences and neurobiology, together with a renewed philosophical commitment to rigorous empiricism, are transforming our understanding of human behavior. Contemporary psychology, according to Kagan, has been preoccupied with three central themes: How malleable is temperament? How predictable are the milestones of cognitive development? How accurate is consciousness as a window onto the self, its motives, beliefs, and emotions?In a review of past approaches to these questions, Kagan argues persuasively that behavioral scientists have reached less-than-satisfactory answers because they have failed to appreciate the biases inherent in their frame of reference and the limitations of their investigative procedures. He calls into question a number of techniques that have been mainstays of psychological investigation: the Ainsworth Strange Situation for assessing the emotional attachment of an infant to its mother, and interviews and questionnaires as indexes of personality, to name only two. Kagan's own research has used novel laboratory situations to discover a group of children who exhibit a pattern of behavior he calls temperamentally inhibited--they are restless and irritable from birth, and by twenty-four months cling to the mother and show biological signs of high anxiety in unfamiliar situations.These findings, coupled with current understanding of the structure and chemistry of the nervous system, lead him to speculate that these children are born with a biological predisposition that favors the development of a shy, fearful personality. Through longitudinal studies of this kind, as well as through his cross-cultural investigations of cognitive development, Kagan has infused new meaning into the nature-nurture debate.\n...more", "genre": ["Psychology"], "author": "Jerome Kagan", "rating": "4.00", "pages": "328"}, {"id": 20055, "title": "Crazy Woman", "blurb": "Sane and shrewd and funny...The story of a woman whose captivity is divided equally between her life with her own people and her life among the Indians.LILLIAN SCHISSELAuthor of WOMEN'S DIARIES OF THE WESTWARD JOURNEYSara Franklin is an outcast among her own white people. Her thirst for knowledge and spirituality is threatening to both her abusive father and her neurotic\nSane and shrewd and funny...The story of a woman whose captivity is divided equally between her life with her own people and her life among the Indians.LILLIAN SCHISSELAuthor of WOMEN'S DIARIES OF THE WESTWARD JOURNEYSara Franklin is an outcast among her own white people. Her thirst for knowledge and spirituality is threatening to both her abusive father and her neurotic husband. When she is captured by the Apaches in New Mexico, they dub her Crazy Woman, and treat her like a slave. Yet, as she begins to learn the ways of her captors, she earns their respect as a strong, clever, even magical, woman. And when her innate sensual hunger is tempted, challenged, and finally satisfied by an Apache warrior, Sara finally embraces her whole self at last, body and soul....\n...more", "genre": ["Historical", "Historical Fiction"], "author": "Kate Horsley", "rating": "3.44", "pages": "280"}, {"id": 20182, "title": "Deadlock", "blurb": "This suspense novel asks what if a liberal Supreme Court Justice, and the all-important swing vote, has a religious conversion that changes her whole life -- and the way she views the law?", "genre": ["Christian Fiction", "Mystery", "Fiction", "Christian", "Legal Thriller", "Suspense", "Religion"], "author": "James Scott Bell", "rating": "4.00", "pages": "319"}, {"id": 20279, "title": "Understanding Bird Behaviour: A Birdwatcher's Guide", "blurb": "Recognizing how individual bird species behave can give vital clues to accurate identification. This book will help readers to do just that, and also understand why birds behave in a particular way. As an experienced birder himself, author Stephen Moss knows exactly what information is needed to make the reader's birdwatching more successful and rewarding. With authority, charity and enthusiasm, he investigates the fundamental types of behavior at each stage of a bird's life, how these vary between different species, and how they are influenced by outside factors such as habitat, weather and season. Readers will gain valuable insight into bird psychology and survival tactics, into feeding patterns mating displays and breeding, and into movement and migration. Life expectancy and death. The book also focuses on the bird themselves and describes the behaviours that are characteristic to each of them. Many full-color photographs and fine art illustrations capture the essential character of birds and the environments in which they live. Understanding Bird Behaviour is essential foundation reading for the novice birdwatchers, and valuable background reference for more experienced birders.", "genre": ["Birds", "Nonfiction", "Nature", "Ornithology"], "author": "Stephen  Moss", "rating": "3.84", "pages": "160"}, {"id": 20285, "title": "The Complete Garden Bird Book: How To Identify And Attract Birds To Your Garden", "blurb": "This reference combines full identification and behavioural features of over 70 common garden birds with detailed, highly visual information on attracting and encouraging birds to the garden. The book is illustrated in colour throughout and designed for ease of use.", "genre": ["Environment", "Nature", "Nonfiction"], "author": "Mark Golley", "rating": "3.84", "pages": "176"}, {"id": 20296, "title": "Kavik the Wolf Dog", "blurb": "For use in schools and libraries only. A wolf-dog instinctively travels 2,000 miles from Washington to Alaska to return to the boy who once saved his life.", "genre": ["Animals", "Fiction", "Young Adult", "Adventure", "Childrens", "Animals", "Dogs", "Historical", "Historical Fiction", "Childrens", "Middle Grade", "Animals", "Animal Fiction", "Historical"], "author": "Walt Morey", "rating": "4.14", "pages": "192"}, {"id": 20350, "title": "Anthology of Islamic Literature: From the Rise of Islam to Modern Times", "blurb": "Covering over thirteen centuries of Islamic writing, this quintessential anthology contains the most important and seminal works of the Islamic world. Told from all types of storytellers from different classes and cultures, these stories encompass the people and spirit of the fasting growing religion in the modern world.", "genre": ["Poetry", "Fiction"], "author": "James Kritzeck", "rating": "3.47", "pages": "400"}, {"id": 20424, "title": "Clown", "blurb": "One day, Clown is thrown into the trash, but he doesn't stay there long.He tries to find someone to take care of his friends, but no one listens.Then Clown finds someone he can take care of, and together, they make a home for everyone.Follow the fortunes of Clown-- who starts in a garbage can and ends up in a happy family-- in this perfectly pitched picture book.Master illustrator Quentin Blake has created an irrepressible character, an action-filled plot, and an eloquent story that can be read on several levels-- all without the use of a single word.Best Illustrated Book of 1996, New York Times Book ReviewHorn Book Fanfare Book", "genre": ["Picture Books", "Childrens", "Adventure", "Fiction", "Art", "Fantasy", "Family"], "author": "Quentin Blake", "rating": "3.98", "pages": "32"}, {"id": 20466, "title": "Lily-Josephine", "blurb": "Lily-Josephine had a talent for love. Wilful, enchanting and passionate, she was the centre of a charmed universe - until her father married again. One summer evening, in 1941, Lily ran from her jealous stepmother. She escaped to find sanctuary but, in Randalls, she discovered a love far greater than any she had ever known.", "genre": ["Fiction", "Romance"], "author": "Kate Saunders", "rating": "3.96", "pages": null}, {"id": 20516, "title": "Haunted Castles of the World: Ghostly Legends and Phenomena from Keeps and Fortresses Around the Globe", "blurb": "Dark spooky castles haunted by phantoms - what could be a more intriguing image? The ghost of Hamlet's father stalking the walls of Elsinore is burned into the mind of every literature student. Yet haunted castles do exist, and not just on lonely Scottish moors or German hillsides! On every continent - from the gothic keeps of Europe, to the exotic battlements of old Japan, to the lonely Castle of Good Hope in Cape Town - such places can be found.In Haunted Castles of the World, Charles A. Coulombe takes us on a global tour of the homes of the rich and ghoulish, examining the legends and the phenomena that have gained them the reputation for being haunted. Here you will meet the ghostly cast of characters who haunt these places, and where and why these hauntings occur. All the castles and palaces featured are accessible for public visits, and some are even open for overnight stays - if you dare! Whether you are planning an overseas vacation, or hunkering down in your favorite chair on a dark and stormy night, you are sure to find something in these pages to chill you.", "genre": ["Travel"], "author": "Charles A. Coulombe", "rating": "3.82", "pages": "288"}, {"id": 20627, "title": "American Country Furniture: Projects from the Workshops of David T. Smith", "blurb": "American Country Furniture provides woodworkers with all the information they need to reproduce 35 authentic country projects, including tables, chairs, chests, benches, and cabinets. In addition, 12 sidebars give comprehensive instruction on essential woodworking techniques like turning spindles and routing dovetails, and there's a chapter on how to reproduce genuine coun\nAmerican Country Furniture provides woodworkers with all the information they need to reproduce 35 authentic country projects, including tables, chairs, chests, benches, and cabinets. In addition, 12 sidebars give comprehensive instruction on essential woodworking techniques like turning spindles and routing dovetails, and there's a chapter on how to reproduce genuine country finishes. 375 illustrations. 155 photos.\n...more", "genre": ["Art", "Woodwork"], "author": "David T. Smith", "rating": "4.63", "pages": "328"}, {"id": 20652, "title": "Understanding the Grunfeld", "blurb": "Written by a leading expert in the Grunfeld defence, this is a thorough guide to an important chess opening, with explanations of the main themes for both sides.'\nWritten by a leading expert in the Grunfeld defence, this is a thorough guide to an important chess opening, with explanations of the main themes for both sides.'\n...more", "genre": ["Games", "Chess"], "author": "Jonathan Rowson", "rating": "4.38", "pages": "240"}, {"id": 20657, "title": "Some Ether", "blurb": "Winner of a Discovery/The Nation AwardWinner of the 1999 PEN/Joyce Osterweil Award for PoetrySome Ether is one of the more remarkable debut collections of poetry to appear in America in recent memory. As Mark Doty has noted, these poems are more than testimony; in lyrics of ringing clarity and strange precision, Flynn conjures a will to survive, the buoyant motion towar\nWinner of a Discovery/The Nation AwardWinner of the 1999 PEN/Joyce Osterweil Award for PoetrySome Ether is one of the more remarkable debut collections of poetry to appear in America in recent memory. As Mark Doty has noted, these poems are more than testimony; in lyrics of ringing clarity and strange precision, Flynn conjures a will to survive, the buoyant motion toward love which is sometimes all that saves us. Some Ether resonates in the imagination long after the final poem; this is a startling, moving debut.\n...more", "genre": ["Poetry", "Literature", "American", "Contemporary", "Fiction"], "author": "Nick Flynn", "rating": "4.15", "pages": "85"}, {"id": 20674, "title": "The Figure In The Carpet", "blurb": "This scarce antiquarian book is a facsimile reprint of the original. Due to its age, it may contain imperfections such as marks, notations, marginalia and flawed pages. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions that are true to the original work.", "genre": ["Classics", "Short Stories", "Fiction", "American", "19th Century", "Literature", "Gothic"], "author": "Henry James", "rating": "3.37", "pages": "Paperback"}, {"id": 20708, "title": "The Ordeal of Richard Feverel", "blurb": "Of all nineteenth-century English novels,  claims Edward Mendelson in his Introduction to this edition, The Ordeal of Richard Feverel is the most self-consciously literary in its style and structure and the most sexually explicit in its plot and theme. First published in 1859, Meredith's first and most controversial novel concerns Sir Austin Feverel's misconceived attem\nOf all nineteenth-century English novels,  claims Edward Mendelson in his Introduction to this edition, The Ordeal of Richard Feverel is the most self-consciously literary in its style and structure and the most sexually explicit in its plot and theme. First published in 1859, Meredith's first and most controversial novel concerns Sir Austin Feverel's misconceived attempts to educate his son Richard according to a system of his own devising - a system based on theories of sexual restraint. Exploring generational and gender conflicts, the psychology of sexual jealousy and repression, and myths of Eden and Utopia, The Ordeal of Richard Feverel shocked Victorian readers but gained for itself a cult following. Now that it has been freed from its reputation,  writes Mendelson, readers can discover again the tragic and ironic force, and the psychological and formal complexity that make The Ordeal of Richard Feverel one of the most profound, subtle, and moving works of English fiction.\n...more", "genre": ["Fiction", "Classics", "Literature", "19th Century", "Historical", "Victorian", "European Literature", "British Literature", "Literature", "Literature", "English Literature", "Literary Fiction", "Novels", "Classics", "Classic Literature"], "author": "George Meredith", "rating": "3.50", "pages": "560"}, {"id": 20776, "title": "A Convenient Marriage", "blurb": "Plain and intelligent heiress Beatrice Chaswell could hardly believe her luck when the incredibly handsome and kindly Earl of Faulconer, Gabriel Baxtor, actually began to court her. And in no time at all, the dashing earl had won Beatrice's heart. But Beatrice's joy soon turns to ashes when she discovers on her wedding day that Gabriel is actually a fortune hunter, and tha\nPlain and intelligent heiress Beatrice Chaswell could hardly believe her luck when the incredibly handsome and kindly Earl of Faulconer, Gabriel Baxtor, actually began to court her. And in no time at all, the dashing earl had won Beatrice's heart. But Beatrice's joy soon turns to ashes when she discovers on her wedding day that Gabriel is actually a fortune hunter, and that he has married her solely for her fortune. Angry and bitter, Beatrice turns against Gabriel, treating him with a coldness and disdain totally foreign to her warm nature.\n...more", "genre": ["Romance", "Historical", "Regency", "Romance", "Historical Romance", "Category Romance", "Traditional Regency", "Historical Romance", "Regency Romance"], "author": "Debbie Raleigh", "rating": "3.31", "pages": "221"}, {"id": 20821, "title": "Call to Treason", "blurb": "After years of fending off challenges from the world's most dangerous terrorists, Op-Centre has been brought to heel by the US Congress. A short-sighted committee has cut Paul Hood's budget, and the first victim is his friend Mike Rodgers. But General Rodgers may not be looking for work for very long. Dynamic Senator Donald Orr is making a run for President at the head of \nAfter years of fending off challenges from the world's most dangerous terrorists, Op-Centre has been brought to heel by the US Congress. A short-sighted committee has cut Paul Hood's budget, and the first victim is his friend Mike Rodgers. But General Rodgers may not be looking for work for very long. Dynamic Senator Donald Orr is making a run for President at the head of his own third party. Running on a platform of extreme isolationism, Orr presents a real challenge to the two-party system, and he needs a strong military advisor to make his team complete. The problem is that Orr may be involved in more than just ordinary political intrigue. The bodies of two murdered millionaires may be tied into the new party, and Op-Centre is seeking the killer.\n...more", "genre": ["Fiction", "Thriller", "Spy Thriller", "Espionage", "Adventure", "War", "Military Fiction", "Action", "Suspense", "Politics", "Presidents", "Mystery", "Crime", "Speculative Fiction"], "author": "Jeff Rovin", "rating": "4.00", "pages": "401"}, {"id": 20928, "title": "Phantoms", "blurb": "Here is a ghostly collection of tales that will have the original Phantom of the Opera singing a scary new tune. From backstage at the Paris Opera to the dark side of New York's high fashion scene, these are nightmare visions of obsessions fulfilled or thwarted.\nHere is a ghostly collection of tales that will have the original Phantom of the Opera singing a scary new tune. From backstage at the Paris Opera to the dark side of New York's high fashion scene, these are nightmare visions of obsessions fulfilled or thwarted.\n...more", "genre": ["Horror", "Anthologies"], "author": "Rosalind M. Greenberg", "rating": "3.29", "pages": "270"}, {"id": 20941, "title": "The Western Canon: The Books and School of the Ages", "blurb": "Literary critic Harold Bloom's The Western Canon is more than a required reading list—it is a vision. Infused with a love of learning, compelling in its arguments for a unifying written culture, it argues brilliantly against the politicization of literature and presents a guide to the great works of the western literary tradition and essential writers of the ages. The Western Canon was nominated for the National Book Critics Circle Award.", "genre": ["Nonfiction", "Literary Criticism", "History", "Literature", "Criticism", "Books About Books", "Philosophy"], "author": "Harold Bloom", "rating": "3.86", "pages": "546"}, {"id": 20970, "title": "Getting in the Gap", "blurb": "The practice of meditation takes us on a fabulous journey into the gap between our thoughts, where all the advantages of a more peaceful, stress-free, healthy, and fatigue-free life are available, but which are simply side benefits. The paramount reason for daily meditation is to get into the gap between our thoughts, and make conscious contact with the creative energy of \nThe practice of meditation takes us on a fabulous journey into the gap between our thoughts, where all the advantages of a more peaceful, stress-free, healthy, and fatigue-free life are available, but which are simply side benefits. The paramount reason for daily meditation is to get into the gap between our thoughts, and make conscious contact with the creative energy of life itself. Dr. Wayne W. Dyer explains the soul-nourishing meditation technique for making conscious contact with God, which the ancient masters have told us about.You have the potential to be an instrument of the highest good for all concerned and to be a literal miracle worker in your own life. No person, government, or religion can legitimately claim to do this for you. “In fact,” says Dr. Dyer, “I agree with Carl Jung who said, ‘One of the main functions of formalized religion is to protect people against a direct experience of God.’” When you master getting into the gap and staying there for prolonged segments of meditation, and experience what you bring back to the material world, you will know your answer to the question: “Why meditate?”\n...more", "genre": ["Spirituality", "Nonfiction", "Self Help", "Self Help", "Personal Development", "Spirituality", "New Age", "Health", "Philosophy", "Metaphysics"], "author": "Wayne W. Dyer", "rating": "4.11", "pages": "89"}, {"id": 21015, "title": "Dead Man's Chest", "blurb": "George can't deny the danger anymore. Leroy, the head of the underworld, knows who they are. But the clues are starting to come together and the treasure is only a map away. Will it be worth the risk?George and his friends know this isn't a just game of hide-and-seek anymore. There is a cursed diamond buried in the tunnels, and they are close to finding it. But Leroy and his thugs know who they are, and where they live. It's too big a risk to go on, but George won't give up. Sworn to protect each other by the Pyrate's Oath, the four friends vow to track down the last map -- the one that will complete the puzzle and lead them to the treasure. But as they take extra care to look out for one another, they don't realize they are putting others in danger.", "genre": ["Adventure", "Childrens", "Fiction"], "author": "Chris Archer", "rating": "4.08", "pages": "171"}, {"id": 21016, "title": "The Secret City", "blurb": "Spies. Underground tunnels. Old maps. New enemies. Pirate oaths. Hidden treasure. Endless danger.This series has real boy appeal. It has a fast pace, adventure, international intrigue, and more.George is fascinated by his family's legacy, the stories that link his ancestors to the infamous pirate Captain Kidd. But for 12 years, everyone has told him the stories are rumors. Now George has discovered the truth. And the truth is hidden in the web of tunnels mysteriously dug underneath his house in Manhattan. There are secrets to be revealed, friendships to be tested, and ancient injustices to be set right.George and his friends will sink deep underground to a secret city in search of treasure, but they'll find they aren't the only ones looking for it - and there's much more at stake.", "genre": ["Adventure", "Fiction", "Childrens", "Mystery"], "author": "Chris Archer", "rating": "4.11", "pages": "184"}, {"id": 21064, "title": "The Most Glorious Crown: The Story of America's Triple Crown Thoroughbreds from Sir Barton to Affirmed", "blurb": "The definitive work on this rare coronation, this book delves into the history, personalities, and subplots of each of the 11 Triple Crown champions. From Sir Barton in 1919 through Affirmed in 1978, each Triple Crown winner has exhibited a true personality and charisma befitting of super stardom and renowned author Marvin Drager's prose brings to life these 11 remarkable \nThe definitive work on this rare coronation, this book delves into the history, personalities, and subplots of each of the 11 Triple Crown champions. From Sir Barton in 1919 through Affirmed in 1978, each Triple Crown winner has exhibited a true personality and charisma befitting of super stardom and renowned author Marvin Drager's prose brings to life these 11 remarkable stories. The Most Glorious Crown is a unique and fascinating inspection of each champion, their jockeys, owners, and trainers, as well as a riveting account of each race and the events leading up to each historic event. This magnificent oversized book includes more than 150 archival, authentic black-and-white photographs of each thoroughbred throughout different stages of its career. It also includes actual racing forms from each race for the Triple Crown.\n...more", "genre": ["History", "Nonfiction", "Animals", "Horses", "Sports", "Horse Racing", "Animals"], "author": "Marvin Drager", "rating": "4.22", "pages": "304"}, {"id": 21072, "title": "Rembrandt's Eyes", "blurb": "The great 17th-century Dutch artist Rembrandt van Rijn left us so many arresting self-portraits, painted at every stage in his eventful life, that his distinctive face and bearing are a familiar part of the 20th-century cultural landscape, a recognizable presence in galleries across Europe and North America. Nonetheless, the artist himself remains an enigma. Rembrandt was \nThe great 17th-century Dutch artist Rembrandt van Rijn left us so many arresting self-portraits, painted at every stage in his eventful life, that his distinctive face and bearing are a familiar part of the 20th-century cultural landscape, a recognizable presence in galleries across Europe and North America. Nonetheless, the artist himself remains an enigma. Rembrandt was a notoriously difficult man and an inveterate risk taker in life and art: his aspirations to a grandiose Amsterdam lifestyle in the heyday of his popularity as a painter of portraits and large-scale historical works bankrupted him, and he died in relative poverty. His personal effects and treasured collection of paintings and natural rarities were sold off and dispersed, leaving the historian with a tantalizingly scant body of fragmentary records around which to build a convincing biography.  In Rembrandt's Eyes, Simon Schama--the leading historical craftsman of our era, with a career-long commitment to Dutch history--succeeds with consummate skill in bringing the heroic painter of such masterpieces as The Night Watch and Portrait of Jan Six vividly to life. Returning to the bustling Dutch world with which he first made his reputation in the bestselling Embarrassment of Riches (1987), Schama re-creates Rembrandt's life and times with all the verve and panache of a historical novelist--while never for an instant losing his scrupulous grip on recorded fact and detail. The telling surviving fragments of archival information about Rembrandt's personal and professional history are skillfully embedded in a rich, dense tapestry of the commercial whirl and political hurly-burly of the 17th-century Low Countries--a divided territory, split between the Catholic and Protestant faiths and the contested powers of the Spanish Hapsburgs and the Dutch Republic--with the tentacles of the tale reaching into the most unexpected shadowy corners of European love and war, aspiration and intrigue. Rembrandt's Eyes is, in fact, two biographies for the price of one. From the outset, Schama contrasts the life of Rembrandt with that of his older, equally talented countryman Peter Paul Rubens, whose meteoric rise and sustained success as a society painter forms a revealing contrast with Rembrandt's unhappier relationship with fame and fortune. The comparison is a telling one. Where Rubens furnishes the wealthy and powerful with glorious reflections of, and visual foils for, their social and political aspirations and glory, Rembrandt can never resist testing the envelope of taste and stylistic acceptability. His challenge to his clients to embrace the shock of his painterly experiments with technique, texture, and composition ultimately produced his downfall. The Amsterdam town council took down his The Oath-swearing of Claudius Civilis, rolled it up, and returned his masterpiece to him to be cut down in an attempt to sell it to a suitable buyer. This is a gorgeous book to own, too. Rembrandt's Eyes is printed on heavy, high-gloss paper and lavishly illustrated throughout in full color. The double-page color spreads of the most memorable of Rembrandt's works will take readers' breath away. But above all, this is narrative history at its very best, a page-turner and an adventure story that will make the reader laugh and cry by turns in the time-honored tradition of masterly writing. --Lisa Jardine \n...more", "genre": ["Art", "Biography", "History", "Nonfiction", "Art", "Art History", "Literature", "17th Century", "Reference", "History", "European History", "Unfinished", "Cultural"], "author": "Simon Schama", "rating": "4.14", "pages": "768"}, {"id": 21081, "title": "Positive Imaging: The Powerful Way to Change Your Life", "blurb": "The concept is a form of mental activity called imaging. It consists of vividly picturing in your mind a desired goal or objective and holding that image until it sinks into your unconscious mind, where it releases great untapped energies.Through Positive Imaging you will learn how to-- Solve your money problems-- Outwit worry-- Banish loneliness-- Improve your health-- St\nThe concept is a form of mental activity called imaging. It consists of vividly picturing in your mind a desired goal or objective and holding that image until it sinks into your unconscious mind, where it releases great untapped energies.Through Positive Imaging you will learn how to-- Solve your money problems-- Outwit worry-- Banish loneliness-- Improve your health-- Strengthen your marriage-- Relate to others more successfullyDiscover the power available to you through Positive Imaging.You can take control of your problems.You can command your life.This book is designed to help you do it -- and do it well.\n...more", "genre": ["Self Help", "Nonfiction", "Psychology", "Christian", "Self Help", "Personal Development", "Spirituality", "Religion", "Inspirational", "Business"], "author": "Norman Vincent Peale", "rating": "4.29", "pages": "192"}, {"id": 21133, "title": "DK First Atlas: A First Reference Guide to the Countries of the World", "blurb": "The DK First Atlas brings each continent and country to life, making geographic concepts easy to understand. Packed with detailed pictorial maps specially designed for young readers, this First Reference title is an invaluable learning tool for home and elementary school.", "genre": ["Science", "Geography"], "author": "Anita Ganeri", "rating": "4.37", "pages": "128"}, {"id": 21191, "title": "The Time Travelers: Volume One", "blurb": "Imagine changing centuries - and making things worse, not better, on both sides of time.Imagine being involved in two love triangles in two different centuries.Imagine discovering that, no matter which direction you travel in time, you must abandon someone you love.Meet fifteen-year-old Annie Lockwood, a romantic living in the wrong century. When she travels back a hundred years and lands in 1895, she at last finds romance.But she is a trespasser in time. Will she choose to stay in the past? And if she does, will she be allowed to stay?", "genre": ["Time Travel", "Young Adult", "Historical Fiction", "Romance", "Fantasy", "Fiction", "Science Fiction"], "author": "Caroline B. Cooney", "rating": "3.97", "pages": "420"}, {"id": 21236, "title": "The Prayer That Changes Everything: Prayer and Praise Journey", "blurb": "Whether as a gift or a personal keepsake, The Prayer That Changes Everything Prayer and Praise Journey is sure to be a valuable part of every devotional prayer time with the One who so graciously receives worship and adoration.", "genre": ["Spirituality", "Prayer", "Nonfiction"], "author": "Stormie Omartian", "rating": "4.64", "pages": "184"}, {"id": 21285, "title": "Dead I Well May Be", "blurb": "Listening Length: 12 hours and 25 minutesI didn't want to go to America, I didn't want to work for Darkey White. I had my reasons. But I went.So admits Michael Forsythe, an illegal immigrant escaping the troubles in Belfast, Northern Ireland. But young Michael is strong and fearless and clever, just the fellow to be tapped by Darkey, a crime boss, to join a gang of Irish\nListening Length: 12 hours and 25 minutesI didn't want to go to America, I didn't want to work for Darkey White. I had my reasons. But I went.So admits Michael Forsythe, an illegal immigrant escaping the troubles in Belfast, Northern Ireland. But young Michael is strong and fearless and clever, just the fellow to be tapped by Darkey, a crime boss, to join a gang of Irish thugs struggling against the rising Dominican powers in Harlem and the Bronx. The time is pre-Giuliani New York, when crack rules the city, squatters live furtively in ruined buildings, and hundreds are murdered each month. Michael and his lads tumble through the streets, shaking down victims, drinking hard, and fighting for turf, block by bloody block.Dodgy and observant, not to mention handy with a pistol, Michael is soon anointed by Darkey as his rising star. Meanwhile Michael has very inadvisably seduced Darkey's girl, Bridget, saucy, fickle, and irresistible. Michael worries that he's being followed, that his affair with Bridget will be revealed. He's right to be anxious; when Darkey discovers the affair, he plans a very hard fall for young Michael, a gambit devilish in its guile, murderous in its intent.But Darkey fails to account for Michael's toughness and ingenuity or the possibility that he might wreak terrible vengeance upon those who would betray him.A natural storyteller with a gift for dialogue, McKinty introduces to readers a stunning new noir voice, dark and stylish, mythic and violent, complete with an Irish lilt.©2003 Adrian McKinty; (P)2004 Blackstone Audiobooks\n...more", "genre": ["Mystery", "Crime", "Fiction", "Mystery", "Thriller", "Cultural", "Ireland", "Audiobook", "European Literature", "Irish Literature", "Mystery", "Noir", "Thriller", "Mystery Thriller", "Suspense"], "author": "Adrian McKinty", "rating": "3.96", "pages": null}, {"id": 21361, "title": "Strange Highways", "blurb": "One of the most popular and prolific writers of our time, Dean Koontz has penned many classic New York Times bestsellers, but nothing quite like this. Strange Highways is Koontz's spellbinding collection of tales interconnected by the strange highways of human experience -- the adventures, terrors, failures, and triumphs encountered on the roads that are chosen, and on those detoured by fate. As profound as it is mesmerizing, Strange Highways is a remarkable achievement.", "genre": ["Horror", "Fiction", "Thriller", "Short Stories", "Mystery", "Suspense", "Supernatural"], "author": "Dean Koontz", "rating": "3.87", "pages": "Audio"}, {"id": 21363, "title": "Ticktock", "blurb": "Tommy Phan is a successful detective novelist living the American Dream in southern California. One evening he comes home to find a small rag doll on his doorstep. It’s a simple doll, covered entirely in white cloth, with crossed black stitches for the eyes and mouth, and another pair forming an X over the heart. Curious, he brings it inside.That night Tommy hears an odd p\nTommy Phan is a successful detective novelist living the American Dream in southern California. One evening he comes home to find a small rag doll on his doorstep. It’s a simple doll, covered entirely in white cloth, with crossed black stitches for the eyes and mouth, and another pair forming an X over the heart. Curious, he brings it inside.That night Tommy hears an odd popping sound and looks up to see the stitches breaking over the doll’s heart. And in minutes the fabric of Tommy Phan’s reality will be torn apart. Something terrifying emerges from the pristine white cloth, something that will follow Tommy wherever he goes. Something that he can’t destroy. It wants Tommy’s life, and he doesn’t know why. He has only one ally, a beautiful, strangely intuitive waitress he meets by chance—or by a design far beyond his comprehension. He has too many questions, no answers, and very little time. Because the vicious and demonically clever doll has left this warning on Tommy’s computer screen:The deadline is dawn.TicktockTime is running out.From the Paperback edition.\n...more", "genre": ["Horror", "Fiction", "Thriller", "Mystery", "Suspense", "Fantasy", "Fantasy", "Paranormal", "Fantasy", "Supernatural", "Thriller", "Mystery Thriller", "Romance"], "author": "Dean Koontz", "rating": "3.74", "pages": "0"}, {"id": 21367, "title": "Midnight", "blurb": "In picturesque Moonlight Cove, California, inexplicable deaths occur and spine-tingling terror descends to this edge of paradise. Growing numbers of residents harbor a secret so dark it is sure to cost even more lives.Tessa Lockland comes to town to probe her sister's seemingly unprompted suicide. Independent and clever, she meets up with Sam Booker, an undercover FBI agent sent to Moonlight Cove to discover the truth behind the mysterious deaths. They meet Harry Talbot, a wheelchair-bound veteran, who has seen things from his window that he was not meant to see. Together they begin to understand the depth of evil in Moonlight Cove. Chrissie Foster, a resourceful eleven-year-old, running from her parents who have suddenly changed and in whom darkness dwells, joins them. Together they make a stand against darkness and terror.", "genre": ["Horror", "Fiction", "Thriller", "Suspense", "Mystery", "Science Fiction", "Fantasy"], "author": "Dean Koontz", "rating": "3.85", "pages": "Audio"}, {"id": 21370, "title": "The Good Guy", "blurb": "Timothy Carrier, having a beer after work at his friend's tavern, enjoys drawing eccentric customers into amusing conversations. But the jittery man who sits next to him tonight has mistaken Tim for someone very different--and passes to him a manila envelope full of cash. Ten thousand now. You get the rest when she's gone. The stranger walks out, leaving a photo of the pretty woman marked for death, and her address. But things are about to get worse. In minutes another stranger sits next to Tim. This one is a cold-blooded killer who believes Tim is the man who has hired him. Thinking fast, Tim says, I've had a change of heart. You get ten thousand--for doing nothing. Call it a no-kill fee. He keeps the photo and gives the money to the hired killer. And when Tim secretly follows the man out of the tavern, he gets a further shock: the hired killer is a cop. Suddenly, Tim Carrier, an ordinary guy, is at the center of a mystery of extraordinary proportions, the one man who can save an innocent life and stop a killer far more powerful than any cop...and as relentless as evil incarnate. But first Tim must discover within himself the capacity for selflessness, endurance, and courage that can turn even an ordinary man into a hero, inner resources that will transform his idea of who he is and what it takes to be The Good Guy. From the Hardcover edition.", "genre": ["Thriller", "Fiction", "Horror", "Mystery", "Suspense", "Mystery Thriller", "Crime"], "author": "Dean Koontz", "rating": "3.85", "pages": "9"}, {"id": 21381, "title": "Shadowfires", "blurb": "Rachel's request for a quick and clean divorce enraged her husband. She had never seen Eric so angry, so consumed by pure and terrifying hatred. Then, in the heat of the moment, Eric was struck down in a traffic accident. His death was instantaneous. Shocked and relieved, Rachel had nothing left to fear. Until Eric's body disappeared from the morgue - and Rachel was stalked by someone who looked like her dead husband...Shadowfires", "genre": ["Horror", "Fiction", "Thriller", "Suspense", "Mystery", "Mystery Thriller", "Science Fiction"], "author": "Leigh Nichols", "rating": "3.79", "pages": "Audio"}, {"id": 21383, "title": "Lightning", "blurb": "The first time the lightning strikes Laura Shane is born...The second time it strikes the terror starts... though eight-year-old Laura is saved by a mysterious stranger from the perverted and deadly intentions of a drug-crazed robber. Throughout her childhood she is plagued by ever more terrifying troubles, and with increasing courage she finds the strength to prevail - ev\nThe first time the lightning strikes Laura Shane is born...The second time it strikes the terror starts... though eight-year-old Laura is saved by a mysterious stranger from the perverted and deadly intentions of a drug-crazed robber. Throughout her childhood she is plagued by ever more terrifying troubles, and with increasing courage she finds the strength to prevail - even without the intervention of her strange guardian. But, despite her success as a novelist and her happy family life, Laura cannot shake the certainty that powerful and malignant forces are controlling her destiny.Then the lightning strikes once more and shatters her world. The adventure - and the terror - have only just begun...\n...more", "genre": ["Horror", "Fiction", "Thriller", "Science Fiction", "Science Fiction", "Time Travel", "Suspense", "Mystery", "Fantasy", "Thriller", "Mystery Thriller", "Audiobook"], "author": "Dean Koontz", "rating": "4.08", "pages": "384"}, {"id": 21387, "title": "Hannibal", "blurb": "You remember Hannibal Lecter: gentleman, genius, cannibal. Seven years have passed since Dr. Lecter escaped from custody. And for seven years he's been at large, free to savor the scents, the essences, of an unguarded world. But intruders have entered Dr. Lecter's world, piercing his new identity, sensing the evil that surrounds him. For the multimillionaire Hannibal left maimed, for a corrupt Italian policeman, and for FBI agent Clarice Starling, who once stood before Lecter and who has never been the same, the final hunt for Hannibal Lecter has begun. All of them, in their separate ways, want to find Dr. Lecter. And all three will get their wish. But only one will live long enough to savor the reward....From the Paperback edition.", "genre": ["Horror", "Fiction", "Thriller", "Crime", "Mystery", "Mystery Thriller", "Suspense"], "author": "Thomas  Harris", "rating": "3.80", "pages": "Audio"}, {"id": 21399, "title": "The Silence of the Lambs", "blurb": "A serial murderer known only by a grotesquely apt nickname—Buffalo Bill—is stalking women. He has a purpose, but no one can fathom it, for the bodies are discovered in different states. Clarice Starling, a young trainee at the FBI Academy, is surprised to be summoned by Jack Crawford, chief of the Bureau's Behavioral Science section. Her assignment: to interview Dr. Hannibal Lecter—Hannibal the Cannibal—who is kept under close watch in the Baltimore State Hospital for the Criminally Insane.Dr. Lecter is a former psychiatrist with a grisly history, unusual tastes, and an intense curiosity about the darker corners of the mind. His intimate understanding of the killer and of Clarice herself form the core of The Silence of the Lambs—an ingenious, masterfully written book and an unforgettable classic of suspense fiction.", "genre": ["Horror", "Fiction", "Thriller", "Mystery", "Crime", "Classics", "Mystery Thriller"], "author": "Thomas  Harris", "rating": "4.23", "pages": "421"}]