[{"id": 100000, "title": "The Best American Political Writing 2004: Special Election Year Edition", "blurb": "The Best American Political Writing 2004 preserves the most incisive, controversial, and entertaining writing about the notable events and people of 2003 and the first half of 2004. The past twelve months have provided no shortage of topics for heated political conversation. From Saddam's capture to Arnold's victory in the California recall election; from the controversy over Iraq's weapons of mass destruction to the contest for the Democratic presidential nomination, 2004 provided an excess of political fodder for commentary from all sides. Selections from the country's finest political writers, including Al Franken, Ron Suskind, Jonathan Chait, Jeffrey Toobin, George Will, Paul Krugman, George Packer, Charles Krauthammer, William Safire, Molly Ivins, Franklin Foer, Spencer Ackerman, Robert Kagan, Bill Kristol, and many others can be found in this volume. Gathering the best writings from the nation's leading publications, including the New York Times , Washington Post , The New Yorker , The Nation , Atlantic Monthly , New Republic , Weekly Standard , Foreign Affairs , Vanity Fair and Salon.com , as well as from think tanks such as the American Enterprise Institute and the Brookings Institution, Flippin culls the best writing on the year's most talked-about topics.", "genre": ["Politics"], "author": "Royce Flippin", "rating": "4.18", "pages": "400"}, {"id": 100001, "title": "Stephen Hawking's Universe", "blurb": "Este libro constituye la primera obra de divulgación sobre la vida y el trabajo de uno de los grandes genios de nuestro siglo, el excepcional científico Stephen Hawking. A través de sus páginas nos adentramos en el misterioso mundo de los agujeros negros y de los puntos del Universo -las singularidades- en los que el espacio y el tiempo se desintegran de forma total, y retrocedemos hasta el origen de los tiempos para asistir al Big Bang del que probablemente, surgió el Universo.", "genre": ["Science", "Nonfiction", "Physics", "Biography", "Astronomy", "Reference", "Popular Science"], "author": "John Boslough", "rating": "4.02", "pages": "127"}, {"id": 100002, "title": "Beyond The Black Hole: Stephen Hawking's Universe", "blurb": "Este libro constituye la primera obra de divulgación sobre la vida y el trabajo de uno de los grandes genios de nuestro siglo, el excepcional científico Stephen Hawking. A través de sus páginas nos adentramos en el misterioso mundo de los agujeros negros y de los puntos del Universo -las singularidades- en los que el espacio y el tiempo se desintegran de forma total, y retrocedemos hasta el origen de los tiempos para asistir al Big Bang del que probablemente, surgió el Universo.", "genre": ["Science", "Nonfiction", "Physics", "Biography", "Astronomy", "Reference", "Popular Science"], "author": "John Boslough", "rating": "4.02", "pages": "144"}, {"id": 100003, "title": "Stephen Hawking's Life Works: The Cambridge Lectures", "blurb": "This series of lectures, given at Cambridge University, introduces listeners to the history of ideas about the Universe as well as today's most important scientific theories about time, space, and the cosmos.", "genre": ["Science", "Physics", "Nonfiction"], "author": "Stephen Hawking", "rating": "4.37", "pages": "Audio"}, {"id": 100005, "title": "In Search of Schrödinger's Cat", "blurb": "Quantum theory is so shocking that Einstein could not bring himself to accept it. It is so important that it provides the fundamental underpinning of all modern sciences. Without it, we'd have no computers, no science of molecular biology, no understanding of DNA, no genetic engineering.In Search of Schrodinger's Cat tells the complete story of quantum mechanics, a truth stranger than any fiction. John Gribbin takes us step by step into an even more bizarre and fascinating place, requiring only that we approach it with an open mind. He introduces the scientists who developed quantum theory. He investigates the atom, radiation, time travel, the birth of the universe, super conductors and life itself. And in a world full of its own delights, mysteries and surprises, he searches for Schrodinger's Cat - a search for quantum reality - as he brings every reader to a clear understanding of the most important area of scientific study today - quantum physics.In Search of Schrodinger's Cat is a fascinating and delightful introduction to the strange world of the quantum - an essential element in understanding today's world.", "genre": ["Science", "Nonfiction", "Physics", "Popular Science", "Philosophy", "History", "Quantum Mechanics"], "author": "John Gribbin", "rating": "4.05", "pages": "302"}, {"id": 100006, "title": "Schrödinger's Kittens and the Search for Reality: Solving the Quantum Mysteries", "blurb": "In this eagerly anticipated sequel to the classic bestseller In Search of Schrodinger's Cat, John Gribbin digs even deeper into the mysterious and confounding world of quantum mechanics. Gribbin takes infinitely complex, mind-bending experiments, brings them to life, and makes them accessible to the lay reader. Under his deft guidance, we can begin to grasp the fundamental\nIn this eagerly anticipated sequel to the classic bestseller In Search of Schrodinger's Cat, John Gribbin digs even deeper into the mysterious and confounding world of quantum mechanics. Gribbin takes infinitely complex, mind-bending experiments, brings them to life, and makes them accessible to the lay reader. Under his deft guidance, we can begin to grasp the fundamental riddle of today's quantum mechanics: how a single photon can be seen going in two directions at once. Along the way, Gribbin reveals some fascinating discoveries: how quantum particles could one day be used in a Star Trek-type teleportation system, and how quantum cryptographers have developed ways of making unbreakable codes using quantum effects.Schrodinger's Kittens and the Search for Reality illuminates the world's most intriguing and enigmatic scientific phenomenon - and shows how the impossible dreams of such legendary scientists as Bohr, Feynman, and Einstein may soon become reality.\n...more", "genre": ["Science", "Science", "Physics", "Nonfiction", "Science", "Popular Science", "Physics", "Quantum Mechanics", "History", "Animals", "Cats", "Philosophy", "Humor", "Education"], "author": "John Gribbin", "rating": "4.06", "pages": "272"}, {"id": 100010, "title": "Beast of Never, Cat of God: The Search for the Eastern Puma", "blurb": "Somewhere between myth and reality, the truth behind America's last wild predator.\nSomewhere between myth and reality, the truth behind America's last wild predator.\n...more", "genre": ["Nonfiction", "Science", "Natural History"], "author": "Bob Butz", "rating": "3.19", "pages": "280"}, {"id": 100011, "title": "In Search of Schopenhauer's Cat: Arthur Schopenhauer's Quantum-Mystical Theory of Justice", "blurb": "Arthur Schopenhauer's theory of justice is radical. Justice, inSchopenhauer's system of thought, is not an epistemologicalconstruct. It is neither rights based nor process based. It rejects theconcept of individual moral duty as vehemently as it embraces theconcept of collective moral guilt. For Schopenhauer, justice is not away of assessing reality. It is a facet of reality itself. Schopenhauer'stheory of justice is ontology - a study of being itself. In this bookRaymond B. Marcin offers several reasons why a review and areevaluation of Schopenhauer's theory of justice are worthwhile now, almost two hundred years after it was first formulated", "genre": ["Philosophy"], "author": "Raymond B. Marcin", "rating": "3.38", "pages": "193"}, {"id": 100013, "title": "Witches, Ghosts, And Goblins: A Spooky Search For Miranda's Cat", "blurb": "", "genre": ["Young Readers", "Childrens", "Fiction", "Fantasy"], "author": "Ruthanna Long", "rating": "4.56", "pages": "First"}, {"id": 100014, "title": "Six Easy Pieces", "blurb": "With the love of a good woman and two beautiful children, Easy Rawlins has put his past life of trading favors behind him. Following the loss of his best friend and sidekick, Mouse, he wants to set an example for his children by earning an honest living. But trouble has a way of finding Easy on the mean streets of Watts. Easy wanders from schoolhouse to whorehouse as he is\nWith the love of a good woman and two beautiful children, Easy Rawlins has put his past life of trading favors behind him. Following the loss of his best friend and sidekick, Mouse, he wants to set an example for his children by earning an honest living. But trouble has a way of finding Easy on the mean streets of Watts. Easy wanders from schoolhouse to whorehouse as he is drawn into investigating the torching of Sojourner Truth, the Junior High School where he works, then the turning over of a local garage and the death of a prostitute. But no man is an island... His job, his lover, his comfortable house and the children he cherishes all count for nothing when the phone rings and a woman asks if he knows where Mouse is. Easy soon discovers that Mouse is as much of a moral challenge dead as alive. Rich in character and place, the stories reveal the complex nature of the American experience ? the issues of class and race, hope and despair, light and darkness. Six Easy Pieces is confirmation that Mosley?s vision continues to stretch and redefine the American canon.\n...more", "genre": ["Mystery", "Fiction", "Short Stories", "Mystery", "Crime", "Cultural", "African American", "Mystery", "Detective", "Thriller", "Mystery Thriller", "Historical", "Historical Fiction", "Thriller", "Anthologies", "Collections"], "author": "Walter Mosley", "rating": "4.10", "pages": null}, {"id": 100015, "title": "Bahama Crisis", "blurb": "Tom Mangan is the affluent proprietor of a number of luxury hotels in the Bahamas, whose future looks even brighter with the injection of fifty million dollars provided by a well-heeled Texan family. The day Mangan clinches the deal with his friend, Bill Cunningham, should be the happiest day of his life, but when his wife and daughter go missing at sea and a series of disasters befall his hotels, he begins to uncover a conspiracy to ruin him.", "genre": ["Thriller", "Fiction", "Adventure", "Mystery", "Action", "Suspense", "Crime"], "author": "Desmond Bagley", "rating": "3.64", "pages": "Audio"}, {"id": 100016, "title": "Indian Philosophy: A Very Short Introduction", "blurb": "India has a long, rich, and diverse tradition of philosophical thought, spanning some two and a half millennia and encompassing several major religious traditions.In this intriguing introduction to Indian philosophy, the diversity of Indian thought is emphasized. It is structured around six schools of thought that have received classic status. Sue Hamilton explores how the traditions have attempted to understand the nature of reality in terms of inner or spiritual quest and introduces distinctively Indian concepts, such as karma and rebirth. She also explains how Indian thinkers have understood issues of reality and knowledge--issues that are also an important part of the Western philosophical tradition.About the Series: Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam.", "genre": ["Philosophy", "Nonfiction", "India", "Religion", "Hinduism", "Buddhism", "History"], "author": "Sue Hamilton", "rating": "3.52", "pages": "168"}, {"id": 100017, "title": "Continental Philosophy: A Very Short Introduction", "blurb": "In this enlightening new Very Short Introduction, Simon Critchley shows us that Continental philosophy encompasses a distinct set of philosophical traditions and practices, with a compelling range of problems all too often ignored by the analytic tradition. He discusses the ideas and approaches of philosophers such as Kant, Hegel, Nietzsche, Husserl, Heidegger, Sartre, Hab\nIn this enlightening new Very Short Introduction, Simon Critchley shows us that Continental philosophy encompasses a distinct set of philosophical traditions and practices, with a compelling range of problems all too often ignored by the analytic tradition. He discusses the ideas and approaches of philosophers such as Kant, Hegel, Nietzsche, Husserl, Heidegger, Sartre, Habermas, Foucault, and Derrida. He also introduces key concepts such as existentialism, nihilism, and phenomonology, by explaining their place in the Continental tradition.The perfect guide for anyone interested in the great philosophers, this volume explains in lucid, straightforward language the split between Continental and Anglo-American philosophy and the importance of acknowledging Continental philosophy.About the Series:  Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam.\n...more", "genre": ["Philosophy", "Nonfiction", "History", "Philosophy", "Metaphysics", "Academic", "Modern", "Philosophy", "Theory", "Audiobook", "Academic", "Academia"], "author": "Simon Critchley", "rating": "3.73", "pages": "149"}, {"id": 100018, "title": "Political Philosophy: A Very Short Introduction", "blurb": "This Very Short Introduction introduces readers to the key concepts of political philosophy: authority, democracy, freedom and its limits, justice, feminism, multiculturalism, and nationality. Accessibly written and assuming no previous knowledge of the subject, it encourages the reader to think clearly and critically about the leading political questions of our time.Mille\nThis Very Short Introduction introduces readers to the key concepts of political philosophy: authority, democracy, freedom and its limits, justice, feminism, multiculturalism, and nationality. Accessibly written and assuming no previous knowledge of the subject, it encourages the reader to think clearly and critically about the leading political questions of our time.Miller first investigates how political philosophy tackles basic ethical questions such as 'how should we live together in society?' He furthermore looks at political authority, discusses the reasons society needs politics in the first place, explores the limitations of politics, and asks if there are areas of life that shouldn't be governed by politics. Moreover, he explores the connections between political authority and justice, a constant theme in political philosophy, and the ways in which social justice can be used to regulate rather than destroy a market economy.In his travels through this realm, Miller covers why nations are the natural units of government and wonders if the rise of multiculturalism and transnational co-operation will change all this, and asks in the end if we will ever see the formation of a world government.About the Series: Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam.\n...more", "genre": ["Philosophy", "Politics", "Nonfiction", "History", "Politics", "Political Science", "Reference", "Sociology", "Philosophy", "Theory", "Science", "Culture", "Society"], "author": "David    Miller", "rating": "3.70", "pages": "147"}, {"id": 100019, "title": "Ancient Philosophy: A Very Short Introduction", "blurb": "The tradition of ancient philosophy is a long, rich and varied one, in which the notes of discussion and argument constantly resound. This book aims to introduce readers to some ancient debates and to get them to engage with the ancient developments of some themes. Getting away from the presentation of ancient philosophy as a succession of Great Thinkers, the book aims to \nThe tradition of ancient philosophy is a long, rich and varied one, in which the notes of discussion and argument constantly resound. This book aims to introduce readers to some ancient debates and to get them to engage with the ancient developments of some themes. Getting away from the presentation of ancient philosophy as a succession of Great Thinkers, the book aims to give readers a sense of the freshness and liveliness of ancient philosophy, and of its wide variety of themes and styles.About the Author:Julia Annas is Professor of Philosophy at the University of Arizona and author of several books for OUP, including An Introduction to Platos Republic and The Morality of Happiness. She is also series editor for the Oxford Studies in Ancient Philosophy.\n...more", "genre": ["Philosophy", "Nonfiction", "History", "Classics", "History", "Ancient History", "Reference", "Literature", "Ancient", "Philosophy", "Theory", "Religion", "Philosophy", "Metaphysics"], "author": "Julia Annas", "rating": "3.61", "pages": "133"}, {"id": 100020, "title": "The Philosophy of Law: A Very Short Introduction", "blurb": "This lively and accessible introduction to the social, moral, and cultural foundations of law takes a broad scope-- spanning philosophy, law, politics, and economics, and discussing a range of topics including women's rights, racism, the environment, and recent international issues such as the war in Iraq and the treatment of terror suspects. Revealing the intriguing and challenging nature of legal philosophy with clarity and enthusiasm, Raymond Wacks explores the notion of law and its role in our lives. Referring to key thinkers from the classical world to the modern, he looks at the central questions behind legal theory that have always fascinated lawyers and philosophers, as well as anyone who ever wondered about law's relation to justice, morality, and democracy.About the Series: Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam.", "genre": ["Philosophy", "Law", "Nonfiction", "Politics", "Reference", "History", "Academic"], "author": "Raymond Wacks", "rating": "3.65", "pages": "144"}, {"id": 100021, "title": "What Does It All Mean? A Very Short Introduction to Philosophy", "blurb": "In this cogent and accessible introduction to philosophy, the distinguished author of Mortal Questions and The View From Nowhere sets forth the central problems of philosophical inquiry for the beginning student. Arguing that the best way to learn about philosophy is to think about itsquestions directly, Thomas Nagel considers possible solutions to nine problems--knowledge of the world beyond our minds, knowledge of other minds, the mind-body problem, free will, the basis of morality, right and wrong, the nature of death, the meaning of life, and the meaning of words. Althoughhe states his own opinions clearly, Nagel leaves these fundamental questions open, allowing students to entertain other solutions and encouraging them to think for themselves.", "genre": ["Philosophy", "Nonfiction", "Science", "School", "Academic", "Classics", "Essays"], "author": "Thomas Nagel", "rating": "3.64", "pages": "112"}, {"id": 100022, "title": "Quantum Physics: A Beginner's Guide", "blurb": "From quarks to computing, this fascinating introduction covers every element of the quantum world in clear and accessible language. Drawing on a wealth of expertise to explain just what a fascinating field quantum physics is, Rae points out that it is not simply a maze of technical jargon and philosophical ideas, but a reality which affects our daily lives.", "genre": ["Science", "Science", "Physics", "Nonfiction", "Physics", "Quantum Mechanics"], "author": "Alastair I.M. Rae", "rating": "3.78", "pages": "240"}, {"id": 100023, "title": "The Quantum World: Quantum Physics for Everyone", "blurb": "As Kenneth W. Ford shows us in The Quantum World, the laws governing the very small and the very swift defy common sense and stretch our minds to the limit. Drawing on a deep familiarity with the discoveries of the twentieth century, Ford gives an appealing account of quantum physics that will help the serious reader make sense of a science that, for all its successes, remains mysterious. In order to make the book even more suitable for classroom use, the author, assisted by Diane Goldstein, has included a new section of Quantum Questions at the back of the book. A separate answer manual to these 300+ questions is available; visit The Quantum World website for ordering information.There is also a cloth edition of this book, which does not include the Quantum Questions included in this paperback edition.", "genre": ["Science", "Physics", "Nonfiction", "Quantum Mechanics"], "author": "Kenneth W. Ford", "rating": "3.94", "pages": "330"}, {"id": 100024, "title": "Quantum Physics of Atoms, Molecules, Solids, Nuclei, and Particles", "blurb": "A revision of a successful junior/senior level text, this introduction to elementary quantum mechanics clearly explains the properties of the most important quantum systems. Emphasizes the applications of theory, and contains new material on particle physics, electron-positron annihilation in solids and the Mossbauer effect. Includes new appendices on such topics as crystallography, Fourier Integral Description of a Wave Group, and Time-Independent Perturbation Theory.", "genre": ["Physics", "Science", "Reference", "Nonfiction", "Textbooks", "Quantum Mechanics", "20th Century"], "author": "Robert M. Eisberg", "rating": "4.06", "pages": "864"}, {"id": 100025, "title": "An Introduction to Quantum Physics", "blurb": "Provides comprehensive coverage of all the fundamentals of quantum physics. Full mathematical treatments are given. Uses examples from different areas of physics to demonstrate how theories work in practice. Text derived from lectures delivered at Massachusetts Institute of Technology.", "genre": ["Science", "Physics", "Reference", "Textbooks", "Engineering", "Electrical Engineering", "Science", "Nonfiction"], "author": "Anthony P. French", "rating": "3.96", "pages": "696"}, {"id": 100026, "title": "Mathematics of Classical and Quantum Physics", "blurb": "This textbook is designed to complement graduate-level physics texts in classical mechanics, electricity, magnetism, and quantum mechanics. Organized around the central concept of a vector space, the book includes numerous physical applications in the body of the text as well as many problems of a physical nature. It is also one of the purposes of this book to introduce th\nThis textbook is designed to complement graduate-level physics texts in classical mechanics, electricity, magnetism, and quantum mechanics. Organized around the central concept of a vector space, the book includes numerous physical applications in the body of the text as well as many problems of a physical nature. It is also one of the purposes of this book to introduce the physicist to the language and style of mathematics as well as the content of those particular subjects with contemporary relevance in physics.Chapters 1 and 2 are devoted to the mathematics of classical physics. Chapters 3, 4 and 5 — the backbone of the book — cover the theory of vector spaces. Chapter 6 covers analytic function theory. In chapters 7, 8, and 9 the authors take up several important techniques of theoretical physics — the Green's function method of solving differential and partial differential equations, and the theory of integral equations. Chapter 10 introduces the theory of groups. The authors have included a large selection of problems at the end of each chapter, some illustrating or extending mathematical points, others stressing physical application of techniques developed in the text.Essentially self-contained, the book assumes only the standard undergraduate preparation in physics and mathematics, i.e. intermediate mechanics, electricity and magnetism, introductory quantum mechanics, advanced calculus and differential equations. The text may be easily adapted for a one-semester course at the graduate or advanced undergraduate level.\n...more", "genre": ["Science", "Physics", "Science", "Mathematics", "Science", "Reference", "Textbooks", "Nonfiction"], "author": "Frederick W. Byron Jr.", "rating": "4.27", "pages": "672"}, {"id": 100027, "title": "Quantum Enigma: Physics Encounters Consciousness", "blurb": "The most successful theory in all of science--and the basis of one third of our economy--says the strangest things about the world and about us. Can you believe that physical reality is created by our observation of it? Physicists were forced to this conclusion, the quantum enigma, by what they observed in their laboratories.Trying to understand the atom, physicists built \nThe most successful theory in all of science--and the basis of one third of our economy--says the strangest things about the world and about us. Can you believe that physical reality is created by our observation of it? Physicists were forced to this conclusion, the quantum enigma, by what they observed in their laboratories.Trying to understand the atom, physicists built quantum mechanics and found, to their embarrassment, that their theory intimately connects consciousness with the physical world. Quantum Enigma explores what that implies and why some founders of the theory became the foremost objectors to it. Schr�dinger showed that it absurdly allowed a cat to be in a superposition simultaneously dead and alive. Einstein derided the theory's spooky interactions. With Bell's Theorem, we now know Schr�dinger's superpositions and Einstein's spooky interactions indeed exist.Authors Bruce Rosenblum and Fred Kuttner explain all of this in non-technical terms with help from some fanciful stories and bits about the theory's developers. They present the quantum mystery honestly, with an emphasis on what is and what is not speculation.Physics' encounter with consciousness is its skeleton in the closet. Because the authors open the closet and examine the skeleton, theirs is a controversial book. Quantum Enigma's description of the experimental quantum facts, and the quantum theory explaining them, is undisputed. Interpreting what it all means, however, is controversial.Every interpretation of quantum physics encounters consciousness. Rosenblum and Kuttner therefore turn to exploring consciousness itself--and encounter quantum physics. Free will and anthropic principles become crucial issues, and the connection of consciousness with the cosmos suggested by some leading quantum cosmologists is mind-blowing.Readers are brought to a boundary where the particular expertise of physicists is no longer a sure guide. They will find, instead, the facts and hints provided by quantum mechanics and the ability to speculate for themselves.\n...more", "genre": ["Science", "Science", "Physics", "Nonfiction", "Philosophy", "Physics", "Quantum Mechanics", "Spirituality", "Psychology", "Science", "Popular Science", "Biology", "Neuroscience", "Reference", "Research"], "author": "Bruce Rosenblum", "rating": "4.11", "pages": "224"}, {"id": 100028, "title": "Quantum Physics: A First Encounter: Interference, Entanglement, and Reality", "blurb": "Quantum physics is often perceived as a weird and abstract theory, which physicists must use in order to make correct predictions. But many recent experiments have shown that the weirdness of the theory simply mirrors the weirdness of phenomena: it is Nature itself, and not only our description of it, that behaves in an astonishing way. This book selects those, among these typical quantum phenomena, whose rigorous description requires neither the formalism, nor an important background in physics.The first part of the book deals with the phenomenon of single-particle interference, covering the historical questions of wave-particle duality, objective randomness and the boundary between the quantum and the classical world, but also the recent idea of quantum cryptography. The second part introduces the modern theme of entanglement, by presenting two-particle interference phenomena and discussing Bell's inequalities. A concise review of the main interpretations of quantum physics is provided.", "genre": ["Physics", "Science"], "author": "Valerio Scarani", "rating": "3.76", "pages": "144"}, {"id": 100029, "title": "The Physics of Quantum Information: Quantum Cryptography, Quantum Teleportation, Quantum Computation", "blurb": "Leading experts from The Physics of Quantum Information network, initiated by the European Commission, bring together the most recent results from this emerging area of quantum technology. Written in a consistent style as a research monograph, the book introduces quantum cryptography, quantum teleportation, and quantum computation, considering both theory and newest experiments. Both scientists working in the field and advanced students will find a rich source of information on this exciting new area.", "genre": ["Physics"], "author": "Dirk Bouwmeester", "rating": "3.64", "pages": "315"}, {"id": 100030, "title": "PSIence: How New Discoveries in Quantum Physics and New Science May Explain the Mysteries of Paranormal Phenomenom", "blurb": "Are poltergeists energy fluctuations in the Zero Point Field?Could even the simple experience of déjà vu be explained by the quantum theory of parallel universes?Do thoughts have the energy to manifest and move physical objects?PSIence introduces readers to the latest discoveries in quantum physics and New Science that may explain the existence of paranormal phenomena--UFO\nAre poltergeists energy fluctuations in the Zero Point Field?Could even the simple experience of déjà vu be explained by the quantum theory of parallel universes?Do thoughts have the energy to manifest and move physical objects?PSIence introduces readers to the latest discoveries in quantum physics and New Science that may explain the existence of paranormal phenomena--UFOs, ghosts, poltergeists, mysterious apparitions, time anomalies, the Bermuda Triangle, energy vortices--and psychic abilities such as ESP, telekinesis, remote viewing, and recalling past lives.You'll explore the cutting-edge ideas that are fascinating both scientists and paranormal investigators, including:The latest theories of multiple universes and eleven dimensions.The Zero Point Field--is it the potential source of all creative energy?The potential of every human being to experience the paranormalMany of the world's leading scientists, researchers, philosophers and spiritual leaders--from noted physicists like Michio Kaku to the revered Dalai Lama--are beginning to accept the possibility of alternate realities and dimensions that warp time and space. PSIence takes the reader on a journey to where the normal and the paranormal intersect, where the known and unknown converge, where science greets the supernatural.\n...more", "genre": ["Fantasy", "Paranormal", "Nonfiction", "Science", "History"], "author": "Marie D.  Jones", "rating": "3.70", "pages": "256"}, {"id": 100032, "title": "The Meaning Of Quantum Theory: A Guide For Students Of Chemistry And Physics", "blurb": "Why is quantum theory so difficult to understand? In this book, written for both undergraduate and graduate students of chemistry and physics, the author looks at the continuing debate about the meaning of quantum theory. The historical development of the theory is traced from the turn ofthe century through to the 1930s, and the famous debate between Niels Bohr and Albert Einstein. The book examines in detail the arguments that quantum theory is incomplete, as made by Einstein, Boris Podolsky, and Nathan Rosen; the development of Bell's theorem; and crucial experimental testsperformed in the early 1980s. Alternative interpretations -- pilot waves, quantum gravity, consciousness, and many worlds -- are described in the closing chapter. This is an ideal text for advanced undergraduate and graduate students of chemistry and physics, and for academic scientists notinvolved in mainstream quantum theory.", "genre": ["Science", "Physics", "Quantum Mechanics", "Nonfiction"], "author": "Jim Baggott", "rating": "4.16", "pages": "Hardcover"}, {"id": 100033, "title": "A Guide to Physics Problems: Part 2: Thermodynamics, Statistical Physics, and Quantum Mechanics", "blurb": "An excellent study resource, this second of two volumes features 182 problems taken from Ph.D. exams at notable American universities and Moscow Phys-Tech. Like its acclaimed companion, Part 2 presents detailed solutions with step-by-step calculations, textbook references for further study, clear illustrations, and an easy-to-use layout.\nAn excellent study resource, this second of two volumes features 182 problems taken from Ph.D. exams at notable American universities and Moscow Phys-Tech. Like its acclaimed companion, Part 2 presents detailed solutions with step-by-step calculations, textbook references for further study, clear illustrations, and an easy-to-use layout.\n...more", "genre": ["Science", "Physics"], "author": "Sidney B. Cahn", "rating": "4.20", "pages": "354"}, {"id": 100034, "title": "Quantum: A Guide for the Perplexed", "blurb": "In this lively look at quantum science, a physicist takes an entertaining and enlightening journey through the basics of subatomic physics Along the way he examines the paradox of quantum mechanics—beautifully mathematical in theory but confoundingly unpredictable in the real world. Marvel at the Dual Slit experiment as a tiny atom passes through 2 separate openings at the\nIn this lively look at quantum science, a physicist takes an entertaining and enlightening journey through the basics of subatomic physics Along the way he examines the paradox of quantum mechanics—beautifully mathematical in theory but confoundingly unpredictable in the real world. Marvel at the Dual Slit experiment as a tiny atom passes through 2 separate openings at the same time. Ponder the peculiar communication of quantum particles, which can remain in touch no matter how far apart. Join the genius jewel thief as he carries out a quantum measurement on a diamond without ever touching the object in question. With its clean, colorful layout and conversational tone, this text will hook you into the conundrum that is quantum mechanics.\n...more", "genre": ["Science", "Science", "Physics", "Nonfiction", "Science", "Popular Science", "Physics", "Quantum Mechanics", "Reference", "Audiobook", "Philosophy", "Space", "Adult"], "author": "Jim Al-Khalili", "rating": "4.14", "pages": "280"}, {"id": 100035, "title": "A Guide to Experiments in Quantum Optics", "blurb": "This revised and broadened second edition provides readers with an insight into this fascinating world and future technology in quantum optics. Alongside classical and quantum-mechanical models, the authors focus on important and current experimental techniques in quantum optics to provide an understanding of light, photons and laserbeams. In a comprehensible and lucid sty\nThis revised and broadened second edition provides readers with an insight into this fascinating world and future technology in quantum optics. Alongside classical and quantum-mechanical models, the authors focus on important and current experimental techniques in quantum optics to provide an understanding of light, photons and laserbeams. In a comprehensible and lucid style, the book conveys the theoretical background indispensable for an understanding of actual experiments using photons. It covers basic modern optical components and procedures in detail, leading to experiments such as the generation of squeezed and entangled laserbeams, the test and applications of the quantum properties of single photons, and the use of light for quantum information experiments.\n...more", "genre": ["Science", "Physics"], "author": "Hans-A. Bachor", "rating": "3.00", "pages": "434"}, {"id": 100036, "title": "A Guide to Quantum Groups", "blurb": "Since they first arose in the 1970s and early 1980s, quantum groups have proved to be of great interest to mathematicians and theoretical physicists. This book gives a comprehensive view of quantum groups and their applications. The authors build on a self-contained account of the foundations of the subject and go on to treat the more advanced aspects concisely and with detailed references to the literature. Researchers in mathematics and theoretical physics will enjoy this book.", "genre": ["Mathematics"], "author": "Vyjayanthi Chari", "rating": "5.00", "pages": "667"}, {"id": 100037, "title": "Quantum Mechanics", "blurb": "Quantum mechanics is one of the great success stories of modern physics, making sense of the very small just as Einstein's theory of relativity made sense of the very large. But, for most students, the ideas that make quantum mechanics powerful can be confusing and counterintuitive. This volume in the Greenwood Guides to Great Ideas in Science series provides a history of quantum mechanics from the early breakthroughs of Planck and Einstein, at the beginning of the 20th century, to the present frontiers of quantum computing and quantum gravity. The approach is entirely non-technical, and is aimed at the general reader who may not have much mathematical background but who has a strong curiosity about some of the most important developments in modern science.Quantum Mechanics: A Historical Perspective traces the history of this powerful theory, including:; The early discoveries by Max Planck and Albert Einstein regarding the quantization of radiation; The early quantum theory, including Neils Bohr's theory of the atom; The birth of modern quantum mechanics through the work of Heisenberg, Schrodinger, Born, Dirac and others; Applications of quantum mechanics in chemistry, nuclear physics, electronics, and many other areas; Recent work in quantum computation and quantum information theoryThe book emphasizes the fact that despite the great success of quantum mechanics, many exciting intellectual frontiers remain open for further researchers to explore. It includes a glossary, a timeline, and a bibliography of accessible resources for further research.", "genre": ["Physics"], "author": "Kent Peacock", "rating": "0.00", "pages": "224"}, {"id": 100038, "title": "Bluff Your Way in the Quantum Universe", "blurb": "While the physicists do have knowledge and understanding, such an appreciation may be obtained without formulae, equations, or fractions. The bluffer is going to have to feign, find, or affirm some sense of wonder.", "genre": ["Nonfiction", "Science"], "author": "Anne Taute", "rating": "3.81", "pages": "64"}, {"id": 100039, "title": "The Visionary Window: A Quantum Physicist's Guide to Enlightenment", "blurb": "Does God exist? Can spirituality be integrated with science? Is happiness possible? Do miracles really happen? Not only does The Visionary Window answer yes to all of these questions, but it skillfully combines the fields of philosophy, cosmology, religion, and psychology to form a new way of thinking about science and spirituality. Stepping beyond the classic work of pr\nDoes God exist? Can spirituality be integrated with science? Is happiness possible? Do miracles really happen? Not only does The Visionary Window answer yes to all of these questions, but it skillfully combines the fields of philosophy, cosmology, religion, and psychology to form a new way of thinking about science and spirituality. Stepping beyond the classic work of prominent seventies physicist Fritjof Capra, Goswami details his own pioneering exploration of science and spirit, revealing the complete integration between modern science and spiritual traditions. Using stories and colorful examples from pop culture, Goswami addresses complex issues in language and terminology easily accessible to the lay reader. He provides quantum physics-based theory and new experimental data verifying the metaphysical truth that exists when employed in the context of a new science, science within the primacy of consciousness. With a new holistic worldview, Goswami also discusses the creativity of the body to self heal; the power of spiritual practice and how to choose a meditative path; and the five stages of spiritual growth, culminating in the ability to transcend the physical laws of nature. Readers, scientists and spiritual leaders alike will find answers to many of life's deepest mysteries.\n...more", "genre": ["Nonfiction", "Science", "Spirituality", "Philosophy", "Metaphysics", "Philosophy"], "author": "Amit Goswami", "rating": "4.03", "pages": "339"}, {"id": 100040, "title": "Exploring the Physics of the Unknown Universe: An Adventurer's Guide", "blurb": "Follow a trail of scientific clues and ideas from the Greeks to Newton, Mach, Clifford, Einstein, Dirac, Feynman, and beyond to modern galactic astronomy, as Wolff conducts an investigation of the fundamental particles and their relationship to the structure of the universe, proposing an answer to the question, Is there a unification theory of physics? 46 illustrations. (Technotran Press)", "genre": ["Science"], "author": "Milo Wolff", "rating": "4.53", "pages": "251"}, {"id": 100041, "title": "Schaum's Outline of Quantum Mechanics", "blurb": "Confusing Textbooks? Missed Lectures? Not Enough Time?Fortunately for you, there's Schaum's Outlines. More than 40 million students have trusted Schaum's to help them succeed in the classroom and on exams. Schaum's is the key to faster learning and higher grades in every subject. Each Outline presents all the essential course information in an easy-to-follow, topic-by-topi\nConfusing Textbooks? Missed Lectures? Not Enough Time?Fortunately for you, there's Schaum's Outlines. More than 40 million students have trusted Schaum's to help them succeed in the classroom and on exams. Schaum's is the key to faster learning and higher grades in every subject. Each Outline presents all the essential course information in an easy-to-follow, topic-by-topic format. You also get hundreds of examples, solved problems, and practice exercises to test your skills.This Schaum's Outline gives you Practice problems with full explanations that reinforce knowledge Coverage of the most up-to-date developments in your course field In-depth review of practices and applicationsFully compatible with your classroom text, Schaum's highlights all the important facts you need to know. Use Schaum's to shorten your study time-and get your best test scoresSchaum's Outlines-Problem Solved.\n...more", "genre": ["Science", "Physics", "Science", "Physics", "Quantum Mechanics", "Textbooks"], "author": "Yoav Peleg", "rating": "3.72", "pages": "320"}, {"id": 100042, "title": "Schaum's Outline of Modern Physics", "blurb": "Tough Test Questions? Missed Lectures? Not Enough Time?Fortunately for you, there's Schaum's Outlines. More than 40 million students have trusted Schaum's to help them succeed in the classroom and on exams. Schaum's is the key to faster learning and higher grades in every subject. Each Outline presents all the essential course information in an easy-to-follow, topic-by-topic format. You also get hundreds of examples, solved problems, and practice exercises to test your skills.This Schaum's Outline gives youPractice problems with full explanations that reinforce knowledgeCoverage of the most up-to-date developments in your course fieldIn-depth review of practices and applicationsFully compatible with your classroom text, Schaum's highlights all the important facts you need to know. Use Schaum's to shorten your study time-and get your best test scores!Schaum's Outlines-Problem Solved.", "genre": ["Physics", "Science"], "author": "Ronald Gautreau", "rating": "3.87", "pages": "360"}, {"id": 100043, "title": "Quantum Zoo: A Tourist's Guide to the Neverending Universe", "blurb": "Clueless about quantum theory or the theory of relativity? Let an experienced science communicator bring you up to speed on some of the greatest ideas in the history of human thought.", "genre": ["Science", "Physics", "Nonfiction", "Popular Science", "Reference"], "author": "Marcus Chown", "rating": "4.04", "pages": "Paperback"}, {"id": 100044, "title": "The Quantum Zoo: A Tourist's Guide to the Neverending Universe", "blurb": "The two towering achievements of modern physics are quantum theory and Einstein's general theory of relativity. Together, they explain virtually everything about the world we live in. But, almost a century after their advent, most people haven't the slightest clue what either is about. Did you know that there's so much empty space inside matter that the entire human race c\nThe two towering achievements of modern physics are quantum theory and Einstein's general theory of relativity. Together, they explain virtually everything about the world we live in. But, almost a century after their advent, most people haven't the slightest clue what either is about. Did you know that there's so much empty space inside matter that the entire human race could be squeezed into the volume of a sugar cube? Or that you grow old more quickly on the top floor of a building than on the ground floor? And did you realize that 1 per cent of the static on a TV tuned between stations is the relic of the Big Bang? These and many other remarkable facts about the world are direct consequences of quantum physics and relativity. Quantum theory has literally made the modern world possible. Not only has it given us lasers, computers, and nuclear reactors, but it has provided an explanation of why the sun shines and why the ground beneath our feet is solid. Despite this, however, quantum theory and relativity remain a patchwork of fragmented ideas, vaguely understood at best and often utterly mysterious. average person. Author Marcus Chown emphatically disagrees. As Einstein himself said, Most of the fundamental ideas of science are essentially simple and may, as a rule, be expressed in a language comprehensible to everyone. If you think that the marvels of modern physics have passed you by, it is not too late. In Chown's capable hands, quantum physics and relativity are not only painless but downright fun. So sit back, relax, and get comfortable as an adept and experienced science communicator brings you quickly up to speed on some of the greatest ideas in the history of human thought.\n...more", "genre": ["Science", "Science", "Physics", "Nonfiction", "Science", "Popular Science", "Reference"], "author": "Marcus Chown", "rating": "4.04", "pages": "200"}, {"id": 100046, "title": "The Chaos Cookbook", "blurb": "One of the bestselling books on Chaos/Fractals examines chaos theory in a much more practical way than other books. Chaos is not just a way of generating computer graphics, or a mathematical curiosity. It has relevance to the real world and the easiest way to explore and visualize chaos is on the computer screen.", "genre": ["Programming"], "author": "Joe Pritchard", "rating": "0.00", "pages": "487"}, {"id": 100047, "title": "Schaum's Easy Outline of Quantum Mechanics", "blurb": "For a quick nuts-and-bolts overview of quantum mechanics, there's no book that does it betterPared-down, simplified, and tightly focused, Schaum's Easy Outline of Quantum Mechanics is perfect for anyone turned off by dense text. Cartoons, sidebars, icons, and other graphic pointers get the material across fast, and concise text focuses on the essence of quantum mechanics. \nFor a quick nuts-and-bolts overview of quantum mechanics, there's no book that does it betterPared-down, simplified, and tightly focused, Schaum's Easy Outline of Quantum Mechanics is perfect for anyone turned off by dense text. Cartoons, sidebars, icons, and other graphic pointers get the material across fast, and concise text focuses on the essence of quantum mechanics. This is the ideal book for last-minute test preparation.\n...more", "genre": ["Science", "Physics", "Science"], "author": "Eliahu Zaarur", "rating": "3.40", "pages": "160"}, {"id": 100049, "title": "Quantum Theory: A Very Short Introduction", "blurb": "Quantum Theory is the most revolutionary discovery in physics since Newton. This book gives a lucid, exciting, and accessible account of the surprising and counterintuitive ideas that shape our understanding of the sub-atomic world. It does not disguise the problems of interpretation that still remain unsettled 75 years after the initial discoveries. The main text makes no\nQuantum Theory is the most revolutionary discovery in physics since Newton. This book gives a lucid, exciting, and accessible account of the surprising and counterintuitive ideas that shape our understanding of the sub-atomic world. It does not disguise the problems of interpretation that still remain unsettled 75 years after the initial discoveries. The main text makes no use of equations, but there is a Mathematical Appendix for those desiring stronger fare. Uncertainty, probabilistic physics, complementarity, the problematic character of measurement, and decoherence are among the many topics discussed. This volume offers the reader access to one of the greatest discoveries in the history of physics and one of the outstanding intellectual achievements of the twentieth century.About the Series: Combining authority with wit, accessibility, and style,  Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam.\n...more", "genre": ["Science", "Science", "Physics", "Nonfiction", "Philosophy", "Science", "Popular Science", "Physics", "Quantum Mechanics", "History", "Audiobook", "Reference", "Science", "Chemistry"], "author": "John C. Polkinghorne", "rating": "3.77", "pages": "113"}, {"id": 100050, "title": "Miss Nelson Is Missing!", "blurb": "Miss Nelson is Missing - Listen and learn with carry along books and cassette favorites", "genre": ["Childrens", "Picture Books", "Childrens", "Fiction", "Academic", "School", "Humor", "Classics", "Mystery", "Realistic Fiction", "Kids", "Childrens", "Juvenile"], "author": "Harry Allard", "rating": "4.30", "pages": "32"}, {"id": 100052, "title": "Austerlitz", "blurb": "Wer ist Austerlitz? Ein rätselhafter Fremder, der immer wieder an den ungewöhnlichsten Orten auftaucht: am Bahnhof, am Handschuhmarkt, im Industriequartier ... Und jedes Mal erzählt er ein Stück mehr von seiner Lebensgeschichte, der Geschichte eines unermüdlichen Wanderers durch unsere Kultur und Architektur und der Geschichte eines Mannes, dem als Kind Heimat, Sprache und\nWer ist Austerlitz? Ein rätselhafter Fremder, der immer wieder an den ungewöhnlichsten Orten auftaucht: am Bahnhof, am Handschuhmarkt, im Industriequartier ... Und jedes Mal erzählt er ein Stück mehr von seiner Lebensgeschichte, der Geschichte eines unermüdlichen Wanderers durch unsere Kultur und Architektur und der Geschichte eines Mannes, dem als Kind Heimat, Sprache und Name geraubt wurden.\n...more", "genre": ["Fiction", "Historical", "Historical Fiction", "European Literature", "German Literature", "Cultural", "Germany", "Novels", "Literature", "World War II", "Holocaust", "War", "Historical", "Classics"], "author": "W.G. Sebald", "rating": "3.99", "pages": "421"}, {"id": 100067, "title": "Graphic Classics, Volume 10: Horror Classics", "blurb": "Horror Classics is an anthology of great fiction adapted in comics form for readers of all ages. This tenth volume of the Graphic Classics series presents stories by eleven of the original creators of the horror genre, including H.P. Lovecraft's The Thing on the Doorstep, Edgar Allan Poe's Some Words with a Mummy, and W.W. Jacobs' The Monkey's Paw. Plus Saki, Balzac,\nHorror Classics is an anthology of great fiction adapted in comics form for readers of all ages. This tenth volume of the Graphic Classics series presents stories by eleven of the original creators of the horror genre, including H.P. Lovecraft's The Thing on the Doorstep, Edgar Allan Poe's Some Words with a Mummy, and W.W. Jacobs' The Monkey's Paw. Plus Saki, Balzac, Jack London, Olive Schreiner, Bret Harte, Howard Garis, Fitz-James O'Brien and Clark Ashton Smith. With art by Michael Manning, Richard Jenkins, Gabrielle Bell, Ryan Inzana and nine more great illustrators.\n...more", "genre": ["Horror", "Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "Fantasy", "Graphic Novels Comics", "Short Stories", "Classics", "Young Adult", "Fiction"], "author": "Tom Pomplun", "rating": "3.20", "pages": "144"}, {"id": 100085, "title": "At the Mountains of Madness and Other Novels of Terror", "blurb": "NIGHTMARE STORIES FROM THE LAND OF TOTAL FEARRenowned as one of the great horror-writers of all time, H.P. Lovecraft produced works of enduring power. Now gathered together into this omnibus volume are seven classics of screaming supernatural terror and vilest horror...Front cover illustration by Tim White.Contents:- Introduction: H. P. Lovecraft's Novels by August Derleth- At the Mountains of Madness- The Case of Charles Dexter Ward- The Dreams in the Witch-House- The Statement of Randolph Carter- The Dream-Quest of Unknown Kadath- The Silver Key- Through the Gates of the Silver Key", "genre": ["Horror", "Fiction", "Fantasy", "Short Stories", "Science Fiction", "Classics", "Lovecraftian"], "author": "H.P. Lovecraft", "rating": "4.16", "pages": "552"}, {"id": 100090, "title": "Lord of a Visible World: An Autobiography in Letters", "blurb": "In Lord of a Visible World, the editors have amassed and arranged the letters of this prolific writer into the story of his life. The volume traces Lovecraft's upbringing in Providence, Rhode Island, his involvement with the pulp magazine Weird Tales, his short-lived marriage, and his later status as the preeminent man of letters in his field. In addition to conveying the candid details of his life, the volume also traces the evolution of his wide-ranging opinions. Lovecraft shows himself to be deeply engaged in the social, political, and cultural milieu of his time. The editors, two of the leading Lovecraft scholars, have meticulously edited the text, transcribing the letters from manuscript sources and supplying explanatory annotations throughout. Lord of a Visible World is of interest to both the general reader and the scholar, presenting for the first time a well-rounded portrait, in his own words, of a writer whose work has fascinated millions of readers.", "genre": ["Biography", "Nonfiction", "Lovecraftian", "Weird Fiction", "Autobiography", "Literature", "Horror"], "author": "H.P. Lovecraft", "rating": "4.20", "pages": "404"}, {"id": 100158, "title": "The Luck Factor: Changing Your Luck, Changing Your Life - The Four  Essential Principles", "blurb": "Is luck just fate, or can you change it? A groundbreaking new scientific study of the phenomenon of luck and the ways we can bring good luck into our lives. What is luck? A psychic gift or a question of intelligence? And what is it that lucky people have that unlucky people lack? Psychologist Dr. Richard Wiseman put luck under a scientific microscope for the very first tim\nIs luck just fate, or can you change it? A groundbreaking new scientific study of the phenomenon of luck and the ways we can bring good luck into our lives. What is luck? A psychic gift or a question of intelligence? And what is it that lucky people have that unlucky people lack? Psychologist Dr. Richard Wiseman put luck under a scientific microscope for the very first time, examining the different ways in which lucky and unlucky people think and behave. After three years of intensive interviews and experiments with over 400 volunteers, Wiseman arrived at an astonishing conclusion: Luck is something that can be learned. It is available to anyone willing to pay attention to the Four Essential Principles:1. Creating Chance Opportunities 2. Thinking Lucky 3. Feeling Lucky 4. Denying FateReaders can determine their capacity for luck as well as learn to change their luck through helpful exercises that appear throughout the book. Illustrated with anecdotes from the lives of the famous such as Harry Truman and Warren Buffett, The Luck Factor also richly portrays the lives of ordinary people who have been extraordinarily lucky or unlucky. Finally, Dr. Wiseman gives us a look into The Luck School where he instructs unlucky people and also teaches lucky people how to further enhance their luck. Smart, enlightening, fun to read, and easy to follow, The Luck Factor will give you revolutionary insight into the lucky mind and could, quite simply, change your life.About the AuthorDr. Richard Wiseman heads a research unit within the psychology department at the University of Herfordshire in Britain and was recently given the prestigious CSICOP Public Education in Science Award. This is his first book.\n...more", "genre": ["Psychology", "Nonfiction", "Self Help", "Science", "Self Help", "Personal Development", "Business", "Leadership", "Philosophy", "Business", "Entrepreneurship", "How To"], "author": "Richard Wiseman", "rating": "3.83", "pages": "232"}, {"id": 100225, "title": "Bob Marshall in the Adirondacks: Writings of a Pioneering Peak-Bagger, Pond-Hopper, and Wilderness Preservationist", "blurb": "Nearly forty writings about the Adirondacks by one of America's greatest champions of wilderness. These articles reveal Marshall's deep personal connection to the Adirondacks and the inspiration for his commitment to wilderness preservation.", "genre": ["History"], "author": "Phil Brown", "rating": "4.29", "pages": "334"}, {"id": 100238, "title": "Work Your Way Around the World", "blurb": "The thirteenth edition of the unique and acclaimed guide for the working traveller, which explains how to find temporary work around the world, not only in advance, but also when on the spot while travelling. It incorporates hundreds of first-hand accounts from people who have actually done the jobs, with a mass of hard factual information, which offers authoritative advice on how to find work, from selling ice cream in Cape town, to working as a film extra in Bangkok. Work Your Way Around the World gives information on all the main areas of temporary work, including the tourist industry, teaching English, childcare, and voluntary work, business and industry, and in addition, covers how to travel for free by land, sea and air. It also explains how to earn money by spotting some local opportunity, and gives dates and details of harvests from Denmark to New Zealand. Included is a country-by-country guide to the opportunities to be found.", "genre": ["Travel", "Nonfiction", "Reference", "Adventure", "Self Help", "Cultural", "How To"], "author": "Susan  Griffith", "rating": "3.59", "pages": "576"}, {"id": 100251, "title": "Vagabonding in America", "blurb": "", "genre": ["Travel"], "author": "Ed Buryn", "rating": "4.46", "pages": "353"}, {"id": 100253, "title": "The Little Guide to Your Well-Read Life: How to Get More Books in Your Life and More Life from Your Books", "blurb": "Do not set out to live a well-read life but rather your well-read life. No one can be well-read using someone else's reading list. Unless a book is good for you, you won't connect with it and gain from it. Just as no one can tell you how to lead your life, no one can tell you what to read for your life. How do readers find more time to read? In The Little Guide to Your Wel\nDo not set out to live a well-read life but rather your well-read life. No one can be well-read using someone else's reading list. Unless a book is good for you, you won't connect with it and gain from it. Just as no one can tell you how to lead your life, no one can tell you what to read for your life. How do readers find more time to read? In The Little Guide to Your Well-Read Life, Steve Leveen offers both inspiration and practical advice for bibliophiles on how to get more books in their life and more life from their books. His recommendations are disarmingly refreshing, as when he advises when not to read a book and why not to feel guilty if you missed reading all those classics in school. He helps readers reorganize their bookshelves into a Library of Candidates that they actively build and a Living Library of books read with enthusiasm, and he emphasizes the value of creating a Bookography, or annotated list of your reading life. Separate chapters are devoted to the power of audio books and the merits of reading groups. The author himself admits he came late to the bookshelf, making this charming little guide all the more convincing.\n...more", "genre": ["Nonfiction", "Writing", "Books About Books", "Self Help", "Reference", "Adult", "Language", "Writing", "Writing", "Essays", "How To", "Criticism", "Literary Criticism", "Audiobook"], "author": "Steve Leveen", "rating": "3.67", "pages": "132"}, {"id": 100281, "title": "Brainchildren: Essays on Designing Minds", "blurb": "A new collection of wide-ranging essays from one of cognitive science's most distingushed figures.Minds are complex artifacts, partly biological and partly social; only a unified, multidisciplinary approach will yield a realistic theory of how they came into existence and how they work. One of the foremost workers in this multidisciplinary field is Daniel Dennett. This boo\nA new collection of wide-ranging essays from one of cognitive science's most distingushed figures.Minds are complex artifacts, partly biological and partly social; only a unified, multidisciplinary approach will yield a realistic theory of how they came into existence and how they work. One of the foremost workers in this multidisciplinary field is Daniel Dennett. This book brings together his essays on the philosphy of mind, artificial intelligence, and cognitive ethology that appeared in inaccessible journals from 1984 to 1996. Highlights include Can Machines Think?, The Unimagined Preposterousness of Zombies, Artificial Life as Philosophy, and Animal Consciousness: What Matters and Why. Collected in a single volume, the essays are now available to a wider audience.\n...more", "genre": ["Philosophy", "Science", "Psychology", "Nonfiction", "Artificial Intelligence", "Writing", "Essays"], "author": "Daniel C. Dennett", "rating": "3.83", "pages": "430"}, {"id": 100285, "title": "How to Retire Happy, Wild, and Free: Retirement Wisdom That You Won't Get from Your Financial Advisor", "blurb": "Retirement does not have to mean the end of life-in fact it can mean a whole new beginning to the life you never had time to explore. In HOW TO RETIRE HAPPY, WILD, AND FREE, best-selling author Ernie J. Zelinksi shows that the key to enjoying an active and satisfying retirement is dependent on much more than just having adequate financial resources. It means paying attenti\nRetirement does not have to mean the end of life-in fact it can mean a whole new beginning to the life you never had time to explore. In HOW TO RETIRE HAPPY, WILD, AND FREE, best-selling author Ernie J. Zelinksi shows that the key to enjoying an active and satisfying retirement is dependent on much more than just having adequate financial resources. It means paying attention to all aspects of life, including leisure activities, creative pursuits, physical and mental well-being, and solid social support. With its friendly format, lively cartoons, and captivating quotations, Zelinski'¬?s guide offers inspirational advice on how to follow your dreams instead of someone else'¬?s, how to put your retirement in proper perspective, and how to enjoy life after work. A retirement guide from best-selling author Ernie J. Zelinski. Features tips for taking early retirement; in fact, the earlier the better. Ernie J. Zelinski'¬?s best-selling THE JOY OF NOT WORKING has sold more than 150,000 copies in 15 languages.\n...more", "genre": ["Nonfiction", "Economics", "Finance", "Finance", "Personal Finance", "Self Help", "Business", "Currency", "Money", "How To", "Spirituality", "Reference", "Travel"], "author": "Ernie J. Zelinski", "rating": "3.75", "pages": "256"}, {"id": 100303, "title": "Prague in Black and Gold: Scenes from the Life of a European City", "blurb": "Prague is at the core of everything both wonderful and terrible in Western history, but few people truly understand this city's unique culture. In Prague in Black and Gold, Peter Demetz strips away sentimentalities and distortions and shows how Czechs, Germans, Italians, and Jews have lived and worked together for over a thousand years. .", "genre": ["History", "Nonfiction", "Travel", "European History", "Czech Literature", "Cities", "Cultural"], "author": "Peter Demetz", "rating": "3.62", "pages": "432"}, {"id": 100305, "title": "Prague in Black and Gold: The History of a City", "blurb": "From the Velvet Revolution to the disturbing world of Franz Kafka, from the devestation of the Thirty Years War to the musical elegance of Mozart and Dvorak, Prague is steeped in a wealth of history and culture. PRAGUE IN BLACK AND GOLD is a first class history of this unique city, allowing us to unravel layer upon layer of startlingly symbolic sites and buidings to reveal the real Prague. PRAGUE IN BLACK AND GOLD is an exceptional work - and exceptionally reliable ... I am sure that thiswill be an important and exciting guide for all who wish to learn more about the famous people and important events in the history of the Czech lands and their capital Ivan Klima, The Times", "genre": ["History", "Nonfiction", "Travel", "European History", "Czech Literature", "Cities", "Cultural"], "author": "Peter Demetz", "rating": "3.62", "pages": "432"}, {"id": 100334, "title": "Arthurian Myth And Legend An A To Z Of Peo", "blurb": "No other imaginary or mythological character has amassed the number of tales that King Arthur has. The enormous task of consolidating all of the people, places, facts, and countless other elements involved in Arthurian history into one volume might seem remarkable. Add that it shoudl be organized into a user-friendly reference book, dictionary-style, and you might call it impossible.  But Mike Dixon-Kennedy has done just that in Athurian Myth & Legend: An A-Z of People and places...Although many of the stories associated with King Arthur have fantastical attributes like magical swords and love potions, they all appear to have at least some foundation in history. Some have very definite Celtic origins, whereas other come from still further afiield..... To read these stories as just that -- stories -- is fascinating and will bring countless hours of enjoyment. To read between the lines and try to uncover a historical link in them will prove to be endlessly engaging.", "genre": ["Mythology", "Arthurian", "Nonfiction"], "author": "Mike Kennedy", "rating": "3.94", "pages": "First"}, {"id": 100336, "title": "Arthurian Myth & Legend: An A-Z of People and Places", "blurb": "Few legends have benefited from more retellings and more interpretation than have the tales of King Arthur and his Knights of the Round Table How can you find out what you want to know about the characters, the origins, and the events without acquiring an entire bookshelf of volumes? This all-in-one, authoritative A to Z guide -- the result of over 15 years of research -- makes it easy to locate exactly what you're looking for. Begin with Aalardin, a knight who possessed magical knowledge and wed the grandniece of Arthur, move on to Diwrnach, an Irishman who owned a wondrous cauldron that became one of the Thirteen Treasures of Britain; and end with Zitus, the name used in a Spanish romance to refer to Arthur. Of course, you'll also get long entries for the most unforgettable personalities and plot lines, such as Lancelot, Guinevere, and the search for the Holy Grail. Filled with fascinating details that will entrance anyone who loves these wonderful legends.", "genre": ["Mythology", "Arthurian", "Nonfiction"], "author": "Mike Dixon-Kennedy", "rating": "3.94", "pages": "304"}, {"id": 100351, "title": "The Smoke Ring", "blurb": "In the free-fall environment of the Smoke Ring, the descendants of the crew of the Discipline no longer remembered their Earth roots -- or the existence of Sharls Davis Kendy, the computer-program despot of the ship. Until Kendy initiated contact once more.Fourteen years later, only Jeffer, the Citizens Tree Scientist, knew that Kendy was still watching -- and waiting. Then the Citizens Tree people rescued a family of loggers and learned for the first time of the Admiralty, a large society living in free fall amid the floating debris called the Clump. And it was likely that the Admiralty had maintained, intact, Discipline's original computer library.Exploration was a temptation neither Jeffer nor Kendy could resist, and neither Citizens Tree nor Sharls Davis Kendy would ever be the same again...", "genre": ["Science Fiction", "Fiction", "Science Fiction Fantasy", "Hard Science Fiction", "Fantasy", "Audiobook", "Space"], "author": "Larry Niven", "rating": "3.78", "pages": "323"}, {"id": 100357, "title": "A Day in a Medieval City", "blurb": "An opportunity to experience the daily hustle and bustle of life in the late Middle Ages, A Day in a Medieval City provides a captivating dawn-to-dark account of medieval life. A visual trek through the thirteenth and fourteenth centuries—with seasoned historian and expert on medieval iconography Chiara Frugoni as guide—this book offers a vast array of images and vignettes that depicts the everyday hardships and commonplace pleasures for people living in the Middle Ages.A Day in a Medieval City breathes life into the activities of the city streets, homes, fields, schools, and places of worship. With entertaining anecdotes and gritty details, it engages the modern reader with its discoveries of the religious, economic, and institutional practices of the day. From urban planning and education to child care, hygiene, and the more leisurely pursuits of games, food, books, and superstitions, Frugoni unearths the daily routines of the private and public lives of citizens. A Day in a Medieval City is a charming portal to the Middle Ages that you'll surely want with you on your travels to Europe—or in your armchair.“With its color illustrations of rare paintings and artifacts, this thoughtful and informative, elegantly fashioned excursion into the life of a medieval city is a veritable feast of information and visual delights. Frugoni is a marvelously experienced historical travel guide.”—Choice “Stunningly beautiful . . . and a good read as well. . . . It’s amazing how much wealth of detail and image Ms. Frugoni has packed into this delightful, relatively small book.”—Steve Goode, Washington Times“Charming and insightful. . . .Written with exceptional grace and infused with a warm sense of humanity.”—Library Journal", "genre": ["History", "Nonfiction", "Medieval", "Italy", "Italian Literature", "Medieval History"], "author": "Chiara Frugoni", "rating": "3.54", "pages": "224"}, {"id": 100446, "title": "Quidditch Through The Ages And Fantastic Beasts And Where To Find Them", "blurb": "Now you can read two of Harry Potter's Hogwarts textbooks. Quidditch Through the Ages describes the evolution of Quidditch through the generations, and includes the rules of the game, a chapter on modern-day play, and a description of every team. A copy of Fantastic Beasts & Where to Find Them resides in almost every wizarding household in the country. Now, Muggles also ha\nNow you can read two of Harry Potter's Hogwarts textbooks. Quidditch Through the Ages describes the evolution of Quidditch through the generations, and includes the rules of the game, a chapter on modern-day play, and a description of every team. A copy of Fantastic Beasts & Where to Find Them resides in almost every wizarding household in the country. Now, Muggles also have the chance to learn all about Quintapeds, Puffskeins, and Knarls. This is the most complete A-to-Z listing of magical beasts in existence. The braille and PortaBook editions include the comments scribbled into the margins by Harry and his friends.\n...more", "genre": ["Fantasy", "Fiction", "Young Adult", "Childrens", "Fantasy", "Magic", "Science Fiction Fantasy", "Novels", "Childrens", "Middle Grade", "European Literature", "British Literature", "Reference"], "author": "J.K. Rowling", "rating": "4.38", "pages": "150"}, {"id": 100458, "title": "Fabulous Beasts", "blurb": "Beisner's fabulous paintings in glorious colors illustrate Lurie's splendid tales of mythical animals, creatures immortalized in legends kept alive in remote parts of the globe.-Publisher's Weekly. Beisner and Lurie have produced a fabulous beast themselves.-School Library Journal", "genre": ["Dragons", "Juvenile", "Fantasy", "Mythology", "Picture Books"], "author": "Alison Lurie", "rating": "4.12", "pages": "32"}, {"id": 100483, "title": "The Toll-Bridge Troll", "blurb": "A fierce troll challenges a smart little boy in this book filled with funny riddles and rebus-like drawings. “The swift, puckish story and its plucky hero will appeal tremendously, especially to the many children inspired to play toll-bridge by The Three Billy Goats Gruff.”--Publishers Weekly", "genre": ["Childrens", "Picture Books", "Childrens", "Fantasy", "Humor", "Folklore"], "author": "Patricia Rae Wolff", "rating": "3.78", "pages": "24"}, {"id": 100582, "title": "Strangers in Paradise, Volume 3: It's A Good Life", "blurb": "Strangers In Paradise: It's A Good Life is the continuing saga of three friends, Katchoo, Francine and David. This volume finds our friends chasing each other to Hawaii in the name of love. Francine becomes involved with former beau, Freddie and Katchoo gets involved with everyone!", "genre": ["Graphic Novels", "Comics", "Fiction", "Graphic Novels Comics", "Romance", "LGBT", "Comic Book"], "author": "Terry Moore", "rating": "4.25", "pages": "88"}, {"id": 100591, "title": "Sheepdog in the Snow", "blurb": "A young lamb that is rescued by a farmer and raised with the family's sheepdog grows up thinking of himself as a dog, and his ability to herd sheep proves very valuable during a severe snowstorm.\nA young lamb that is rescued by a farmer and raised with the family's sheepdog grows up thinking of himself as a dog, and his ability to herd sheep proves very valuable during a severe snowstorm.\n...more", "genre": ["Childrens", "Picture Books", "Animals", "Childrens", "Childrens", "Juvenile"], "author": "Martin Hall", "rating": "4.11", "pages": "32"}, {"id": 100609, "title": "Strangers in Paradise 2", "blurb": "Libro 3, La vida está bien --Libro 4, Enemigos inmortales --", "genre": ["Sequential Art", "Graphic Novels", "Sequential Art", "Comics", "LGBT", "Romance", "Fiction", "Graphic Novels Comics", "LGBT", "Queer", "Sequential Art", "Manga", "Comics", "Comic Book", "Contemporary"], "author": "Terry Moore", "rating": "4.28", "pages": "331"}, {"id": 100617, "title": "Goblins", "blurb": "Edward takes Myrtle to the woods to show her goblins, but Myrtle insists that they don't exist. Edward sees the goblins, but Myrtle takes the scientific approach--all she sees are toads, fairy rings, and cross-eyed bats. See if little Edward is right . . . can you see the goblins? Ingenious pop-ups and pull-tabs will entertain children for hours. Color illustrations.\nEdward takes Myrtle to the woods to show her goblins, but Myrtle insists that they don't exist. Edward sees the goblins, but Myrtle takes the scientific approach--all she sees are toads, fairy rings, and cross-eyed bats. See if little Edward is right . . . can you see the goblins? Ingenious pop-ups and pull-tabs will entertain children for hours. Color illustrations.\n...more", "genre": ["Fantasy", "Childrens"], "author": "Brian Froud", "rating": "4.60", "pages": "12"}, {"id": 100618, "title": "Lady Cottington's Pressed Fairy Journal", "blurb": "Lady Angelica Cottington took the infamous p hotograph of a group of fairies that was authenticated by Ar thur Conan Doyle. This book presents a collection of journal extracts from Lady Cottington''s Pressed Fairy Book. '", "genre": ["Fantasy", "Art", "Fiction", "Humor", "Childrens", "Fairies", "Picture Books"], "author": "Terry Jones", "rating": "4.03", "pages": "112"}, {"id": 100643, "title": "Historia de un átomo", "blurb": "The story of matter and the history of the cosmos from the perspective of a single oxygen atom, told with the insight and wit of one of the most dynamic physicists and writers working today. Through this astonishing work, he manages to stoke wonder at the powers and unlikely events that conspired to create our solar system, our ecosystem, and us.", "genre": ["Science", "Nonfiction", "Science", "Physics", "History", "Science", "Astronomy", "Science", "Popular Science", "Space", "Science", "Biology", "Biology", "Evolution", "Philosophy"], "author": "Lawrence M. Krauss", "rating": "4.03", "pages": "0"}, {"id": 100697, "title": "Greats of the Game: The Players, Games, Teams, and Managers That Made Baseball History", "blurb": "A deceptively simple game rich in subtleties, baseball, more than any other sport, is passed down parent to child, one generation to another. In every era, fans have found heroes to cheer, and in part our attachment to the game has been fueled by hotly contested efforts to measure the superstars of the present against the titans of yesteryear. Greats of the Game fondly c\nA deceptively simple game rich in subtleties, baseball, more than any other sport, is passed down parent to child, one generation to another. In every era, fans have found heroes to cheer, and in part our attachment to the game has been fueled by hotly contested efforts to measure the superstars of the present against the titans of yesteryear. Greats of the Game fondly contributes to the nostalgic appeal of the national pastime by celebrating, in a subjective, engagingly outspoken text and dazzling, rarely seen photographs, the game's greatest players, teams, managers, games, and colorful personalities. Here are a century's worth of stars and highlights: Babe Ruth and Nolan Ryan, Jackie Robinson and Barry Bonds, Don Larsen's perfect game, Willie Mays's catch of Vic Wertz's 450-foot drive in the 1954 World Series. Ray Robinson, author of the definitive biography of Lou Gehrig, shares more than 70 years of memories, while fellow baseball maven Christopher Jennison describes the stunning photos he has selected, in a lavish, opinionated treasury that is certain to inspire passionate debate.\n...more", "genre": ["Sports", "Baseball"], "author": "Ray Robinson", "rating": "3.50", "pages": "224"}, {"id": 100772, "title": "A Alma Imoral", "blurb": "Reconstruindo os significados de 'corpo' e 'alma', Nilton Bonder procura contrapor o conceito de alma imoral do texto bíblico ao animal moral da psicologia evolucionista. O autor defende que o corpo que preserva e a alma que trai são responsáveis pelo processo de reprodução. A intenção do autor é transportar o leitor para um campo de batalha milenar onde o traído troca de \nReconstruindo os significados de 'corpo' e 'alma', Nilton Bonder procura contrapor o conceito de alma imoral do texto bíblico ao animal moral da psicologia evolucionista. O autor defende que o corpo que preserva e a alma que trai são responsáveis pelo processo de reprodução. A intenção do autor é transportar o leitor para um campo de batalha milenar onde o traído troca de lugar com o traidor, o santo com o marginal, o corpo com a alma.\n...more", "genre": ["Philosophy", "Nonfiction", "Literature", "Jewish", "Religion", "Theology", "Religion"], "author": "Nilton Bonder", "rating": "4.18", "pages": "136"}, {"id": 100790, "title": "The Predators' Ball", "blurb": "A lead reporter for The American Lawyer tells the story of the night that sparked the corporate takeover mania of the eighties, the 1985 Predators Ball, and how one man--Michael Milken, a junk bond impresario, financed the corporate takeover kings.\nA lead reporter for The American Lawyer tells the story of the night that sparked the corporate takeover mania of the eighties, the 1985 Predators Ball, and how one man--Michael Milken, a junk bond impresario, financed the corporate takeover kings.\n...more", "genre": ["Business", "Economics", "Finance", "Nonfiction", "Economics", "History", "Law", "Biography", "Crime", "True Crime", "Buisness", "Mystery", "Crime"], "author": "Connie Bruck", "rating": "4.08", "pages": "3"}, {"id": 100875, "title": "Kurt Vonnegut", "blurb": "An introduction to the paradoxical author of Slaughterhouse-Five and other novels reflecting an absurd universe.", "genre": ["Nonfiction", "Literary Criticism"], "author": "James Lundquist", "rating": "3.47", "pages": "136"}, {"id": 100888, "title": "Frommer's New England", "blurb": "You'll never fall into the tourist traps when you travel with Frommer's. It's like having a friend show you around, taking you to the places locals like best. Our expert authors have already gone everywhere you might go -- they've done the legwork for you, and they're not afraid to tell it like it is, saving you time and money. No other series offers candid reviews of so many hotels and restaurants in all price ranges. Every Frommer's Travel Guide is up-to-date, with exact prices for everything, dozens of color maps, and exciting coverage of sports, shopping, and nightlife. You'd be lost without us Frommer's New England features gorgeous full-color photos of the historic sights, stunning landscapes, and seaside towns that await you. Meticulously researched by a team of expert residents who know this region intimately, this is an extraordinary and highly personal guide to one of America's most scenic regions.Frommer's New England is packed with candid opinions on the best country inns and restaurants, lobster pounds, antique shops, foliage tours, beaches, hiking, biking, and other outdoor adventures. We've covered all the perennial favorites, from the Freedom Trail to the Berkshires and beyond, but we'll also take you off the beaten track to discover New England's best small towns and most pristine wild places. Whether you want a romantic getaway in a Vermont country inn or family fun on the Cape's best beaches, Frommer's will help you design the trip that's right for you. You'll even find a color fold-out map", "genre": ["Travel", "Nonfiction"], "author": "Paul Karr", "rating": "3.68", "pages": "692"}, {"id": 100889, "title": "Rick Steves' England 2007", "blurb": "Who but Rick Steves can tell travelers how to see a Shakesperean play in the original Globe Theatre or explore the nightlife of Blackpool? With Rick Steves’ England 2007, travelers can experience Rick's favorite destinations in London, Bath, York, the Cotswolds, the Lake District, Manchester, and the Sussex Downs – economically and hassle-free. Completely revised and updated, Rick Steves’ England 2007 includes: opinionated coverage of both famous and lesser-known sights; friendly places to eat and sleep; suggested day plans; walking tours and trip itineraries; clear instructions for smooth travel anywhere by car, train, or foot.", "genre": ["Travel", "Nonfiction"], "author": "Rick Steves", "rating": "4.36", "pages": "512"}, {"id": 100983, "title": "The Blackwell Guide to Plato's Republic", "blurb": "The Blackwell Guide to Plato's Republic consists of thirteen new essays written by both established scholars and younger researchers with the specific aim of helping readers to understand Plato's masterwork.   This guide to Plato's Republic is designed to help readers understand this foundational work of the Western canon. Sheds new light on many central features and themes of the Republic. Covers the literary and philosophical style of the Republic; Plato's theories of justice and knowledge; his educational theories; and his treatment of the divine. Will be of interest to readers who are new to the Republic, and those who already have some familiarity with the book.", "genre": ["Philosophy"], "author": "Gerasimos Xenophon Santas", "rating": "3.25", "pages": "304"}, {"id": 100995, "title": "Ranches: Design Ideas for Renovating, Remodeling, and Building New", "blurb": "Ranches is a unique combination of outstanding designs and proven ideas for renovating, remodeling, and building a ranch-style home. Featuring over 20 examples of updated homes and new ranches, the book is illustrated with inspiring original color photography and before and after floor plans.", "genre": ["Architecture", "Nonfiction"], "author": "M. Caren Connolly", "rating": "3.70", "pages": "202"}, {"id": 101007, "title": "Destination: Morgue", "blurb": "Hollywood Fuckpad, Hot Prowl Rape-O and Jungletown Jihad are vintage Ellroy: starting in 1983 and ending in the present day, they are interlinked novellas telling the story of a bad cop, Rick Jenson, and his twenty-year obsession with Donna Donahue, a beautiful Hollywood actress. The only way Rick can get close to Donna is by bringing her into investigations of the teeming Tinseltown underworld: psychopathic killers, stalkers and terrorists commingle in an unholy cocktail of sex, sleaze and violence. Jenson and Donahue cut a swathe through the cases, treading a high wire of danger and a fatal sexual attraction.The book also contains eight previously unpublished non-fiction articles ranging from cases from the Los Angeles Police Unsolved Homicide files to the first article Ellroy has ever written on his imaginative process: Where I Get My Weird Shit. This is James Ellroy's second collection of short pieces following on from Dick Contino's Blues. 'James Ellroy is a genius: the finest American crime writer since Raymond Chandler, and one of the most readable experimental writers in the world' TLS'All Ellroy's preoccupations are present: corruption, sex, violence, unsolved murders and excess by the dozen. As ever the results are as fascinating as a car crash' Guardian'One of the finest US writers. Admirers will be pleased to learn that Ellroy's Mad Dog voice barks as loudly as ever, continuing to create it's own howling, breathtaking brand of powerful, pumped-up poetry' City Life", "genre": ["Crime", "Fiction", "Noir", "Short Stories", "True Crime", "Mystery", "Essays"], "author": "James Ellroy", "rating": "3.31", "pages": "389"}, {"id": 101059, "title": "Give Peace a Chance: Exploring the Vietnam Antiwar Movement: Essays from the Charles DeBenedetti Memorial Conference", "blurb": "This work offers an introduction to the best-known antiwar movement in United States history, written by veterans of the Vietnam War and participants in the movement. It examines how the activities of the movement affected the lives of most Americans.", "genre": ["History"], "author": "Melvin Small", "rating": "4.22", "pages": "300"}, {"id": 101135, "title": "Los Angeles: The Architecture of Four Ecologies", "blurb": "Reyner Banham examined the built environment of Los Angeles in a way no architectural historian before him had done, looking with fresh eyes at its manifestations of popular taste and industrial ingenuity, as well as its more traditional modes of residential and commercial building. His construct of four ecologies examined the ways Angelenos relate to the beach, the free\nReyner Banham examined the built environment of Los Angeles in a way no architectural historian before him had done, looking with fresh eyes at its manifestations of popular taste and industrial ingenuity, as well as its more traditional modes of residential and commercial building. His construct of four ecologies examined the ways Angelenos relate to the beach, the freeways, the flatlands, and the foothills. Banham delighted in this mobile city and identified it as an exemplar of the posturban future.\n...more", "genre": ["Architecture", "Nonfiction", "History", "Geography", "Cities", "Cities", "Urbanism", "Cities", "Urban Planning", "Urban", "Cities", "Urban Studies", "Science", "Geography", "Travel"], "author": "Reyner Banham", "rating": "4.15", "pages": null}]